[
    {
        "id": "44db74ef-a0ea-46a9-ab27-4fa1aabbc334",
        "build_id": "0993cbfb-96c5-4477-ae60-2af50602eafd",
        "round_number": 1,
        "cash_earned": 0,
        "created_at": "2025-05-25T10:12:21.488+00:00",
        "notes": "### Hover over the item icons (not hyperlinks) to read additional information!\n\nAlways buy  [Armored Vest](item_358361e2-59be-4c81-b221-8a87f37809e6) and  [First Aid Kit](item_0172eaaa-1902-44a3-b989-d12f0f7301da) \nExtra HP allows you to earn more money\n\nIn the first two rounds, your job is to simply survive and deal damage, getting assists and eliminations for participating in the fight. If you take a lot of risks to get solo kills without having extra hp and die, you will not only spend more time running from the respawn to the action (and therefore earn less), you will also give money to your opponents.\n\nThe exception would be if you have a pocket Mercy. Not some random guy on your team, but a person who will definitely boost your damage. The bonus from Mercy is multiplicative, and together with 10% AP you will deal up to 165.9 damage from a rocket explosion versus 150.8 without an AP item. Without Mercy, who buffs your bullets, not only 15 damage, but even 30 damage is not worth neglecting survival, but with a constant damage boost, it becomes the difference between \"target is killed\" and \"target goes around the corner and they get healed.\"\n\nIf you want to understand exactly how the Helix Rockets work, and how Powers works with them, then read my post: \n[click](https://www.reddit.com/r/Overwatch/comments/1kj4yp9/soldier_76s_rockets_in_stadium_what_you_need_to/)",
        "stats": {
            "LIFE": 250,
            "Armor": 25,
            "Shield": 25,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 306,
            "Attack Speed": 0,
            "Weapon Power": 0,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "22e039a1-8324-49ea-a557-4bd4375f5e11",
                "notes": "Without any items, you can deal 251 damage with a direct hit from a rocket and 5 bullets. With +5% weapon power and +10% ability power items, you can kill a 250 HP target with a direct hit from a rocket and 4 bullets. Is -1 bullet worth 25 of your armor when you don't have pocket Mercy?",
                "action": "optional",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "1ab0555b-ef3d-4195-b63c-5eba8c5c367b",
                "notes": "The reason Soldier has 19 damage per bullet instead of 19.5+ is because 25 armor is enough to reduce the damage of his first three bullets to 12. +5% WP gives Soldier +7 damage with his third bullet against a hero who has bought 25 armor. But since the rockets exploding under the enemy's feet only deal 127 damage at +10% AP, you'll have to shoot for too long before that +7 damage from the third bullet will lead to anything.",
                "action": "buy",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "509f92a4-f65f-41d3-8a4c-9e010cd3a207",
                "notes": "",
                "action": "buy",
                "upgrade_id": "808afc07-1398-4962-bf2c-f8e3b74014e3"
            },
            {
                "id": "0f750ec9-ec4f-4959-94dd-cfd50bad1e28",
                "notes": "Shields on top of armor will not work as armor! Armor will only start reducing damage when everything on top of it (shields and overhealth) is gone.",
                "action": "buy",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "b1cd10de-0788-440c-ad5d-a3bcba13401c",
                "notes": "If you play with Mercy, then take both +5% WP and +10% AP, so that you can kill enemies with 300 HP, 50 of which is armor, with one Helix and 5-6 bullets after.",
                "action": "optional",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            }
        ]
    },
    {
        "id": "ec71e196-3766-40e0-a9b2-1f1e55a977b0",
        "build_id": "0993cbfb-96c5-4477-ae60-2af50602eafd",
        "round_number": 2,
        "cash_earned": 0,
        "created_at": "2025-05-25T10:12:21.488+00:00",
        "notes": "If you have a lot of money, you can get [Custom Stock](item_17d633af-8bcc-4893-b865-be0a7bc66fe2) for an extra 10% ability power. \n\nAlso note that I'm not selling survival items because you won't have enough rocket damage until round 3 for the extra 10% ability power to matter.\n\nBut if you play with pocket Mercy, you can take a risk if you are just a little short of another +10% AP item. This will add 6 to 13 damage to your rockets under the blue beam, depending on whether you hit direct or somewhere nearby. Whether it is worth it or not - decide for yourself.\n\nThe third option is if you get a map with good high grounds, then you can take  [Bomb Diffusal Boots](item_c555901e-1b69-4040-8420-ee81cbaf6d90) because a strong position and mobility will be better than a small bonus to damage or survival.",
        "stats": {
            "LIFE": 270,
            "Armor": 25,
            "Shield": 25,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 320,
            "Attack Speed": 0,
            "Weapon Power": 0,
            "Ability Power": 30,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "0c15b584-5f16-4c91-bbcd-002e9762b15a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "808afc07-1398-4962-bf2c-f8e3b74014e3"
            },
            {
                "id": "358cee65-7935-4d2c-b616-6daabf88452f",
                "notes": "It's very rare when I play with a pocket Mercy that I'll be able to save up enough for two +10% AP blue items, one +20% item, and one +10% green item by round 2. But when that happens, I almost always take them at the expense of survivability so I can continue snowballing. Keep in mind that Mercy often provides more value to the team when she revives someone and activates Valkyrie, so your goal is simply to not die in bad spots and maximize your damage advantage.",
                "action": "optional",
                "upgrade_id": "f83a1d9e-91f8-4d2c-bd62-c673b8d9fd2e"
            },
            {
                "id": "287c9df2-65c2-4853-ad3a-7e5717967903",
                "notes": "+30% AP will give you up to 150.8 damage from rocket explosions and 202.8 from a direct hit. +40% AP will give 162.4 and 218.4. Now add Mercy's boost to this (multiply by 1.3) and it will become clear why such a Soldier can already start to dominate in the second round.",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "d6d97b1d-00a2-4acf-8468-5b0f589a4f85",
                "notes": "Genji, Reaper, Mei, Queen, Lucio, Moira - all of these heroes can be a big problem for Soldier in the early game because he has no escape. This item gives both escape and vertical mobility. Sometimes this item means the difference between \"can't play\" and \"contributing a little and making money\".",
                "action": "optional",
                "upgrade_id": "c555901e-1b69-4040-8420-ee81cbaf6d90"
            },
            {
                "id": "f1a4d165-d2ac-4903-83e8-7d6aac62e93d",
                "notes": "5% WP can be surprisingly useful against armor, but only when the target has at least 100 of it and you're ready to fire a lot of bullets. 100 armor can be removed with 9 Soldier bullets, which will deal 108 damage (12x9). But with +5% WP the damage will be 123.5 (12.95 x 8 = 103, after which the armor stops working and the ninth bullet deals 19.95). However, in this build, even 100 armor on squishies is not important, because you have two sources of large portions of damage: Helix and MotK",
                "action": "optional",
                "upgrade_id": "17d633af-8bcc-4893-b865-be0a7bc66fe2"
            },
            {
                "id": "ea9aca87-83b1-4816-ad6e-ee4fbfb3e61c",
                "notes": "A small boost to survivability will be more important than weapon power percentages or attack speed",
                "action": "optional",
                "upgrade_id": "8714087c-c078-4619-a2ef-327bc6edaa69"
            },
            {
                "id": "ce4db5ee-2351-4dc6-bf98-79931e6b9768",
                "notes": "If you have 350 HP in 2nd round then you will die only because of your mistakes. This option is good when the team is strong and you can simply help with your damage and earn money for participation. I would call this the greediest and safest option.",
                "action": "optional",
                "upgrade_id": "086a91da-b65d-4047-8fc7-28a992078b1d"
            },
            {
                "id": "f3dcfe7e-3157-4b66-8ea6-8190de1c5995",
                "notes": "",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "11220c27-1e48-4a25-8113-41089463c7a8",
                "notes": "",
                "action": "buy",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "4d2ef440-05fa-478f-b31a-5e80d1cdf0b1",
                "notes": "Shields on top of armor will not work as armor! Armor will only start reducing damage when everything on top of it (shields and overhealth) is gone.",
                "action": "buy",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            }
        ]
    },
    {
        "id": "995d2a9f-93a2-4027-bc93-71cf021b04af",
        "build_id": "0993cbfb-96c5-4477-ae60-2af50602eafd",
        "round_number": 3,
        "cash_earned": 0,
        "created_at": "2025-05-25T10:12:21.488+00:00",
        "notes": "Here are the two main items you must earn money for in the first two rounds: [Mark of the Kitsune](item_09a53e39-25aa-4f66-ba51-bedbc543a1eb) and [Three-tap Tommygun](item_39c5d2a4-1db0-444f-86d9-2a1e9a331429) \nEverything else is irrelevant, and here's why:\n\n[Mark of the Kitsune](item_09a53e39-25aa-4f66-ba51-bedbc543a1eb) (MotK)\nThe damage from this item scales off your AP, which is perfect for a Helix Rockets build. But that's not all! This damage is dealt separately and counts as another bullet, allowing MotK to activate items like TTT. Additionally, the bonus damage for your next hit on an enemy does not expire over time, so you can prime MotK early by using either Helix or Biotic Field.\n\n[Three-tap Tommygun](item_39c5d2a4-1db0-444f-86d9-2a1e9a331429) (TTT)\nLike the previous item, the bonus damage is dealt in a separate instance, but is no longer counted as a bullet and depends only on the enemy's max HP. In the 3rd round, your opponents will have about 300-350, which means one TTT trigger will give you up to 31.5 damage or one and a half extra bullets. Just like with MotK, you can prime this effect in advance.\n\nSince you only need 2 hits after casting the ability to fully utilize both items, let's calculate how much damage you'll do with just these two items for 2 bullets + Helix + 2 bullets on a 300HP target:\n\nWhen you do max damage from Helix explosion: (19+9+30+9+19+9) + 139.2 + (19+9+30+9+19+9) = 329.2\n\nWhen min damage from Helix: (19+9+30+9+19+9) + 84 + (19+9+30+9+19+9) = 274\n\nIn the second case, you only need 2 more bullets before or after Helix to finish off the target.\n\nThis is why you should take  [Track and Field](item_b3750fe4-e416-42b6-ad9e-fe92c7dcffc5) as your second power - it will allow you to activate items much more often, and will also reduce your downtime and help you to hold good positions longer.\n\nYou can also choose  [On Me!](item_cd2a0247-bc79-4f0b-b9ee-d985e3f9a9a7) if you really lack the survivability. You won't be able to use your combo every 6-8 seconds, but sometimes it's more important to win one duel every 20 seconds than to have three attempts with a low chance of success.\n\nWhat to do if your previous rounds were unsuccessful and you don't have enough money? Then buy only MotK and maximize AP, or just pivot your build! Don't choose [Track and Field](item_b3750fe4-e416-42b6-ad9e-fe92c7dcffc5) , try this build until round 7 instead: https://stadiumbuilds.io/build/cdc7a231-5b0a-4f69-a7aa-79f1b425d20a",
        "stats": {
            "LIFE": 291,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 291,
            "Attack Speed": 10,
            "Weapon Power": 0,
            "Ability Power": 20,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "a7b4b553-36d3-4f8a-8ff5-a60f3fd4f8b1",
                "notes": "",
                "action": "buy",
                "upgrade_id": "808afc07-1398-4962-bf2c-f8e3b74014e3"
            },
            {
                "id": "c4d5eccb-7ad7-40cd-9627-63ace4f96a94",
                "notes": "",
                "action": "buy",
                "upgrade_id": "b3750fe4-e416-42b6-ad9e-fe92c7dcffc5"
            },
            {
                "id": "26d00a2a-8f41-477a-bf8f-1860f2b71a9c",
                "notes": "",
                "action": "optional",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "42d5e008-1e18-4fcc-9059-b4cc8de54328",
                "notes": "",
                "action": "optional",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "ee25f4bc-2acb-4dd3-92ce-8287e0436888",
                "notes": "",
                "action": "buy",
                "upgrade_id": "09a53e39-25aa-4f66-ba51-bedbc543a1eb"
            },
            {
                "id": "ffbc3d4b-0404-4247-9e89-75d7172518a6",
                "notes": "",
                "action": "optional",
                "upgrade_id": "17d633af-8bcc-4893-b865-be0a7bc66fe2"
            },
            {
                "id": "becdd60b-9627-4a78-9500-2486011799bb",
                "notes": "",
                "action": "optional",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "2a1595bf-8286-41c9-8a63-95f6d8d4b785",
                "notes": "",
                "action": "optional",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "7414bb51-2f8f-433e-859e-19ad4912e48e",
                "notes": "",
                "action": "buy",
                "upgrade_id": "39c5d2a4-1db0-444f-86d9-2a1e9a331429"
            }
        ]
    },
    {
        "id": "f58d6c8a-f010-4622-af7d-6a77bed57dea",
        "build_id": "0993cbfb-96c5-4477-ae60-2af50602eafd",
        "round_number": 4,
        "cash_earned": 0,
        "created_at": "2025-05-25T10:12:21.488+00:00",
        "notes": "### Because of the way items work in this build, Soldier has a combo that is meant to optimize your Time To Kill, as well as a benchmark for measuring your burst damage.\n\n**Combo: 3 bullets - Helix - 3 bullets**\n\nThere are three reasons for three bullets instead of two or four: 1) it feels natural: it's easier for you to catch the rhythm of the shots and it's easier to hold the button down for 330ms instead of 220 or 440 2) there are enough bullets in such a combo that increasing WP in the late game or in other build variants makes sense 3) this amount of bullets together with the damage from Helix should be enough for you to kill a non-tank who does not buy more than one survival item.\n\nTo perform this combo, you must first prime MotK and TTT, using the ability: either Biotic Field or Helix Rockets. The second is most beneficial, because then you will have BF ready to either start a new combo in 5 seconds, or hold the position / heal yourself.\n\nBut why should the combo end at 3 bullets? What to do if your enemy is not dead?\n\nSimple answer: keep shooting, because it's better in terms of DPS than activating BF to get new bonuses from items. BUT! There are two situations when you need to use a long combo 3+H+3+BF+3 (or 3+BF+3+H+3).\n\nThe first is when your target is further than 30m away from you, and your bullets do less damage, Double Helix's auto-lock does not work and rockets are unlikely to do any damage (because they will be dodged). Since the bonus damage from items does not fall off with distance, you can pressure some Ashe or Ana from afar, and at the same time use BF to heal. Similarly, in duels with Cassidy at a long distance, because you will have an advantage in sustain and damage.\n\nThe second (3+BF+3+H+3) is when your target has a lot of HP, and it is beneficial for you to activate BF early in the duel so that it can bring as much extra hp through healing as possible. This is simply an optimization of both damage and sustain, because if you use BF before the duel starts, you will either leave it behind or it may end too early.\n\nAnd here's another thing about combos. Should you always try to use them?\n\nNo. If you can do enough damage with bullets to be sure to finish off the enemy with Helix, and you need some time to aim your rockets, then just do it. And vice versa, as in regular Overwatch, there are often situations where it is better to launch Helix rockets right away and then start shooting (if the enemy does not know about you, and especially when they are far away but barely moving). You just need to remember that your abilities activate items.\n\n### Now about the new items for round 4\n\nBy default, you want to max AP, because +30% will give you +15 damage from MotK and up to +34.8 damage from Helix explosion. When you have so much damage, it can be beneficial to quickly kill the enemy or run away after a failed attempt, rather than drag out the fight and count on your own healing or additional HP.\n\nBut there are other options for different situations. Read the notes on the items.",
        "stats": {
            "LIFE": 305,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 305,
            "Attack Speed": 10,
            "Weapon Power": 0,
            "Ability Power": 50,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "1ad7f6eb-47c3-4fa5-8aa1-f77ecf54367c",
                "notes": "",
                "action": "buy",
                "upgrade_id": "808afc07-1398-4962-bf2c-f8e3b74014e3"
            },
            {
                "id": "f7c00bf1-863c-43de-b067-e497059e4778",
                "notes": "",
                "action": "buy",
                "upgrade_id": "b3750fe4-e416-42b6-ad9e-fe92c7dcffc5"
            },
            {
                "id": "66226b29-f068-4af4-9c7f-0881f5a01fa2",
                "notes": "Your ult becomes a strategic resource with which you can win the round. Because of this, you need to choose your positions carefully so that your teammates get overhealth. If you don't have a Mercy pocket, then you don't need to run like a headless chicken looking for a target and shoot 100% of the time, because without WP and AtkSpd your ult is quite weak by round 4. You can also save Helix to guarantee a kill with your combo during Ult.",
                "action": "optional",
                "upgrade_id": "1220eaec-f913-4de2-816c-0dc070b285d0"
            },
            {
                "id": "93ca664a-16a0-4994-a503-2be37e072ff6",
                "notes": "will give you: +17.1 bullet damage per combo, but the benefit is that you will deal more damage outside of the combo. When the enemy is not using armor, this is a good option. In round 4, you can start to switch to a hybrid build in which you will have both AP and WP, if it will be more logical or easier for you to shoot from afar than to play an assassin and a flanker in this game.",
                "action": "optional",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "9e96dbfd-1b45-4b36-a270-564757c6e5be",
                "notes": "will give you +8 HP/S healing from BF, as well as +10 damage for two MotK procs and up to 23.2 additional damage from Helix explosion, that is up to 33.2 damage to the target for a normal combo.",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "0d024bfd-13a3-4faf-abd1-ec9594e4d9ca",
                "notes": "",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "6461f478-7822-4a40-94e7-f533ce848b0c",
                "notes": "will give your combo: +5.7 bullet damage, +11.6 explosion damage, +5 for two MotK procs, total 22.3",
                "action": "optional",
                "upgrade_id": "17d633af-8bcc-4893-b865-be0a7bc66fe2"
            },
            {
                "id": "3d13f4e6-9a9a-4fc7-a1b7-29c75d594593",
                "notes": "will give you survivability, because Double Helix counts as using two abilities in a row, that is +50 overhealth.",
                "action": "optional",
                "upgrade_id": "2d085fa5-ace6-4fab-9323-b7a06268bcd0"
            },
            {
                "id": "5316ebac-fede-4c8a-8ad4-978c7d62e00d",
                "notes": "If you're in a bad money situation, then take Shady Spectacles (+10% ALs) and Power Playbook (+10 AP) with this item. You'll get a nice boost to damage and survivability, because a hit from Helix will instantly restore about 30 HP to you. But keep in mind that the bonus damage from MotK and TTT does not count as damage from abilities, but as damage from weapons.",
                "action": "optional",
                "upgrade_id": "f83a1d9e-91f8-4d2c-bd62-c673b8d9fd2e"
            },
            {
                "id": "87001c53-4980-4587-a79b-b6f9beefc633",
                "notes": "",
                "action": "buy",
                "upgrade_id": "09a53e39-25aa-4f66-ba51-bedbc543a1eb"
            },
            {
                "id": "2a17c5c0-c9a9-4a85-9d83-b3b20607d55f",
                "notes": "",
                "action": "buy",
                "upgrade_id": "39c5d2a4-1db0-444f-86d9-2a1e9a331429"
            }
        ]
    },
    {
        "id": "492b53e0-fdb0-4ff4-93e3-895d082852a3",
        "build_id": "0993cbfb-96c5-4477-ae60-2af50602eafd",
        "round_number": 5,
        "cash_earned": 0,
        "created_at": "2025-05-25T10:12:21.488+00:00",
        "notes": "Massive power spike! Since you take  [Cratered](item_5bb876bf-52b5-496c-a9ea-b68e72ed3be1) , you again benefit from maximizing your AP.\n\nBut first, look at what builds your opponents are using and how much HP they have. If you are sure that they will not start looking for countermeasures against your burst damage, or if you are constantly being prevented from doing your job, then you can add something for yourself to survive. Otherwise, I recommend continuing to maintain a damage advantage, because if you stop increasing it, it may turn out that the opponents have completely gone into HP, Armor and damage mitigation, and your combos no longer work at all. With your successful play you can provoke the enemy to maximize survivability in all ways.\n\nThe best item for survival is  [Lumerico Fusion Drive](item_3da81000-333c-460a-a1a2-09441bfda9c8) , and if there is not enough money, then  [Ironclad Exhaust Ports](item_2d085fa5-ace6-4fab-9323-b7a06268bcd0)\n\nAnd just like in the third round, you can pivot to another build, choosing  [On Me!](item_cd2a0247-bc79-4f0b-b9ee-d985e3f9a9a7) as your third power. This option is good when you understand that you will not be allowed to play Helix Assassin with impunity, or when the opponent has a matchup that is too difficult for you (heroes like Diva, Zarya, Genji, Mei, Moira, Mercy). Here's a build for such a case: https://stadiumbuilds.io/build/84b1eb58-870d-4902-9e66-5b4fa5925518",
        "stats": {
            "LIFE": 305,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 305,
            "Attack Speed": 10,
            "Weapon Power": 0,
            "Ability Power": 50,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "afcd952c-fcf9-41c9-a588-9ea48a4bb746",
                "notes": "",
                "action": "buy",
                "upgrade_id": "808afc07-1398-4962-bf2c-f8e3b74014e3"
            },
            {
                "id": "b413caad-de6a-427d-a01e-7506e4d4a248",
                "notes": "",
                "action": "buy",
                "upgrade_id": "b3750fe4-e416-42b6-ad9e-fe92c7dcffc5"
            },
            {
                "id": "538feb50-3555-4e3d-9f00-e99b567b6bc0",
                "notes": "",
                "action": "buy",
                "upgrade_id": "5bb876bf-52b5-496c-a9ea-b68e72ed3be1"
            },
            {
                "id": "80e63bd4-7ca4-48f0-9923-83e468ee6f06",
                "notes": "",
                "action": "optional",
                "upgrade_id": "22867dc9-50a1-4523-a77a-2fd67b487b51"
            },
            {
                "id": "7e817ecc-759a-477b-ad01-0fd334eaa228",
                "notes": "",
                "action": "optional",
                "upgrade_id": "1220eaec-f913-4de2-816c-0dc070b285d0"
            },
            {
                "id": "452d3769-8beb-4954-8bae-da3fc2fc7b42",
                "notes": "",
                "action": "optional",
                "upgrade_id": "3da81000-333c-460a-a1a2-09441bfda9c8"
            },
            {
                "id": "6bdfc339-3a36-4ff5-a69f-84ecdfd7338b",
                "notes": "",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "dd3bb07c-f38a-4a8b-af61-6b24c9951cf8",
                "notes": "",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "5870e885-acc2-46b6-9494-043455df9a3e",
                "notes": "",
                "action": "buy",
                "upgrade_id": "09a53e39-25aa-4f66-ba51-bedbc543a1eb"
            },
            {
                "id": "2d34b072-5b57-4f39-ac52-b43a7c5e5635",
                "notes": "",
                "action": "buy",
                "upgrade_id": "39c5d2a4-1db0-444f-86d9-2a1e9a331429"
            }
        ]
    },
    {
        "id": "bc0d6906-202e-4e35-89ea-d95d8ba4c9f0",
        "build_id": "0993cbfb-96c5-4477-ae60-2af50602eafd",
        "round_number": 6,
        "cash_earned": 0,
        "created_at": "2025-05-25T10:12:21.488+00:00",
        "notes": "Nothing changes in strategy. If you are allowed to successfully play Helix Assassin for so many rounds in a row, then either the opponent has such heroes that they cannot do anything to you, or you did not start with this build, but switched to it from a hybrid, and caught the opponents by surprise. In the second case, they will already be ready for you, take this into account and adapt: ​​maximizing AP is your default choice, but [Lumerico Fusion Drive](item_3da81000-333c-460a-a1a2-09441bfda9c8) is a safe choice in most cases.\n\nAlternative options are the same as before.\n\n### What you shouldn't buy:\n[Cybervenom](item_210a8582-91ec-4cf3-968a-a443f3a0c505)\nonly 2s of debuff after damage from Rockets is not enough, and if the target gets a lot of healing, it won't help you anyway. It's better to deal more damage at once by increasing AP.\n[Liquid Nitrogen](item_a8d99526-05a3-4405-babb-b025479b1b98)\nyou are not a support, and your rockets are needed to guarantee kills, not to put debuffs on tanks\n[Catalytic Crystal](item_3e3f4f77-cdf8-4dda-a5b0-2fb9390aefc4)\nyour ult is pretty weak, especially in the late game\n[Vanadium Injection](item_57953fbc-11ff-4e92-9928-fc59b7be668f)\nthis item will not work for half of the round, and even when it does, only AP and HP are important to you. In addition, even if your ult is weak, it makes sense to use it at the right moment or against Mercy, Juno or Lucio, because they are the hardest for you to kill.\n[Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b)\nyour targets have less than 30% HP only after the rockets explode, and therefore increasing the damage from your shots will not change much. This item is simply not worth the money in this build ruote until round 7, when you can change playstyle again.",
        "stats": {
            "LIFE": 325,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 375,
            "Attack Speed": 10,
            "Weapon Power": 0,
            "Ability Power": 65,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "73c8a4e9-6c38-4f82-b113-08368a65a31f",
                "notes": "",
                "action": "buy",
                "upgrade_id": "808afc07-1398-4962-bf2c-f8e3b74014e3"
            },
            {
                "id": "082e9d40-6614-460d-bbaa-e38f37227b3f",
                "notes": "",
                "action": "buy",
                "upgrade_id": "b3750fe4-e416-42b6-ad9e-fe92c7dcffc5"
            },
            {
                "id": "e1b4429b-33ab-4430-8312-d97e1930dbb2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "5bb876bf-52b5-496c-a9ea-b68e72ed3be1"
            },
            {
                "id": "6bf8768c-77be-49c8-9cbe-032edac658c2",
                "notes": "",
                "action": "optional",
                "upgrade_id": "22867dc9-50a1-4523-a77a-2fd67b487b51"
            },
            {
                "id": "0e2999dc-9374-4f5c-b77e-16db32a54fa6",
                "notes": "",
                "action": "buy",
                "upgrade_id": "3da81000-333c-460a-a1a2-09441bfda9c8"
            },
            {
                "id": "e6e96e47-dfa7-4b98-b7cf-677e95cd9d38",
                "notes": "",
                "action": "optional",
                "upgrade_id": "17d633af-8bcc-4893-b865-be0a7bc66fe2"
            },
            {
                "id": "b583b2f5-2b05-452f-b16b-4945a76f5114",
                "notes": "",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "63961d4f-11a9-495d-b7cd-0c408a408294",
                "notes": "",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "3f8b8b8c-81ed-4e49-bf37-80b9509edc92",
                "notes": "",
                "action": "buy",
                "upgrade_id": "09a53e39-25aa-4f66-ba51-bedbc543a1eb"
            },
            {
                "id": "f41745f4-ec1a-440e-be8c-0fb532a62bea",
                "notes": "",
                "action": "buy",
                "upgrade_id": "39c5d2a4-1db0-444f-86d9-2a1e9a331429"
            }
        ]
    },
    {
        "id": "c2ef7df1-c59b-4343-83d3-b44ba336fd83",
        "build_id": "0993cbfb-96c5-4477-ae60-2af50602eafd",
        "round_number": 7,
        "cash_earned": 0,
        "created_at": "2025-05-25T10:12:21.488+00:00",
        "notes": "### This is the real peak of power of this build. But not because you have a lot of stats.\n\nNow you can dramatically change the playstyle to anything by changing items, because you have all the necessary Powers. Strengthen what works well, or surprise your opponent, or adapt to the map, or try to help your teammates. In this round, it does not matter how many times you or your opponents die, because the money earned will no longer matter. It is not how many kills someone made, but when these deaths happened and what they led to. Stadium starts to work like regular Overwatch.\n\n### Here are some ultimate endgame builds for you:\n\nTwo main options\n\n1. **Helix Assassin**: costs 48750+; 90% AP or more, 50 Armor and 375+ HP (450+ under Biotic Field)  \n[Mark of the Kitsune](item_09a53e39-25aa-4f66-ba51-bedbc543a1eb)  [Three-tap Tommygun](item_39c5d2a4-1db0-444f-86d9-2a1e9a331429)  [Champion's Kit](item_8682f8c7-8811-439b-8d50-fa81cd43ddce)  [Lumerico Fusion Drive](item_3da81000-333c-460a-a1a2-09441bfda9c8) is the basis. Fill the remaining slots with situational items, trying to maximize AP. Think: what are you missing to kill targets as quickly as possible when it matters most? Sometimes it's not damage at all, but your sustain, which can allow you to choose the best moment to launch Helix or get more bullets in before you are forced to leave, or simply take a more advantageous but risky position.  [Iron Lung](item_22867dc9-50a1-4523-a77a-2fd67b487b51) can come in handy because it perfectly suits your hit-n-run style.\n\n2. **Better-76**: costs 43250+; 45%+ VP, 30% AP, 10% AtkSpd, 336+ HP (400+ when Biotic Field is activated)  \n[Mark of the Kitsune](item_09a53e39-25aa-4f66-ba51-bedbc543a1eb)  [Three-tap Tommygun](item_39c5d2a4-1db0-444f-86d9-2a1e9a331429)  [Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b)  [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a)  [Custom Stock](item_17d633af-8bcc-4893-b865-be0a7bc66fe2)\nIn this build, you are an improved version of Soldier from the regular Overwatch, which means that you are a jack of all trades: you can flank, you can help allies with healing and protection from flankers, you can simply put a lot of pressure on the tank. If the enemy has armor, then  [Codebreaker](item_caa96c7e-655f-4d03-9bd9-0f41937fec27) If you need to cut off the heal of the enemy tank - [El-sa'ka Supressor](item_b4298dd9-9b93-461f-a2e0-843402667100)  [Salvaged Slugs](item_019d6c60-36eb-42ec-8d6e-5bbb44a0db61) can be useful against Zarya and Rain. On some maps,  [Bomb Diffusal Boots](item_c555901e-1b69-4040-8420-ee81cbaf6d90) are ideal for mobility, escape and taking advantageous positions. But the simplest and most balanced option is [Superflexor](item_580b77b4-0d63-469b-99a8-5372c55dfc1b) \n\nI also have an interesting, but situational and very difficult to play build for you in case the builds above won't work for some reason: (in progress)\n\n\nNow you should understand why this is the only viable way to play Soldier 76. Adaptability and the ability to catch your opponent off guard is what will help you win in Stadium consistently, and not just when you have a Mercy pocket or when the enemy can't do anything to you.\n\nReward for those who read to the end: 7JRMA\nThis is the code for a custom stadium practice range with additional features (hold the interaction button to bring up the menu)",
        "stats": {
            "LIFE": 353,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 403,
            "Attack Speed": 10,
            "Weapon Power": 0,
            "Ability Power": 105,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "f020d49d-4878-4bfe-90b0-b33433fe7731",
                "notes": "",
                "action": "buy",
                "upgrade_id": "808afc07-1398-4962-bf2c-f8e3b74014e3"
            },
            {
                "id": "70f68da7-ef5f-4b4d-b38a-6e0e0b946f39",
                "notes": "",
                "action": "buy",
                "upgrade_id": "b3750fe4-e416-42b6-ad9e-fe92c7dcffc5"
            },
            {
                "id": "8867f2c5-2282-4491-8c63-f055d745ec05",
                "notes": "",
                "action": "buy",
                "upgrade_id": "5bb876bf-52b5-496c-a9ea-b68e72ed3be1"
            },
            {
                "id": "d096cbab-a8b7-4519-93ab-1274fdd46d3c",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cd2a0247-bc79-4f0b-b9ee-d985e3f9a9a7"
            },
            {
                "id": "3943da27-b9c0-4ca6-8524-39bb18bb8e9a",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b4298dd9-9b93-461f-a2e0-843402667100"
            },
            {
                "id": "79cc4602-61a5-41fb-8434-38e89ac4b0c8",
                "notes": "",
                "action": "optional",
                "upgrade_id": "019d6c60-36eb-42ec-8d6e-5bbb44a0db61"
            },
            {
                "id": "191fe774-5e39-49f6-9327-d4e3e0dcb1e3",
                "notes": "",
                "action": "optional",
                "upgrade_id": "a2143111-8fa0-4e3b-bbcf-12ed54587234"
            },
            {
                "id": "8d58af5e-14b1-4724-afae-75b4b7f7aaa7",
                "notes": "",
                "action": "optional",
                "upgrade_id": "c555901e-1b69-4040-8420-ee81cbaf6d90"
            },
            {
                "id": "e6ac5b49-e641-499d-830b-7d23929928b2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "8682f8c7-8811-439b-8d50-fa81cd43ddce"
            },
            {
                "id": "4515e61b-666b-4943-8c13-7618a00ad72b",
                "notes": "",
                "action": "buy",
                "upgrade_id": "3da81000-333c-460a-a1a2-09441bfda9c8"
            },
            {
                "id": "e61f7178-d4d4-49e6-bdd3-3516d733a3f4",
                "notes": "",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "8b760724-b922-4e91-b0cb-3601d0dc8ec2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "b80a2bd0-9270-4ccf-9acc-750bfaab9f2b",
                "notes": "",
                "action": "buy",
                "upgrade_id": "09a53e39-25aa-4f66-ba51-bedbc543a1eb"
            },
            {
                "id": "f8ae6a14-2dfb-40fb-b49e-bc407bbbdda6",
                "notes": "",
                "action": "buy",
                "upgrade_id": "39c5d2a4-1db0-444f-86d9-2a1e9a331429"
            }
        ]
    }
]