[
    {
        "id": "56577cef-fc4a-4e06-bc4a-d0c804eccb70",
        "build_id": "2209afaa-2c04-419b-a656-3607025512bd",
        "round_number": 1,
        "cash_earned": 0,
        "created_at": "2025-06-09T11:32:29.726337+00:00",
        "notes": "# Format for Power/Item Priority\n\n🔊 = Core (Must haves)\n\n🔉= Okay (Depends on preference)\n\n🔈= Situational (Mostly for counter building and/or specific maps)\n\n**tl;dr versions of item priorities will be in their individual notes. You can read them if you don't wanna see me ramble (as I do that a lot.)**\n\n# Powers\n\n## 🔊 =  [Crowd Pleaser](item_ae569e40-3194-4681-b1da-c664d0fa982c) \nThe bread and butter of this build. This gives you more survivability, more utility since you can heal while peeling for your teammates and heal yourself when diving a target, but most importantly, **it. gets. you. *MONEY*.** This will be the main money maker for the starting rounds.\n\n# Items\n\n# Buy\n\n## 🔊 =  [Power Playbook](item_6d8803cf-baa7-46ee-af91-51e7f2301418) \nThis build focuses on AP so you'll need as much AP as you can get. This will be the starting point.\n\n## 🔊 =  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) \nThis item is just to squeeze out any extra damage to help with getting elims. Plus, assists and elims gets you stadium cash and you want more cash. This also helps a little with poking the enemy and putting a little pressure on them.\n\n## 🔉 =  [Armored Vest](item_358361e2-59be-4c81-b221-8a87f37809e6) \nFor extra survivability. Armor reduces damage taken so you can live longer. If you're worried about their burst, you can use this.\n\n## 🔉 =  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) \nFor a tad bit extra dps, if survivability isn't something you're worrying about, you can use this instead.\n\n## 🔉 =  [First Aid Kit](item_0172eaaa-1902-44a3-b989-d12f0f7301da) \nFor extra survivability. Shields regen over time and goes alongside the global passive regen. It's inferior to armor since it doesn't reduce damage, but this item does reduce the time it takes for the passive regen to start which can be great for Lucio since it'll help him heal himself back up quicker. \n\n## 🔈 =  [Field Rations](item_46ae6709-1166-426f-bca3-97a538d3f089) \nThis can really only work if you're mostly going to stay on the point like on **control** or **clash**. This limits your movement to mostly being on the *objective*, so I don't recommend this one much unless you know you and your team will turtle on the point most of the round.\n\n# Overall Gameplay Notes\n\nFor round 1 and the early rounds in general, you want to generate as much stadium cash as possible. Stick by your team, use boop off cool-down to heal them, amp up the heals to build up assists. Don't try to be too aggressive for kills...*yet*, that'll be for later.\n\nA lot of times, the heals and the assists will help in getting you MVP for the sweet bonus cash ~~(unless someone on your team gets a pop off moment.)~~ You really just want to be a bit of a healbot and only take opportunities to be aggressive when you KNOW you can secure the kill.\n\nBuild up that money, your time to destroy the enemy using your boops will be soon...",
        "stats": {
            "LIFE": 250,
            "Armor": 25,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 282,
            "Attack Speed": 0,
            "Weapon Power": 5,
            "Ability Power": 10,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "266dde8e-050b-4770-a7d3-039f4a12d374",
                "notes": "Must have, you want as much AP as possible.",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "824e7289-8e87-45a5-aca8-51d90d85c08c",
                "notes": "Used to squeeze in extra damage.",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "76449506-6dd7-4afe-b0bd-dff17c03b3a1",
                "notes": "Extra survivability if needed.",
                "action": "buy",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "fc699010-d776-4853-9030-3c36a50987d7",
                "notes": "You can replace armored vest if wanting more damage.",
                "action": "optional",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "9d6fb91c-7cc4-4b9f-b3ff-aaba5aa29f7c",
                "notes": "Core, gives more utility and is the money maker.",
                "action": "buy",
                "upgrade_id": "ae569e40-3194-4681-b1da-c664d0fa982c"
            },
            {
                "id": "ffc99014-0971-4d38-b36d-259c0784fcb4",
                "notes": "Only for control/clash, very situational.",
                "action": "optional",
                "upgrade_id": "46ae6709-1166-426f-bca3-97a538d3f089"
            },
            {
                "id": "224e5189-0ec1-485f-9915-802bb6b20d20",
                "notes": "Shields is great but armor is better. Mostly for faster regen.",
                "action": "optional",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            }
        ]
    },
    {
        "id": "e91dbe7e-e791-46b9-9863-38b93a363172",
        "build_id": "2209afaa-2c04-419b-a656-3607025512bd",
        "round_number": 2,
        "cash_earned": 0,
        "created_at": "2025-06-09T11:32:29.726337+00:00",
        "notes": "# Average Round Cash: 11k - 16k\n\nOf course, this is dependent on how much you healed, helped with elims, and if you earned MVP or not. For each round, I'll be assuming certain averages based on my games, but also give options if you earned more or less than that range. For this instance, I'll be assuming about *13k*. The optional items are ones to pick up if you have extra cash or less cash, with their individual notes mentioning how much cash you'll need as well as why you'll get them.\n\n# Items\n\n# Buy\n\n## 🔊 =  [Nano Cola](item_79b22609-8046-4a8a-a5a2-bb49cd7e11c6)\nThis is for even more AP, put simply. Again, you need as much power on your boop as possible. Straight 20% flat AP is great to continue stacking it up.\n\n## 🔊 =  [Multi-Tool](item_5ba8d94e-f2f3-44b7-8773-025fc6ed7c56)\nEven more AP, see the pattern I'm getting at here? Although for this item specifically, not only does it give you more AP but it also lessens the cooldown of your boop very slightly. So you can boop more frequently to get more healing done and get more cash.\n\n# Sell\n\n##  [Armored Vest](item_358361e2-59be-4c81-b221-8a87f37809e6)\nOut of all of the items, you can most comfortably sell armored vest if needed in order to get other items. Although if you feel like you're taking too much damage, you can keep it. Although you would have to sell  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) in order to have that extra armor.\n\n# Overall Gameplay Notes\n\nYour game plan will be the same as the last round, build up that cash and keep your team up. Thanks to the steadily increasing AP, you can afford to try to be a bit more aggressive against enemies that are out of position. You’ll be doing good damage with your boop here, just be careful not to overdo it, you’re not THAT strong yet. But try targeting weak squishies you know you have a chance at beating/forcing key cooldowns out of, like [Soldier: 76](hero_e1ac7ef5-4648-4998-b8b0-9e3da3e60546) and his healing field,  [Kiriko](hero_70a0ac5c-2a55-4fab-beeb-2f570886426f) with her suzu/teleport,  [Ana](hero_f1aee6cf-704f-455f-a100-ec882ebbe000) with her sleep/nade, etc. \n\nAlso if you’re going against  [Junker Queen](hero_4794d288-27d9-49e0-a1dd-ffe0f4de3ab1), be very careful if she equipped [Dez’s Damage Dampeners](item_d55fc98b-d014-4383-903c-a7aa1fb7c619)! This will completely make her a super low priority target, as booping her will not only be less effective but also buff her as well. So avoid her at all cost if possible. You do *NOT* want a very speedy queen rush you or your team.",
        "stats": {
            "LIFE": 275,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 275,
            "Attack Speed": 0,
            "Weapon Power": 5,
            "Ability Power": 40,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 5
        },
        "round_upgrades": [
            {
                "id": "b9e8e6ce-ada6-4d8c-b8cc-e9f794e1ddbd",
                "notes": "Core, gives more utility and is the money maker.",
                "action": "buy",
                "upgrade_id": "ae569e40-3194-4681-b1da-c664d0fa982c"
            },
            {
                "id": "8446ea95-1f31-43e7-81f0-b977a13e3380",
                "notes": "Sell if you don't need extra survivability. If needed, replace compensator.",
                "action": "sell",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "52e28835-26e7-4155-82fd-be89df44c1fd",
                "notes": "If you have enough money (15250) get this and sell compensator. You'll keep the amount of WP compensator would give you but also get even more AP, the main stat you want.\n\nAlternatively, you can use this as a substitute to multi-tool if you don't have the cash for it after getting Nano Cola.",
                "action": "optional",
                "upgrade_id": "17d633af-8bcc-4893-b865-be0a7bc66fe2"
            },
            {
                "id": "2764cf74-b071-4378-b60a-106c55508165",
                "notes": "If 13.5k, this can round it out. Thanks to crowd pleaser, you'll be getting beat faster. The condition for ult will be fulfilled much more easily.\n\nDon't worry if you don't have enough for this, this item is just a cherry on top.",
                "action": "optional",
                "upgrade_id": "b8ca58e7-6ae2-40ee-8618-fe2f32315295"
            },
            {
                "id": "a2a707a9-27e3-4f5c-898d-7a8bacff2429",
                "notes": "Core, you need that AP.",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "389ffb90-3062-4e59-9e3c-5f48365a8e0c",
                "notes": "More AP more boops!",
                "action": "buy",
                "upgrade_id": "5ba8d94e-f2f3-44b7-8773-025fc6ed7c56"
            },
            {
                "id": "40fb0ff9-6499-4747-bf2b-c9ae8d4cbb12",
                "notes": "Keep, you need that AP.",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "aa241be6-4f0a-45e8-8032-e741aaea13da",
                "notes": "Keep, free extra damage. If not enough money for the two rares, sell.",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            }
        ]
    },
    {
        "id": "8ff130f7-b386-49f8-9dea-57fdccf18127",
        "build_id": "2209afaa-2c04-419b-a656-3607025512bd",
        "round_number": 3,
        "cash_earned": 0,
        "created_at": "2025-06-09T11:32:29.726337+00:00",
        "notes": "# Average Round Cash: 17k - 24k\n\nI’ll be assuming ***21.5k***\n\n# Powers\n\n## 🔊 =  [Reverb](item_c973a6d8-47ee-4846-adb4-78f40c1b6a9f)\n\nHow can this be a boop build without the power that gives you ***TWO*** boops? This has amazing synergy with crowd pleaser, allowing you to heal your team (and yourself) more to survive against damage. This also gives you more damage as you can boop twice with the increased AP. This all translates to more survivability, more *cash,* and more dps.\n\n## 🔊 =  [Let’s Bounce](item_2d846a6e-ff59-4ccc-ae90-c78fad3b4d9b)\n\nNow this is only if you want the real fun to begin early. I personally prefer having two boops but thanks to the amount of AP you'll have, you'll be able to burst unsuspecting enemies down.\n\n# Items\n\n# Buy\n\n## 🔊 =  [Lumerico Fusion Drive](item_3da81000-333c-460a-a1a2-09441bfda9c8)\n\nAn excellent item that gives you armor, and restores armor each time you use an ability and gives *15%* AP. This can save you in some duels and give you a way to tank some damage better, since your boops help restore your armor.\n\n## 🔊 =  [Catalytic Crystal](item_3e3f4f77-cdf8-4dda-a5b0-2fb9390aefc4)\n\nYou'll be doing a lot of AP damage with boop, plus, good healing with it too. If you feel like your team needs better defense, then this can definitely help get you beat faster.\n\n## 🔉 =  [Biotech Maximizer](item_01c6dcb3-d2e2-4c57-bd21-61d7b8f939c4)\n\nThis lessens the cooldown of your boop each time you heal your team with it. This can also help if you're assisting a teammate on an angle or flank. Healing them while also damaging the enemy or in a brawly team fight where you're booping for your team and to hit the enemy. I honestly use this the least compared to the other two, as it gives you 10% AP rather than 15% and the effects of the other two is a tad bit better.\n\n## 🔈 =  [Nano Boop](item_892a8289-905b-4a99-8bf9-f8e823741853)\n\nIs this item completely useless on some maps? Yes. Even on some of the maps it'll be good on, will it be consistent? No. If you do get the boop off the map, will it be extremely funny? Definitely. This item will only be useful on maps like Throne of Anubis, Redwood Dam, Hanaoka, and Arena Victoriae. Pretty much maps where you're more likely to get the boop kills. If you want good laughs on those maps, this item could be worth picking up. (You may be sacrificing  [Multi-Tool](item_5ba8d94e-f2f3-44b7-8773-025fc6ed7c56) or one of your epic items.) Also saying \"Boop of the day\" apparently helps in getting those environmental kills.\n\n# Sell\n\n##  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0)\n\nNo real need to keep this item, WP doesn't mean too much here. Besides, there's a better item that gives you WP while also amplifying AP...try to guess what item I'm hinting at!\n\n# Overall Gameplay Notes\n\nThis is where the fun begins. You got the heals, you got the consistent boop damage, you got max disruption. The amount of damage you'll deal with boop at this point can be a bit unbelievable to some foes which allows for some sneaky flanks to burst them down.\n\nIf they have any supports that you can dive on, find opportunities to do so. At worst, you'll force out their abilities and run away. At best, that's another elim on the stat card. You can afford to be a little more aggressive now since you have two boops (or an even powerful boop with  [Let’s Bounce](item_2d846a6e-ff59-4ccc-ae90-c78fad3b4d9b)) which can give you more survivability and allows you to deal more damage. Though you still can always come back to the team and clutch with boop heals too.\n\nUltimately, this leads you down multiple playstyles. Aggressive duelist, supportive healer, or balanced between the two.",
        "stats": {
            "LIFE": 293,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 343,
            "Attack Speed": 0,
            "Weapon Power": 0,
            "Ability Power": 55,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 5
        },
        "round_upgrades": [
            {
                "id": "ee8a9346-364a-4a4b-883a-35671e9b9381",
                "notes": "Core, gives more utility and is the money maker.",
                "action": "buy",
                "upgrade_id": "ae569e40-3194-4681-b1da-c664d0fa982c"
            },
            {
                "id": "a4341946-e351-4581-9ca4-9e3cdf486e7a",
                "notes": "Even more boops, what else is there to say? Core.",
                "action": "buy",
                "upgrade_id": "c973a6d8-47ee-4846-adb4-78f40c1b6a9f"
            },
            {
                "id": "d1b34d4b-decd-43ac-b878-0fd44349ba02",
                "notes": "More AP, more armor, more power, more survivability.",
                "action": "buy",
                "upgrade_id": "3da81000-333c-460a-a1a2-09441bfda9c8"
            },
            {
                "id": "2ae68c1a-1201-4541-8609-cda78964ce9c",
                "notes": "Boop can heal so now you'll get more boops. Can replace fusion drive.",
                "action": "optional",
                "upgrade_id": "01c6dcb3-d2e2-4c57-bd21-61d7b8f939c4"
            },
            {
                "id": "77a9a566-d67a-4443-8dc5-e3642fcdf19e",
                "notes": "A bit more defensive, allowing more beats. Can replace fusion drive.",
                "action": "optional",
                "upgrade_id": "3e3f4f77-cdf8-4dda-a5b0-2fb9390aefc4"
            },
            {
                "id": "0c3acb79-6ed3-4abc-910a-ae4174324192",
                "notes": "",
                "action": "sell",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "4a314d97-09c7-4d4e-82ac-b3a29b7dae0e",
                "notes": "Very situational, but also very funny.",
                "action": "optional",
                "upgrade_id": "892a8289-905b-4a99-8bf9-f8e823741853"
            },
            {
                "id": "e8c7c77e-b9be-413b-91bc-65b50bcb52a2",
                "notes": "Gives more AP as a budget option if you don't have enough cash. Can fill one of the two possible rare slots you have.",
                "action": "optional",
                "upgrade_id": "f83a1d9e-91f8-4d2c-bd62-c673b8d9fd2e"
            },
            {
                "id": "7525e515-6d94-4f12-a22e-f143bc00565d",
                "notes": "More so if you don't have the cash for an epic. You can fill two rare slots, this can be one of the items.",
                "action": "optional",
                "upgrade_id": "17d633af-8bcc-4893-b865-be0a7bc66fe2"
            },
            {
                "id": "12d8f2d3-da7c-4741-ac1f-c71a7d655083",
                "notes": "",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "d974d5e6-1794-4158-8342-135124dabea2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "5ba8d94e-f2f3-44b7-8773-025fc6ed7c56"
            },
            {
                "id": "5cab2005-ef9a-4762-b81e-0015b73b7b35",
                "notes": "",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            }
        ]
    },
    {
        "id": "d29cb3f2-d16f-4172-a985-733f8cf4c66f",
        "build_id": "2209afaa-2c04-419b-a656-3607025512bd",
        "round_number": 4,
        "cash_earned": 0,
        "created_at": "2025-06-09T11:32:29.726337+00:00",
        "notes": "# Average Round Cash: 28k - 36k\n\nI'll be assuming ***31.5k***\n\n# Items\n\n# Buy\n\n## 🔊 = [Superflexor](item_580b77b4-0d63-469b-99a8-5372c55dfc1b)\nThis is where the fun REALLY begins. This amplifies your boop power immensely, up to 80% after hitting one full burst of your primary and a single shot. Which means you can poke the tank over and over to keep your stacks up then find a target you can jump on and annihilate them with your two boops, OR heal up your team nicely with amp heals and boop heals. Also in duels this can help too as after one boop, you can aim your shots where you boop them to get some precise shots then BOOP, even more power and they're gone. WP doesn't really strengthen this build much, but it does help a little when you're trying to burst down a squishy.\n\n## 🔉 =  [Catalytic Crystal](item_3e3f4f77-cdf8-4dda-a5b0-2fb9390aefc4) \nThis item returns as a more defensive option! Yes, I mostly explained its use last round but I'll explain it slightly again. It's just to get more beats faster. If your team is struggling to stay alive and you see yourself healing your team more often than going to pick off targets, then this is a good choice over Superflexor.\n\n## 🔈 =  [Cybervenom](item_210a8582-91ec-4cf3-968a-a443f3a0c505) \nThis item is mainly when you go against comps that use a lot of healing. Since you have two high powered boops, you'll nuke them and also lower the amount of healing they do. I really only use this as a counter option.\n\n## 🔈 =  [Energized Bracers](item_f83a1d9e-91f8-4d2c-bd62-c673b8d9fd2e)/[Custom Stock](item_17d633af-8bcc-4893-b865-be0a7bc66fe2)\nFiller options if you cannot get a second epic. For Custom Stock specifically, you can use it to alternatively replace [Multi-Tool](item_5ba8d94e-f2f3-44b7-8773-025fc6ed7c56) to have 15% weapon power if you use it with Superflexor.\n\n# Sell\n\n##  [Power Playbook](item_6d8803cf-baa7-46ee-af91-51e7f2301418)\nYou'll have enough money to where you might not have to run this anymore and potentially replace it with a rare like [Custom Stock](item_17d633af-8bcc-4893-b865-be0a7bc66fe2) or [Energized Bracers](item_f83a1d9e-91f8-4d2c-bd62-c673b8d9fd2e). That or selling it to afford the second epic if needed. Though if you won't have enough money for either option, or if you have enough money for the second epic and maybe have a tiny bit extra left...you can still keep it, like I have in this example.\n\n# Overall Gameplay Notes\n\nThis round definitely allows you to be a lot more aggressive and put down extreme amounts of pressure onto the enemy backline and take more duels, even against dps heroes by building up a lot of AP with your shots then finishing them off with your boops. Of course, if you're a lot more passive, this still gives you more healing power to your team via spamming shots, amplifying AP with [Superflexor](item_580b77b4-0d63-469b-99a8-5372c55dfc1b), then booping to give a lot more heals.\n\nFocus on getting max stacks for Superflexor, this will push your boops to their full potential!",
        "stats": {
            "LIFE": 338,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 388,
            "Attack Speed": 0,
            "Weapon Power": 10,
            "Ability Power": 55,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 5
        },
        "round_upgrades": [
            {
                "id": "b0eb333d-968e-4ccc-842f-f7988df63d18",
                "notes": "Core, gives more utility and is the money maker.",
                "action": "buy",
                "upgrade_id": "ae569e40-3194-4681-b1da-c664d0fa982c"
            },
            {
                "id": "1b8f5420-1c0d-468c-9f61-03f5f087d7c6",
                "notes": "Even more boops, what else is there to say? Core.",
                "action": "buy",
                "upgrade_id": "c973a6d8-47ee-4846-adb4-78f40c1b6a9f"
            },
            {
                "id": "35fa0aa1-e021-464e-8eda-9b8974b8d0f5",
                "notes": "Spam damage into massive boop damage.",
                "action": "buy",
                "upgrade_id": "580b77b4-0d63-469b-99a8-5372c55dfc1b"
            },
            {
                "id": "764d252e-caa8-4771-936c-5834b01fe64f",
                "notes": "Can be used as an option instead of superflexor if the enemy has a bunch of healing.",
                "action": "optional",
                "upgrade_id": "210a8582-91ec-4cf3-968a-a443f3a0c505"
            },
            {
                "id": "44c0a75f-f693-4988-aa6f-e42edc4e91a8",
                "notes": "If not enough cash for a second epic, fill in with rares. This is an option.",
                "action": "optional",
                "upgrade_id": "17d633af-8bcc-4893-b865-be0a7bc66fe2"
            },
            {
                "id": "c8f103ec-d74f-44ca-8c32-99699fc3307c",
                "notes": "If not enough cash for a second epic, fill in with rares. This is an option.",
                "action": "optional",
                "upgrade_id": "f83a1d9e-91f8-4d2c-bd62-c673b8d9fd2e"
            },
            {
                "id": "0fef373d-22b9-45b0-a852-c3958099c06e",
                "notes": "If you want more beats rather than more boop damage.",
                "action": "optional",
                "upgrade_id": "3e3f4f77-cdf8-4dda-a5b0-2fb9390aefc4"
            },
            {
                "id": "18668fa9-4589-4b01-a2d5-8263cc568f58",
                "notes": "",
                "action": "buy",
                "upgrade_id": "3da81000-333c-460a-a1a2-09441bfda9c8"
            },
            {
                "id": "87c8fe13-8be7-41f6-8801-38847dd5b68f",
                "notes": "",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "052b2fac-55ca-425c-aa1d-5c4c7e4ba98d",
                "notes": "You could swap this out with custom stock to keep the AP and also be at 15% WP.",
                "action": "buy",
                "upgrade_id": "5ba8d94e-f2f3-44b7-8773-025fc6ed7c56"
            },
            {
                "id": "3e031955-6c43-47f0-b748-dafee2013efd",
                "notes": "Keep, but if needed, sell for the second epic or to replace it with the cheaper rare options.",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            }
        ]
    },
    {
        "id": "4b67abde-6039-428b-8ef8-62d297d65be2",
        "build_id": "2209afaa-2c04-419b-a656-3607025512bd",
        "round_number": 5,
        "cash_earned": 0,
        "created_at": "2025-06-09T11:32:29.726337+00:00",
        "notes": "",
        "stats": {
            "LIFE": 366,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 416,
            "Attack Speed": 0,
            "Weapon Power": 10,
            "Ability Power": 90,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 5
        },
        "round_upgrades": [
            {
                "id": "9004c09a-6f93-4365-b7e3-d3155c5f21d0",
                "notes": "Core, gives more utility and is the money maker.",
                "action": "buy",
                "upgrade_id": "ae569e40-3194-4681-b1da-c664d0fa982c"
            },
            {
                "id": "9c6f0606-6c24-4028-bdae-7626e175fe25",
                "notes": "Even more boops, what else is there to say? Core.",
                "action": "buy",
                "upgrade_id": "c973a6d8-47ee-4846-adb4-78f40c1b6a9f"
            },
            {
                "id": "c0cd0673-8f1b-4e47-8f1e-4979bda44bc3",
                "notes": "You were gonna get this sooner or later. More damage? Definitely core.",
                "action": "buy",
                "upgrade_id": "2d846a6e-ff59-4ccc-ae90-c78fad3b4d9b"
            },
            {
                "id": "c20ee443-7481-4f8a-84d0-60a4e3f890bb",
                "notes": "35% AP? Yes please!",
                "action": "buy",
                "upgrade_id": "8682f8c7-8811-439b-8d50-fa81cd43ddce"
            },
            {
                "id": "6b8b4d10-1c3f-4c50-96ae-0fce9593464c",
                "notes": "",
                "action": "buy",
                "upgrade_id": "580b77b4-0d63-469b-99a8-5372c55dfc1b"
            },
            {
                "id": "19b9dc51-4148-4de3-a248-db9a125392dc",
                "notes": "",
                "action": "buy",
                "upgrade_id": "3da81000-333c-460a-a1a2-09441bfda9c8"
            },
            {
                "id": "9c841463-da9e-466f-a834-95c47b17b115",
                "notes": "",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "ed27de4f-fb32-4e6f-a560-821f2609cf6e",
                "notes": "",
                "action": "buy",
                "upgrade_id": "5ba8d94e-f2f3-44b7-8773-025fc6ed7c56"
            },
            {
                "id": "4c0f6afa-8d0f-4bc5-ab87-b541ef4c52ed",
                "notes": "",
                "action": "buy",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "1589bc52-ee78-4eb0-b6da-57574af21d4f",
                "notes": "Easier to hit shots and to chase after boops.",
                "action": "optional",
                "upgrade_id": "a8d99526-05a3-4405-babb-b025479b1b98"
            },
            {
                "id": "0f530af3-8610-49c1-ac80-2b7807f6ea0b",
                "notes": "",
                "action": "optional",
                "upgrade_id": "210a8582-91ec-4cf3-968a-a443f3a0c505"
            },
            {
                "id": "61b82241-9966-4725-8e1a-44806a325725",
                "notes": "",
                "action": "optional",
                "upgrade_id": "3e3f4f77-cdf8-4dda-a5b0-2fb9390aefc4"
            }
        ]
    },
    {
        "id": "709b0ef8-8fc5-4e3b-b0f9-090c6b235209",
        "build_id": "2209afaa-2c04-419b-a656-3607025512bd",
        "round_number": 6,
        "cash_earned": 0,
        "created_at": "2025-06-09T11:32:29.726337+00:00",
        "notes": "",
        "stats": {
            "LIFE": 364,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 414,
            "Attack Speed": 0,
            "Weapon Power": 10,
            "Ability Power": 80,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 5
        },
        "round_upgrades": [
            {
                "id": "3945d57b-8ad7-4f70-8ba4-4c8c40d53c9b",
                "notes": "Core, gives more utility and is the money maker.",
                "action": "buy",
                "upgrade_id": "ae569e40-3194-4681-b1da-c664d0fa982c"
            },
            {
                "id": "ebbd37b8-0d98-4bd9-bb6b-c1a8a36dd6e6",
                "notes": "Even more boops, what else is there to say? Core.",
                "action": "buy",
                "upgrade_id": "c973a6d8-47ee-4846-adb4-78f40c1b6a9f"
            },
            {
                "id": "5f5bdf3d-0f85-4b9f-a857-de6f7257e722",
                "notes": "You were gonna get this sooner or later. More damage? Definitely core.",
                "action": "buy",
                "upgrade_id": "2d846a6e-ff59-4ccc-ae90-c78fad3b4d9b"
            },
            {
                "id": "1c8b9c07-ca17-429b-a8c3-c6e1c3880896",
                "notes": "",
                "action": "optional",
                "upgrade_id": "6d8803cf-baa7-46ee-af91-51e7f2301418"
            },
            {
                "id": "0843e086-4bf2-4348-91f8-c49c0c401ddc",
                "notes": "",
                "action": "buy",
                "upgrade_id": "8682f8c7-8811-439b-8d50-fa81cd43ddce"
            },
            {
                "id": "6a1dadf4-eff0-425a-a9be-2d0ce9ff943a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "580b77b4-0d63-469b-99a8-5372c55dfc1b"
            },
            {
                "id": "4bf9d853-23d1-47a3-b057-bf16bc8525e3",
                "notes": "",
                "action": "buy",
                "upgrade_id": "3da81000-333c-460a-a1a2-09441bfda9c8"
            },
            {
                "id": "c7f7655c-b40f-44c6-8c6d-7eee86f83daa",
                "notes": "",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            },
            {
                "id": "fe7c5b1a-2fdd-4ef9-9104-35d7b7c67a8b",
                "notes": "",
                "action": "buy",
                "upgrade_id": "5ba8d94e-f2f3-44b7-8773-025fc6ed7c56"
            }
        ]
    },
    {
        "id": "2b9fddbc-4fb8-4ebd-8694-ec29d72bebac",
        "build_id": "2209afaa-2c04-419b-a656-3607025512bd",
        "round_number": 7,
        "cash_earned": 0,
        "created_at": "2025-06-09T11:32:29.726337+00:00",
        "notes": "",
        "stats": {
            "LIFE": 355,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 405,
            "Attack Speed": 0,
            "Weapon Power": 10,
            "Ability Power": 70,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "0d1498e6-bd30-4ab5-812b-6416cca24a1d",
                "notes": "Core, gives more utility and is the money maker.",
                "action": "buy",
                "upgrade_id": "ae569e40-3194-4681-b1da-c664d0fa982c"
            },
            {
                "id": "809f0619-818c-4ae5-a750-9866bb5adac6",
                "notes": "Even more boops, what else is there to say? Core.",
                "action": "buy",
                "upgrade_id": "c973a6d8-47ee-4846-adb4-78f40c1b6a9f"
            },
            {
                "id": "e8f7403f-f30b-4498-b54a-99a14343e820",
                "notes": "You were gonna get this sooner or later. More damage? Definitely core.",
                "action": "buy",
                "upgrade_id": "2d846a6e-ff59-4ccc-ae90-c78fad3b4d9b"
            },
            {
                "id": "968d30f2-0bc4-4236-9393-4e6ac9ba7d88",
                "notes": "More boops, more power.",
                "action": "buy",
                "upgrade_id": "bde9f357-b950-4bde-94d1-3d2e472278a9"
            },
            {
                "id": "a31da040-908e-4eb2-8231-1c0b44bec488",
                "notes": "If you need more beats, defensive variant that sacrifices boops. (I know, goes against the purpose.)",
                "action": "optional",
                "upgrade_id": "d3d5876b-bd40-4bd9-9954-c65e2295cc2d"
            },
            {
                "id": "64d5f7d6-8d15-493c-8049-2d2831c2f236",
                "notes": "",
                "action": "optional",
                "upgrade_id": "01c6dcb3-d2e2-4c57-bd21-61d7b8f939c4"
            },
            {
                "id": "a74568ed-3877-414f-94e8-e1895dabeffd",
                "notes": "",
                "action": "optional",
                "upgrade_id": "5ba8d94e-f2f3-44b7-8773-025fc6ed7c56"
            },
            {
                "id": "43b6dad0-9eab-4f15-82c6-c3c04c22d715",
                "notes": "",
                "action": "buy",
                "upgrade_id": "8682f8c7-8811-439b-8d50-fa81cd43ddce"
            },
            {
                "id": "3847fc37-51fb-4c17-8be9-d3ebba61e6df",
                "notes": "",
                "action": "buy",
                "upgrade_id": "580b77b4-0d63-469b-99a8-5372c55dfc1b"
            },
            {
                "id": "b90ffefc-26a2-465e-9ce1-8707c0618e74",
                "notes": "",
                "action": "buy",
                "upgrade_id": "3da81000-333c-460a-a1a2-09441bfda9c8"
            },
            {
                "id": "985e7d5d-df20-4813-881e-9ecf14f6ad7c",
                "notes": "",
                "action": "buy",
                "upgrade_id": "79b22609-8046-4a8a-a5a2-bb49cd7e11c6"
            }
        ]
    }
]