[
    {
        "id": "85aa4ebf-a809-46ab-a147-52f71b4e6fb0",
        "build_id": "59bbc876-3ec2-4307-9b3a-0a790e52c89a",
        "round_number": 1,
        "cash_earned": 0,
        "created_at": "2025-06-25T08:59:18.445343+00:00",
        "notes": "### 💰 Starting Item Info:\n\nStarting items are pretty standard. You can swap [First Aid Kit](item_0172eaaa-1902-44a3-b989-d12f0f7301da)  for  [Armored Vest](item_358361e2-59be-4c81-b221-8a87f37809e6)  if needed.  [Armored Vest](item_358361e2-59be-4c81-b221-8a87f37809e6)  is the superior option when you think you might be bursted down before you can safely reposition.  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0)  and  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf)  together increase your HPS by about 6 which is quite a lot early. I often see Mercy’s ignore these items in the first round and build only defensive items, which I would not recommend. Damage has not ramped up at this point and unless your team is being rolled, (which you wouldn’t even know until after the fact) you should be able to live without them. \n\n---\n\n### 🗒️ Round Notes: \n\nThis round will be played fairly normally. Prioritize damage boost when you can, but do keep in mind that damage overall will be higher than normal Overwatch. You will need to be healing more often especially if your other support lacks healing or is just focusing on damage. Make it a habit to flick your beam to another ally at least every three seconds to always keep  [Threads of Fate](item_cb61612b-9d83-49a9-989d-013bf084fbcb) active.\n\n---\n\n### 🗨️ General Information: \n\nMercy’s healing is affected by both weapon power and attack speed. Weapon power directly increases the amount she heals and attack speed increases the rate at which Mercy heals. To optimize Mercy’s HPS, you will want both weapon power and attack speed. This becomes less important later as there is a massive lack of epic attack speed items that work well with Mercy’s kit. If your goal is simply to increase your healing, always prioritize rare items first, then add in epic items when you have the funds to start replacing them. I do not know how much cash you will make each round, so you will need to calculate what combination of items will increase your healing the most. \n\n---\n\n### 💡 Tips & Advice:\n\n* **Always spend your cash.** You can sell for full price so please just spend all your cash every round.\n\n* **Know your maps.** Don't waste valk on clash maps when the point doesn't even open for another 10+ seconds. Don't waste valk or go for a risky rez to attempt to save a fight when you have the lead on push maps. Timing your ults and knowing when to start taking risks is very important and depends on your knowledge of map types and ability to pay attention. \n\n* **Don't hold valk.** This is not like normal overwatch, valk should not be saved only to keep yourself alive. Learn to valk aggressively and push damage boost to win fights or defensively even to heal your whole team. You will have valk almost every fight with how fast it builds with healing items, abuse this and valk often. \n\n* **Stay Alive.** This concept should not be new to you if you've played Mercy a long time. Mercy's value comes from staying alive. If you are dead, you are simply not useful at all to your team. Since you will not die often, you will often accumulate a decent sized bounty, don't abandon winnable fights to greed your bounty, but it is something to keep in mind. On top of this, always prioritize defensive items if you think you will need them. It is rarely worth it to be greedy because it can very easily lead to you dying a lot or being unable to aggress with your team when needed, ultimately resulting in very little cash gained. \n \n* **Be self sufficient.** If you want to consistently win games, you need to learn how to rely on your teammates less. The matchmaking in Overwatch in general is not great, but it's especially bad in Stadium. You will often find yourself with teammates who are just so lost and confused and you will need to play and build in a way that makes you depend on them as little as possible. That means not relying on peeling and healing from your other support. Of course it's ideal if your team does acknowledge your existence, but if you are reading this you probably know that doesn't happen often. \n\n* **Hit Tab.** I cannot emphasize this enough. Make it a habit to be checking your teammates and the enemy teams builds every round. This is just a good habit to develop and becomes even more so important when properly itemizing.",
        "stats": {
            "LIFE": 225,
            "Armor": 0,
            "Shield": 25,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 257,
            "Attack Speed": 5,
            "Weapon Power": 5,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "e9e3de87-1380-4b3b-a091-996e4e4eae1d",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "3cc6c3bf-5140-428a-a52e-2e92e38329a8",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "2ae1da67-2068-4f6a-b91d-460f688fa3be",
                "notes": "",
                "action": "buy",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "b08aacf8-572c-4baf-ba32-28d0d08031d3",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "e3491402-90de-497d-980c-22559bdb4fee",
                "notes": "Buy Armored Vest over First Aid Kit when the enemy team has a high burst team so you will have enough time to safely reposition.",
                "action": "optional",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            }
        ]
    },
    {
        "id": "c47c075e-c95a-43d3-8ce0-6d47dede87f4",
        "build_id": "59bbc876-3ec2-4307-9b3a-0a790e52c89a",
        "round_number": 2,
        "cash_earned": 0,
        "created_at": "2025-06-25T08:59:18.445343+00:00",
        "notes": "### 💰 Item Info:\n\nThis is the ideal round 2 buy, however in the majority of games you will not earn enough cash to afford this and/or you will also need to buy defensive items.  [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e)  is the most important item here and is the only item you will buy this round 100% of the time.  [Mid-Air Mobilizer](item_760c1441-8cfa-426c-885d-8d0dec32e145)  can be dropped for more survivability. I would suggest in most scenarios prioritizing  [Vital-E-Tee](item_b92e6f1d-3aac-4eec-b027-00c8e1529016)  over  [Angeleisure Wear](item_00b53ed7-0768-442b-a2c3-8d19608c9391)  if it is your only defensive item.  [Mid-Air Mobilizer](item_760c1441-8cfa-426c-885d-8d0dec32e145)  is also fairly situational as you might not be able to keep it active constantly, so it is something to keep in mind. \n\n---\n\n### 🗒️ Round Notes: \n\nThis is a really important round for farming Stadium Cash. If you made at least 10k cash, you will have a fairly large spike in your HPS and be able to make a ton of cash this round. Once again, damage boost when you can, but you will want to focus on healing more this round so you can get ahead on cash.",
        "stats": {
            "LIFE": 252,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 5,
            "Total LIFE": 252,
            "Attack Speed": 25,
            "Weapon Power": 15,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "ea8be14a-5807-4cfb-81ab-4707644399c2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "b090d08e-70f6-45a4-a429-bd8c56ba39c8",
                "notes": "",
                "action": "optional",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "91668cde-b699-4cfb-8e5b-5494328c4a77",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "268efab6-808f-459e-b070-8b206b3e7d63",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "35c81c98-1ae5-4a94-b3a7-79d05c9560a4",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "9ad2a33d-44e1-4f82-9942-38eb2f636325",
                "notes": "Slot Vital-E-Tee in when you need extra survivability in matchups where there is heavy burst damage.",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "33bdf9ed-c25c-49e0-a0eb-3bbba5b703f2",
                "notes": "Slot in Angeleisure Wear in matchups where the small passive heal will help you stay alive and when you can safely use Angelic Descent and/or Guardian Angel often.",
                "action": "optional",
                "upgrade_id": "00b53ed7-0768-442b-a2c3-8d19608c9391"
            },
            {
                "id": "8b520618-8227-4cc5-8f08-081bf9d91b2a",
                "notes": "Decent filler item when on maps with health packs you play near.",
                "action": "optional",
                "upgrade_id": "ab8eba6a-0bda-4b12-8854-4ba4169b515f"
            },
            {
                "id": "f8e0e492-18cb-4670-af5b-0d4320098b49",
                "notes": "Buy Armored Vest over First Aid Kit when you could be bursted before you have time to reposition.",
                "action": "optional",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "6155a875-7a69-47af-9a36-037580e8481a",
                "notes": "After the buffs, this feels really good on Mercy. I wouldn't recommend this against poke damage because it'll get wasted really early, but it's nice.",
                "action": "optional",
                "upgrade_id": "274b7523-8273-4740-aa7b-837f3f143900"
            },
            {
                "id": "bba3539d-4b4f-4208-b709-7e6e48cc5711",
                "notes": "I honestly don't recommend even buying this as a filler item, but I feel like a speedy fairy when I buy this early so do with this information what you will.",
                "action": "optional",
                "upgrade_id": "2a4ffaf4-f14b-47d2-a267-0a0e83e87418"
            },
            {
                "id": "f2dac849-1546-4255-b0c5-c850f2c2ac88",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "69c75959-8a03-46e3-a32b-ebbaccede960",
                "notes": "",
                "action": "buy",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            }
        ]
    },
    {
        "id": "b67a3d29-da35-42a8-a360-163e046f6095",
        "build_id": "59bbc876-3ec2-4307-9b3a-0a790e52c89a",
        "round_number": 3,
        "cash_earned": 0,
        "created_at": "2025-06-25T08:59:18.445343+00:00",
        "notes": "### 💰 Item Info: \n\nThere are two main options to choose from based on the enemy team's composition.\n\n1. Against consistent or a mix of consistent and burst damage, build: \n\n[Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) and [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) or [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) are safe to default to in the majority of games. [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) makes valk ridiculously strong and will help you earn more Stadium Cash. Prioritize [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) first when struggling against either dive heroes, are generally being chased a lot and/or your other support isn't helping you much. It's generally the worse option when taking a mix of consistent and burst damage as [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) sees significantly less value into burst damage. If you prefer depending on good movement and positioning to survive, you can always buy those items later, but there will be many games where you cannot rely solely on good movement to keep you alive. There are so many buffs to heroes mobility and overall damage that make it very easy for heroes to chase you or even burst you down in the first place. \n\n2. Against mostly burst damage, build: \n\n[Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) and [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) are really good when struggling against burst damage. Specifically [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) gives you a lot of time to react and reposition into high burst damage. [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) is preferred simply because it makes valk really strong and also helps you earn a lot of Stadium Cash. It isn't always necessary into [Juno](hero_035c63b7-084c-4abd-9de5-c9a00e9b6a18) this early, but against [Junkrat](hero_3ac20f6c-2bce-45f3-998e-9129cc6e5c05) and [Freja](hero_e80840a1-845d-4008-966c-585b7cb4a424), this becomes a must buy. Against those two heroes specifically, I would suggest pretty much always prioritizing [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) over [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) even when facing a mix of consistent and burst damage because of how fast they can kill you and struggle a lot less when you have teammates not helping you.\n\n---\n\n### 🔹Powers: \n\n  * [Triage Unit](item_fec0554c-2685-4b93-822d-bf0020e654b4) is great for simply buffing your healing. However it is a riskier pick because it can put you behind later as you won't have  [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) until round 7 if the match even lasts that long.\n\n  * [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) is my personal favorite power because of how much survivability it gives you without sacrificing item slots and stats. This item synergizes ridiculously well with  [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) for really strong early game survivability and is still very strong in the later rounds of the game. Pick this power when you are struggling to stay alive. \n\n  * [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) is simply just a really strong power. Healing builds give so much ult charge that you will usually have valk every fight and with how much weapon power you build, your healing will be very strong during valk. I typically refer to valk with this power as my \"auto win button\" for a reason. I will warn you though, if the matchup is riskier, typically because of double hitscan, it can be safer to not take this and simply abuse double beam length in valk. Just something to keep in mind.\n\n*There are other powers that are good in this build, but not worth it in my experience at round 3.* \n\n---\n\n### ➕ Healing Info:\n\n\nMercy’s healing is affected by both weapon power and attack speed. Weapon power directly increases the amount she heals and attack speed increases the rate at which Mercy heals. To optimize Mercy’s HPS, you will want both weapon power and attack speed. This becomes less important later as there is a massive lack of epic attack speed items that work well with Mercy’s kit. If your goal is simply to increase your healing, always prioritize rare items first, then add in epic items when you have the funds to start replacing them. I do not know how much cash you will make each round, so you will need to calculate what combination of items will increase your healing the most.\n\nOn top of this, epic items should be treated like a luxury. In terms of cost, they provide worse stats in return for valuable effects and taking up less item slots. For example with the standard 20k budget for this round buying only rare and common items we can get 105 HPS, whereas if we buy an epic item (I will use  [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) for this example as it's one of the most cost effective epic items for healing) we can get 93 HPS (increased to 105 when healing an ally below 50%). Even when healing an ally below 50% life for  [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) the rare items still heal the same amount and significantly more when above 50% life. In total the rare items cost 250 cash less too. This will be incredibly important to keep in mind in the following rounds, as I have no idea how much cash you will make each round and you will need to buy accordingly. \n\nKeep the three rare items  [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e)  [Mid-Air Mobilizer](item_760c1441-8cfa-426c-885d-8d0dec32e145) and  [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) as long as you can and replace  [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) with epic items when you can afford it. If you cannot afford  [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a), buy  [Aftermarket Firing Pin](item_2485b212-b286-42d0-a2bd-20eb4396b054) plus  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) and/or [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0). In fact if you have enough item slots, those three together are better than [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) and cheaper.  You might not have enough to buy an epic this round as you will need a lot of cash to replace [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) with  [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) so continue to fill the gaps with rare items.",
        "stats": {
            "LIFE": 324,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 5,
            "Total LIFE": 324,
            "Attack Speed": 25,
            "Weapon Power": 20,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "dc7567f5-9a2c-44c7-88f3-16911fcce243",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "33071c4b-b8de-455c-aba3-303bf8a2ec91",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "dec78816-e0dc-438b-8989-ffc0f45fc2ff",
                "notes": "Slot Vital-E-Tee in when you need extra survivability in matchups where there is heavy burst damage.",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "0906382b-03d8-4fa8-9b12-a868b5d7838b",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "57602a11-c48b-44e0-a904-ec091ea498a8",
                "notes": "",
                "action": "optional",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "7f098bd1-bb5c-417b-8ac7-4f92cc207ae4",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "6c84c265-fe42-4902-89b0-7a33a64c1865",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "511e0f03-3dc9-4054-952f-689edd102c79",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "c29c74fb-c04f-4859-ac15-e3894bd1b5cb",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "68b7c8ad-eca0-4bab-85e4-8000a43c88f4",
                "notes": "",
                "action": "buy",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "ad3794d2-7407-4f89-980a-acc28c177070",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c"
            },
            {
                "id": "f37b63f7-dc50-4674-bb6f-a832295fb039",
                "notes": "",
                "action": "optional",
                "upgrade_id": "0390c8af-2a68-4da2-b876-93da32c3f448"
            }
        ]
    },
    {
        "id": "5ca82069-230a-4cb5-a391-9572be507e24",
        "build_id": "59bbc876-3ec2-4307-9b3a-0a790e52c89a",
        "round_number": 4,
        "cash_earned": 0,
        "created_at": "2025-06-25T08:59:18.445343+00:00",
        "notes": "### 💰 Item Info:\n\nPrioritize defensive items first if you are having a hard time staying alive, then rare items to further increase your healing. \n\n* **Core Healing Items:**\n  *  [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) - great early game item to increase healing\n  *  [Mid-Air Mobilizer](item_760c1441-8cfa-426c-885d-8d0dec32e145) is pretty much the same as  [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) besides the condition for activating it\n\n* **Filler Items:**\n *  [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) - always prioritize the core items first as they are cheaper and give better stats.  If you have enough to sell this and buy an epic item, you should always do so\n  *  [Aftermarket Firing Pin](item_2485b212-b286-42d0-a2bd-20eb4396b054) can be bought if you cannot afford [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a). Pair this item with  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) and/or  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) \n  *  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) - filler item, if you can't afford both [Weapon Grease] and [Compensator], prioritize whichever gets you closer to a 1:1 ratio of weapon power to attack speed\n  *  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) - filler item, if you can't afford both [Weapon Grease] and [Compensator], prioritize whichever gets you closer to a 1:1 ratio of weapon power to attack speed\n* **Optional Items:**\n  *  [Vital-E-Tee](item_b92e6f1d-3aac-4eec-b027-00c8e1529016) is cheap and should be bought if you are struggling to stay alive\n  *  [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) - avoid buying this early unless you believe it'll help you stay alive more than  [Vital-E-Tee](item_b92e6f1d-3aac-4eec-b027-00c8e1529016)\n  * [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) can be bought if you need to abuse beam length to stay alive\n  * [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) has great stats and is decently priced. This will usually be your first upgrade towards your healing.\n  * [Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448) - if you are comfortable managing your guardian angel cooldown and the matchup allows you to maintain stacks, this is better than [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) \n  * [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) - prioritize this if you picked  [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) round 3 and for some reason haven't bought this yet",
        "stats": {
            "LIFE": 334,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 5,
            "Total LIFE": 334,
            "Attack Speed": 20,
            "Weapon Power": 35,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "8fc4b3ab-3da0-446f-9a9c-6d90bb79ec00",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "5946eb71-8183-4f95-af03-68728f7920ca",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "4b76d705-6222-451f-9669-f59f97639bb0",
                "notes": "Slot Vital-E-Tee in when you need extra survivability in matchups where there is heavy burst damage.",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "1c82ffb6-37e8-49fb-9663-89e73ecce2f7",
                "notes": "",
                "action": "optional",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "31d13084-ed30-4d0d-8b5c-f99cd1a10cd0",
                "notes": "",
                "action": "optional",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "d0e97bcb-d31d-46cc-a1e8-8b2fb5d43df7",
                "notes": "",
                "action": "optional",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "d696a570-7d5c-4ee8-a7a5-930cff304b1c",
                "notes": "",
                "action": "optional",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "b6ea7d91-a82d-4bd5-baa9-903f87179b94",
                "notes": "",
                "action": "optional",
                "upgrade_id": "a291de85-b6d9-43cf-b5da-f3184a156f48"
            },
            {
                "id": "7ac17449-7e37-4229-859f-5d6e15d0db98",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "ded5ef93-1733-48d0-b56d-eb1485b2d592",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "57472bfe-ed9a-495c-a1de-096fa0156bc5",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "0e4c4d98-5881-4046-8e91-00a9d6aeb829",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "e1d69131-8f88-47f9-a162-b0ee3696070c",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "014b6dc8-79cb-47dc-b734-94880231bf25",
                "notes": "",
                "action": "optional",
                "upgrade_id": "67e0b1c5-3bcb-4ab5-b818-5082e5706124"
            },
            {
                "id": "231256cc-5f3a-491d-8489-4d44aecb6ae2",
                "notes": "",
                "action": "optional",
                "upgrade_id": "0390c8af-2a68-4da2-b876-93da32c3f448"
            },
            {
                "id": "8990077a-472d-4ae8-b6be-c8696a982c94",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            }
        ]
    },
    {
        "id": "65ff2dd1-0113-47f8-aa9d-bb1de0e00cf4",
        "build_id": "59bbc876-3ec2-4307-9b3a-0a790e52c89a",
        "round_number": 5,
        "cash_earned": 0,
        "created_at": "2025-06-25T08:59:18.445343+00:00",
        "notes": "### 💰 Item Info:\n\nPrioritize maximizing your HPS and defensive items when needed to survive. \n\n### 🔹Powers: \n\nIf you do not have  [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) already, take it this round and buy  [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8). If you already have it, take [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb). Alternatively you can take [Triage Unit](item_fec0554c-2685-4b93-822d-bf0020e654b4) instead if you are certain you can go without  [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) until round 7 and believe it'll be more useful.",
        "stats": {
            "LIFE": 354,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 5,
            "Total LIFE": 354,
            "Attack Speed": 20,
            "Weapon Power": 40,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 10
        },
        "round_upgrades": [
            {
                "id": "d1dfecdf-fa49-4193-a57e-26d7d2ccad98",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "2c4b2df2-1ea9-43eb-9494-680f7ff30340",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "d88e12ae-cb6d-4609-8893-8f305585013a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c6e1c072-ff50-467e-b59f-9506baea10c1"
            },
            {
                "id": "8e271894-0965-4a6e-befe-cdf9e5591983",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "102274f5-d3cc-48a7-9606-9b472b9f2e02",
                "notes": "",
                "action": "optional",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "ae017860-7a92-4527-b756-9da06b886081",
                "notes": "",
                "action": "optional",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "e7002079-7136-466d-a058-a6e26c29fe32",
                "notes": "",
                "action": "optional",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "f1c1bf03-4490-4905-ad8d-e2fac9f725fd",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "b09fbf23-e982-4dc2-94fa-bd1008e42352",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0390c8af-2a68-4da2-b876-93da32c3f448"
            },
            {
                "id": "e08b8f75-dd36-411b-b71b-07735e69c587",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "e74f1dee-6efb-48b7-accb-3e41750492c3",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "81e0d966-7fef-40e8-8245-6e240d484cd1",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "f6937cb0-3ec2-4bdc-a59a-f9f8430fe3ec",
                "notes": "",
                "action": "optional",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "e8ff5956-d8bf-4bde-95b8-44792c1ccd9f",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            }
        ]
    },
    {
        "id": "868d42b2-d556-4a7c-aa46-b46f96340300",
        "build_id": "59bbc876-3ec2-4307-9b3a-0a790e52c89a",
        "round_number": 6,
        "cash_earned": 0,
        "created_at": "2025-06-25T08:59:18.445343+00:00",
        "notes": "### 💰 Item Info:\n\n* I will describe pretty much every optional item I believe is viable in this build with one exception. As you may have noticed by now, I haven't mentioned any battle mercy items or powers despite them being fine in weapon power based builds as such. This is intentional to not bloat the build/guide and also because I honestly have a more passive playstyle and generally don't pull out the glock often. If you do like to battle mercy, it should be fairly simply to edit the build to your playstyle. \n\n  * [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) - Cheap stat stick for weapon power. This can be replaced late game for [Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b) if you have cash to spare. \n\n  * [Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b) this is just a stat stick. It's an expensive item that offers a high amount of weapon power. Buy this if you are rich and need more healing. \n\n  * [Booster Jets](item_a291de85-b6d9-43cf-b5da-f3184a156f48) gives decent attack speed. Movement speed is not very useful on Mercy, but it's a good item nonetheless.\n\n  *  [Aerial Distresser](item_0fcb9020-c729-49b9-b398-3223797b6204) is another good attack speed stat stick. The 25 shields is a nice bonus and the passive effect can be useful while pistoling in valk. \n\n  * [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) can be bought if you need to abuse beam length to stay alive. \n\n  *  [Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448) gives a good amount of weapon power and some CDR. Maintaining stacks requires you to use guardian angel basically on cooldown so try to maintain them when possible, but be cautious as it could leave you without guardian angel when you need it. \n\n  * [Volskaya Ordnance](item_396c0970-daa8-47e3-8049-e65f03fe5cec) gives decent attack speed. From my understanding this item also gives an increased 20% weapon power when healing an ally with at least 400 more life than you. (Please correct me if I'm wrong about that) So in theory this is great for healing tanks with large health pools and teams that generally built more health than you.\n\n  *  [Resurrection Rangefinder](item_99baffec-51b5-42e4-be61-e29f3de8219f) - While this isn't a rez build, that doesn't mean you wont use rez ever.  Helps you get off some rezzes that would've typically been too risky otherwise. \n\n  * [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) - If you need more survivability, buy this. Do not ever buy this item if you don't already have an item to help mitigate damage like armor or  [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) as damage mitigation is more important. This item becomes significantly more important against burst heroes like [Juno](hero_035c63b7-084c-4abd-9de5-c9a00e9b6a18) and especially [Freja](hero_e80840a1-845d-4008-966c-585b7cb4a424). This is a must buy into  [Freja](hero_e80840a1-845d-4008-966c-585b7cb4a424) and will give you the much needed defensiveness to survive her insane burst damage. \n\n  * [Overdrive Core](item_a2a8dba1-5f2f-4da1-9445-b08f49162121) - **I need to test this item a LOT more so take this with a grain of salt.** First impressions are that this item feels really good for the most part. I've had a lot of success pairing this with [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) into high burst teams. It's cheap, it gives a decent amount of weapon power and shields. The passive effect on this item can honestly be completely useless if it gets wasted early or after a lost team fight, but [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) usually gives you ample time to reposition and helps prevent it from proccing super early for the most part. \n\n  * [Ogundimu Reduction Field](item_b12daf48-069b-44c1-88fe-221cbcff664d) - This item has a very good synergy with [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) where the DOT from [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) actually stacks this item thus making it very easy to maintain stacks and max stacks out insanely fast upon taking damage. Those two items + [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) make you ridiculously tanky without sacrificing too much healing.\n\n  * [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) is such a good item. It's cheap, gives you health, and gives you so much survivability. I really like this item paired with [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) as you can position yourself really far from your team and aren't punished for making too much distance with  [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931). They can both be bought individually based on need, but they feel great together. \n\n  * [Chain Evoker](item_812cc89e-feb0-47d0-9e03-9d8e33a80aca) can be really good if your other support also built to heal. While this is a healing build, that doesn't mean you don't use damage boost ever. If my other support is healing a lot and/or I have good DPS or even a tank who could benefit from damage boost, I'll buy this. It also gives armor which helps a lot.\n\n**Additional Info:** There are many items that serve very similar purposes in this section that need additional information of when and why to prioritize specific ones. For starters, defensive items that simply make you tankier. [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) paired with [Ogundimu Reduction Field](item_b12daf48-069b-44c1-88fe-221cbcff664d) and optionally [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) make you ridiculously tanky and are the most general purpose in this build. If you don't want to think too much about it, these are great to default to as they are good into all damage types. If you are consistently taking a lot of damage to beam type heroes or heroes like [Soldier: 76](hero_e1ac7ef5-4648-4998-b8b0-9e3da3e60546) (specifically weapon power builds) who do consistent amounts of damage or are receiving a mix of consistent AND burst damage, prioritize the above. However, there are better options if your struggling with mostly burst damage.\n\nAgainst mostly burst damage, [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) will be your best friend. There are *many* items that pair very well with [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) and can be bought if further defensive items are needed. [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) is great to pair here to actually mitigate some of the damage you're taking. Keep in mind that since [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) actually mitigates 15% of the damage you are taking, that it might prevent the burst damage you take from actually being over 100 damage at once. This is basically a non issue in the later rounds because damage has ramped up so much, but it should be kept in mind in the mid game. Next [Overdrive Core](item_a2a8dba1-5f2f-4da1-9445-b08f49162121) is another good item to pair if you don't actually need much more to help you survive. It provides significantly less survivability than the other options, but still provides a decent amount of weapon power and [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) helps prevent the passive from getting wasted too early. Other good items to pair are movement based items like [Angelic Acrobatics](item_baad85fc-3da5-43af-ad9d-f17885f59aa5) or [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) for games/rounds where more tankiness is unnecessary. \n\nOther items that aid positioning and/or mobility can also be bought instead in certain matchups or specific maps. There are many games where there is either no dive/flanking heroes, you might often be the last alive on your team, or you simply need items to help you keep up with your team as opposed to helping you stay alive. [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) is a great option on larger maps where you can position yourself further away to keep yourself safe and/or playing with heroes you need help keeping up with like [Reinhardt](hero_a3b6ca2c-6cbd-43dc-bb78-a728e42fba49), [D.Va](hero_e8e1dc68-45c4-47c2-b421-95e33594e6b6), and [Genji](hero_31fd201d-2f46-41e4-b125-9fa9e55fed46). I cannot emphasize this enough, sell this on smaller maps unless for whatever reason you think you still get value from it. [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) pairs really well with [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) by allowing you to play ridiculously far away from your team and reposition with ease. Paired together, these items becomes very useful when struggling against dive heroes as well. I usually would try to avoid [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) without [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) because it can very easily lead to you flying out of beam range and having poor beam uptime. [Angelic Acrobatics](item_baad85fc-3da5-43af-ad9d-f17885f59aa5) is fine? In this build, it's only purpose is to aid movement on top of making it easier to maintain [Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448) stacks, which you shouldn't be struggling with if you have 30% CDR anyways. If you like the item, go for it. If not, it can be ignored as there are better options.",
        "stats": {
            "LIFE": 369,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 369,
            "Attack Speed": 30,
            "Weapon Power": 40,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 10
        },
        "round_upgrades": [
            {
                "id": "bf56c10d-5528-4b2b-92e1-45fea90fb066",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "30c83236-d28d-4b00-b349-1bbbac733e2a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "172998dc-ddde-457f-91e4-e603855469f7",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c6e1c072-ff50-467e-b59f-9506baea10c1"
            },
            {
                "id": "d8c37f8d-13ef-404b-939e-cb4bda02c290",
                "notes": "",
                "action": "optional",
                "upgrade_id": "fec0554c-2685-4b93-822d-bf0020e654b4"
            },
            {
                "id": "de6ac31e-75ab-4bb4-9640-2e3a684f06d6",
                "notes": "",
                "action": "optional",
                "upgrade_id": "396c0970-daa8-47e3-8049-e65f03fe5cec"
            },
            {
                "id": "942d3e27-800b-4170-8651-5fa0a5cb861d",
                "notes": "",
                "action": "optional",
                "upgrade_id": "bbaf01d7-340d-4199-b738-86a98d68fe9b"
            },
            {
                "id": "00077b74-6588-42ab-b366-a2be9aa09a74",
                "notes": "",
                "action": "optional",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "022cac77-9b85-4a83-91b6-b695a7de085a",
                "notes": "",
                "action": "optional",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "95cb942d-ff83-496d-a022-2793173036fb",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0390c8af-2a68-4da2-b876-93da32c3f448"
            },
            {
                "id": "cc4801f1-6bfb-4187-ac55-d1a9a5f85c63",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "393aa6cf-b943-49f2-af11-6ec67aa490fc",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "5c5a2bac-305e-40c7-b476-21d556016b44",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "39ad29a0-5083-4616-b78e-8ffd6f037667",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "8485bdc0-97ed-4021-96f3-f5c94cb2f113",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a291de85-b6d9-43cf-b5da-f3184a156f48"
            },
            {
                "id": "def40b70-634d-4745-a06b-0191b1ba98aa",
                "notes": "",
                "action": "optional",
                "upgrade_id": "67e0b1c5-3bcb-4ab5-b818-5082e5706124"
            },
            {
                "id": "4dbdf71e-eaea-454c-89ef-8df65d5db3d8",
                "notes": "",
                "action": "optional",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "257bc661-a049-46a0-a50a-3e96d4f58d5d",
                "notes": "",
                "action": "optional",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            }
        ]
    },
    {
        "id": "9740fe96-dea5-42b5-a51a-17a19f537cc3",
        "build_id": "59bbc876-3ec2-4307-9b3a-0a790e52c89a",
        "round_number": 7,
        "cash_earned": 0,
        "created_at": "2025-06-25T08:59:18.445343+00:00",
        "notes": "### 🔹Powers: \n\n* There are a few powers I didn't previously mention in round 3 and 5 because I don't think they are either very good that early in the game and/or there are simply better powers that need to be prioritized. I didn't mention powers that were mentioned in previous rounds to not bloat the build/guide too much, but they are all still good this round.\n\n  * [Distortion](item_5557e2f2-02df-4eac-8128-0c23b71183b1) contrary to popular belief, lifesteal affects both weapon damage AND ability damage. I don't pick this power when my teammates are squishy and die before they can utilize the lifesteal. Synergizes really well with  [Chain Evoker](item_812cc89e-feb0-47d0-9e03-9d8e33a80aca) too.\n\n  * [Protective Beam](item_3f1ef995-8ecc-45fb-8b57-26fdccc21feb) in my experience is really good with tankier teams and just further enhances their survivability. I tested this power a lot when trying to prevent my teammates from being one shot and can confidently say I don't recommend it with squishy teams. \n\n  * [Renaissance](item_a460f234-6434-4d47-99f9-d4a0b15cd591) synergizes very well with  [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb). While this isn't a rez focused build, that doesn't mean you don't use rez ever.",
        "stats": {
            "LIFE": 411,
            "Armor": 50,
            "Shield": 25,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 486,
            "Attack Speed": 30,
            "Weapon Power": 40,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 10
        },
        "round_upgrades": [
            {
                "id": "a0d55bf7-ad6a-4a96-8086-335d91254126",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "134cefad-e2c0-49a4-a344-5c7fa66667c4",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "b33d73b4-39b2-4614-b970-b332fbbc6f26",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c6e1c072-ff50-467e-b59f-9506baea10c1"
            },
            {
                "id": "822d9169-d456-4d63-b1fc-5ec2b3326e3b",
                "notes": "",
                "action": "buy",
                "upgrade_id": "fec0554c-2685-4b93-822d-bf0020e654b4"
            },
            {
                "id": "935fb632-3413-4bf1-911e-7103f63940d2",
                "notes": "",
                "action": "optional",
                "upgrade_id": "3f1ef995-8ecc-45fb-8b57-26fdccc21feb"
            },
            {
                "id": "e7cc0c0d-310e-47f2-aeb5-40416d125cae",
                "notes": "",
                "action": "buy",
                "upgrade_id": "b12daf48-069b-44c1-88fe-221cbcff664d"
            },
            {
                "id": "7fe62196-5a7b-42a0-a7fc-c7f34003c840",
                "notes": "",
                "action": "buy",
                "upgrade_id": "bbaf01d7-340d-4199-b738-86a98d68fe9b"
            },
            {
                "id": "ef709a93-80bd-4a21-a2fe-1daa3842512e",
                "notes": "",
                "action": "optional",
                "upgrade_id": "baad85fc-3da5-43af-ad9d-f17885f59aa5"
            },
            {
                "id": "8c1058a4-a83b-4e90-aff6-accb6dc3adbd",
                "notes": "",
                "action": "optional",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "23b003b8-4bbf-40b3-a474-258c12a078e5",
                "notes": "",
                "action": "optional",
                "upgrade_id": "396c0970-daa8-47e3-8049-e65f03fe5cec"
            },
            {
                "id": "23f6724d-0496-412c-b570-37fb5bbbdbed",
                "notes": "",
                "action": "optional",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "e40dc1c2-531d-4d5d-9400-252880afba10",
                "notes": "",
                "action": "optional",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "d421711f-9df0-4608-a927-eae88eb2ad94",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c"
            },
            {
                "id": "2f52b9c8-86f4-4c02-97a8-6cd80a97dc38",
                "notes": "",
                "action": "optional",
                "upgrade_id": "a2a8dba1-5f2f-4da1-9445-b08f49162121"
            },
            {
                "id": "58b969a3-8a5d-4fa9-8b28-4142a6b797a9",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a291de85-b6d9-43cf-b5da-f3184a156f48"
            },
            {
                "id": "0c97005f-3292-4b8d-bdae-19ea3286e907",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0390c8af-2a68-4da2-b876-93da32c3f448"
            },
            {
                "id": "773ed8dd-863d-4874-8d86-6694336c4c4e",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "2087ce55-4bd0-40a4-85ce-806520d0c508",
                "notes": "",
                "action": "optional",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "79b87f2a-145d-436d-9d2c-59bd7b73fc2b",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0fcb9020-c729-49b9-b398-3223797b6204"
            }
        ]
    }
]