[
    {
        "id": "1183faa9-4ba2-4be5-b4fb-0a8915bf19ad",
        "build_id": "70f5c51d-c58f-4a98-8beb-56d5e5bd3662",
        "round_number": 1,
        "cash_earned": 0,
        "created_at": "2025-06-29T16:07:15.190391+00:00",
        "notes": "# **Round 1 – “Stabilize and Scale” Mercy**\n\n## **Power: Threads of Fate**\n\nYour build opens with **Threads of Fate**, and for good reason—this is arguably one of the strongest openers for support players who want early presence without needing to lean on burst stats.\n\n- The beam chaining mechanic mirrors your current beam onto your previous target. That means if you flick from healing to damage boost on your current target, the previous target receives that same effect too, in real time.\n\n- This allows you to double your utility without needing full scaling yet—you’re controlling both outputs with one action.\n\n- To keep Threads active, you must swap targets every ~2.5–3 seconds. If you stay locked onto one target too long, the chain breaks.\n\n*Pro tip: Don’t worry about saving Valk. With Threads of Fate and early beam efficiency, you’ll often have Valk ready before the enemy support does. Use it as often as possible—every cast gives your team a tempo swing and accelerates your next ult. Stadium Mercy thrives on consistent ult cycling, not hoarding.*\n\n## Items:\n\n [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) \n\n- Boosts your healing and boost beam output from the jump.\n\n- Especially good under Threads, where every tick of both beams scales off WP.\n\n [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) \n\n- Mercy’s healing beam operates through rapid healing “ticks”, not a smooth continuous flow.\n\n- In Stadium Mode, Attack Speed determines how frequently those healing ticks occur—faster ticks = more healing applied per second.\n\nThink of it this way:\n\n- Weapon Power = how strong each tick is\n\n- Attack Speed = how many times per second those ticks happen\n\nTogether, they multiply your effective healing rate.\n\n- Even a +5% increase makes your beam feel smoother, more responsive, and helps charge Valkyrie faster, especially when paired with Threads of Fate.\n\n- Often overlooked, but the synergy between WP × AS means this gives multiplicative scaling when paired with Compensator.\n\n [First Aid Kit](item_0172eaaa-1902-44a3-b989-d12f0f7301da) \n\n- Grants 25 shield HP, bringing your effective total to 250 HP—giving you just enough buffer to survive early poke, chip damage, or a surprise body shot.\n\n- The real strength of this item lies in its regen utility: it reduces the delay before your natural healing kicks in by 33%.\n\n- Normally, Mercy must wait ~2 seconds without taking damage before her self-heal starts; with this item, that wait drops to ~1.3 seconds.\n\n- This lets you escape and start regenerating health sooner, which pairs extremely well with her mobility and defensive positioning.\n\n- Unlike Zenyatta or Sigma, the shield doesn’t regenerate itself—but your faster regen delay makes it easier to top yourself off between fights or while kiting.\n\n## Round 1 Playstyle Tips:\n\n- Flick between targets regularly to maintain Threads. The beam mirror only works if the link stays active.\n\n- Start by healing your tank or a diving flank, then flick to boost a high-value DPS during downtime.\n\n- Use Guardian Angel carefully—you don’t have enhanced mobility yet, so prioritize safe repositioning over aggressive flight.\n\n- Let your 25 shield buffer absorb chip damage. This helps you stall until passive regen kicks in.\n\n- Use Valkyrie often. Its cooldown is short, and you can chain fights together by ulting early and rebuilding charge quickly.",
        "stats": {
            "LIFE": 225,
            "Armor": 0,
            "Shield": 25,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 257,
            "Attack Speed": 5,
            "Weapon Power": 5,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "e0d72a02-3b96-403a-a4b3-12cd7ab59730",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "1c72b534-dbe2-49d8-82e8-1f99d9de2353",
                "notes": "",
                "action": "buy",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "21bc76e1-334f-438d-9853-ab8f51aa3c13",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "9469601a-a400-4e11-9648-3b291131a5eb",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            }
        ]
    },
    {
        "id": "3cb93f64-9856-42a4-bae7-592aacb5995d",
        "build_id": "70f5c51d-c58f-4a98-8beb-56d5e5bd3662",
        "round_number": 2,
        "cash_earned": 0,
        "created_at": "2025-06-29T16:07:15.190391+00:00",
        "notes": "# **Round 2 – Movement is Survival Mercy**\n\nYou don’t pick up a second power in Round 2. Instead, your focus is on survivability, mobility, and beam uptime through stat-efficient green-tier items. This is a momentum round—you're not trying to power-spike just yet, but you're laying the groundwork for one.\n\n*The best Mercy build is the one that keeps you alive long enough to keep enabling your team. Round 2 is about making sure you live through fights—not just support them.*\n\n## Items:\n\n [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) \n\nGrants +50 bonus core HP, pushing your total to 250 or 300 HP, depending on whether you’ve kept First Aid Kit or sold it to afford this pickup.\n\nIncreases your launch velocity by 25% when canceling Guardian Angel with crouch or jump.\n\nThis is arguably Mercy’s most important early-game movement item. It gives you:\n\n- Better vertical lift when slingshotting\n\n- Faster escape launches out of danger\n\n- More reliable midair movement when Valkyrie is active\n\nIn short: if you’re not mobile, you’re not Mercy. This item fixes that.\n\n*If needed, sell any or all items from the previous round to obtain this item. The movement value is worth the tradeoff in most matchups.*\n\n[Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) \n\n- Carried over from Round 1.\n\n- Still gives consistent value on all beam output (especially with Threads of Fate still active).\n\n- Continues to be one of the most stat-efficient green items.\n\n [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) \n\n- Also carried over from Round 1.\n\n- Boosts healing tick rate and synergizes with WP.\n\n- Multiplies healing effectiveness without needing new investment.\n\n [First Aid Kit](item_0172eaaa-1902-44a3-b989-d12f0f7301da) \n\n- Kept for the regen timing bonus—it allows you to start recovering sooner after disengaging from fights.\n\n- That 33% reduction means you start regenerating at ~1.3s instead of 2s, making it easier to bounce back between fights.\n\n- Combined with Blessed Boosters, this makes you hard to finish off when repositioning.\n\n- If sold to afford Boosters, you’ll lose some early sustain but gain much more safety through movement.\n\n## Optional Items to Bridge With (Don’t Buy Yet):\n\nThese are the transitional items you may want to grab in Round 3–4 if your gold doesn’t stretch to an Epic:\n\n [Aftermarket Firing Pin](item_2485b212-b286-42d0-a2bd-20eb4396b054) - +10% AS, +5% MS: a clean tempo item for keeping beams smoother and repositioning faster\n\n [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) - +5% WP; grants +10% AS for 3s after healing: strong synergy with Valk’s constant multi-target healing\n\n [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) - +15% WP: pure beam power for aggressive ult tempo or carry-style sustain\n\n*You’re not buying these yet—just keeping them on your radar if you need to pivot next round.*\n\n## Round 2 Playstyle Tips:\n\n- Practice “slingshot launching” with crouch and jump cancels—Blessed Boosters will now give you serious height and burst distance.\n\n- Try to bounce between low ground and high ground whenever possible, especially when healing isn’t urgent. This helps you avoid dive and farm Valk in safety.\n\n- Your healing isn’t spiking yet, but your uptime is—this round is about staying alive through more cycles of Threads and Valk.\n\n## Round Goal:\n\nBecome untouchable. Set up your escape options. Build Valk rhythm.\nRound 2 is where you stop being an easy kill. Your healing is stable, your escape routes are vertical, and your regen is faster than most supports. This is the round where you start feeling like Mercy—and your ult becomes a consistent tool, not a panic button.",
        "stats": {
            "LIFE": 300,
            "Armor": 0,
            "Shield": 25,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 325,
            "Attack Speed": 5,
            "Weapon Power": 5,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "ae9dd424-aab7-443d-ba84-2dd92fdf9316",
                "notes": "",
                "action": "buy",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "0252e17f-bc71-41c0-b201-feccb3c54442",
                "notes": "",
                "action": "optional",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "e33e0562-178d-4ec8-8586-4a1717db0ab9",
                "notes": "",
                "action": "optional",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "16981236-8d45-43e8-8bce-bf1ea80754b3",
                "notes": "",
                "action": "optional",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "08afebc9-ba83-48df-964f-72cf3d3dd5db",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "1eec8d79-4785-4ac0-a4f4-15efd254fc81",
                "notes": "",
                "action": "buy",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "b0b9196c-57c3-4f2e-8932-b9f7b8655859",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "76d36c9b-eac4-4016-ab74-0beabf36eb56",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            }
        ]
    },
    {
        "id": "a4e386ac-9efd-40f4-80bc-e649790df2f5",
        "build_id": "70f5c51d-c58f-4a98-8beb-56d5e5bd3662",
        "round_number": 3,
        "cash_earned": 0,
        "created_at": "2025-06-29T16:07:15.190391+00:00",
        "notes": "# **Round 3 – Reactive Tempo & Midfight Mastery**\n\n## Power Addition:  [Triage Unit](item_fec0554c-2685-4b93-822d-bf0020e654b4)  \n\nThis is your clutch stabilizer. Mercy’s normal healing can sometimes feel too slow to recover a critical teammate—Triage Unit changes that.\n\n- Triggers automatically when you GA to a low-health ally—no button press needed.\n\n- Applies a +30% healing buff for 3 seconds, letting you triage key allies out of burst zones or clean up dives that would normally get them killed.\n\n- Works seamlessly with Threads of Fate—once it activates, your previous beam target will also receive boosted healing (as long as you’re healing your current target).\n\n- While Valkyrie gives you greater field access, Triage still only activates after GA-ing to a low-health ally—you’ll need to reposition actively to make the most of it. That said, the increased visibility and freedom during Valk make it easier to target the right teammate when it matters.\n\n## Items:\n\n [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) \n\n- Retained from Round 2. Still the core of your survivability and positioning.\n\n- As fights become more ult-heavy, vertical escape and midair control become essential—especially when staying in Valk or weaving through contested space.\n\n [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) \n\n- This item creates momentum after every beam swap.\n\n- Every time you start healing someone (especially during GA), you gain +10% Attack Speed for 3s.\n\nThis synergizes extremely well with Threads, Triage, and Valk:\n\n- Faster beam ticks\n\n- Shorter downtime between ult charges\n\n- More responsive flick healing\n\nThe WP bonus is modest, but the AS proc makes this item scale very quickly.\n\n [Aftermarket Firing Pin](item_2485b212-b286-42d0-a2bd-20eb4396b054) \n\n- Flat +10% Attack Speed gives you a big beam frequency bump across the board.\n\n- +5% Move Speed subtly improves GA pathing and recovery options.\n\n- This is a tempo enhancer—you feel faster, more fluid, and your healing “lands” more efficiently under pressure.\n\n [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) \n\n- A raw healing and damage boost beam amplifier.\n\n- Scales harder than Compensator and becomes your core WP spike.\n\n- In this round, you’re beginning to build toward carry-level beam stats, and this item is the turning point.\n\nOptional Items (depending on gold or performance):\n\nIf you’re underperforming or need to pivot, consider retaining or re-purchasing one of these:\n\n [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) - +5% WP: Stackable with Talon Mod if you’re gold-rich.\n\n [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) - +5% AS: Can smooth beam output if Nanobiotics isn’t enough.\n\n [First Aid Kit](item_0172eaaa-1902-44a3-b989-d12f0f7301da) -  +25 Shield, Regen Delay: Still a good pick if you're struggling to survive dives or poke.\n\n## Round 3 Playstyle Tips:\n\n- Use GA intentionally—try to trigger Triage by dashing to the most injured ally in a cluster. Even if they’re not your final beam target, the 3s boost gives you time to flick to someone else and still keep both alive.\n\n- Under Valkyrie, the synergy between Triage, Threads, and Advanced Nanobiotics is huge—you’ll chain AS buffs naturally and cover your team with amplified healing.\n\n- If you're facing burst comps (Tracer, Widow, Junkrat), you now have the tools to recover midfight instead of retreating. Stay present longer.\n\n- Your movement isn’t just escape—it’s a healing decision-maker. You can now path into fights to save allies instead of always retreating.\n\n## Round Goal:\n\nStabilize high-risk fights. Accelerate Valk uptime. Move with intent.\nRound 3 is where you stop just supporting—you start controlling tempo. Between your launch buffs, AS spikes, and emergency healing burst, you can now swing a fight from unwinnable to stabilized with a single GA and flick.",
        "stats": {
            "LIFE": 320,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 5,
            "Total LIFE": 320,
            "Attack Speed": 10,
            "Weapon Power": 20,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "266c069b-1ad3-4bd9-b628-4beee56076fa",
                "notes": "",
                "action": "optional",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "27e6a0aa-db5d-4703-982b-92721cb335ae",
                "notes": "",
                "action": "optional",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "bdf09533-06ba-4692-b1a0-e00b364e0c8e",
                "notes": "",
                "action": "optional",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "5021e46e-d53d-4249-960b-0de45d3afa2a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "722ca574-e161-4fec-8857-5889f2ff8828",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "0fef5b9a-4db0-4cff-9f07-d713d97795aa",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "8636e925-0bc1-4276-8f34-ccbc33aa264f",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "eedffc57-3f3a-411e-af7b-a89be958afa4",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "889765b0-1a02-4a44-af50-a2846bcb7187",
                "notes": "",
                "action": "buy",
                "upgrade_id": "fec0554c-2685-4b93-822d-bf0020e654b4"
            }
        ]
    },
    {
        "id": "440aaf21-1f17-4aa9-873e-2d671ea5fb4b",
        "build_id": "70f5c51d-c58f-4a98-8beb-56d5e5bd3662",
        "round_number": 4,
        "cash_earned": 0,
        "created_at": "2025-06-29T16:07:15.190391+00:00",
        "notes": "# **Round 4 – Epic Scaling & Valk Economy Online**\n\nNo additional power this round—because your gold is best spent scaling your item core.\nTriage and Threads already give you strong reactive and multi-target value. Round 4 is all about turning that kit into a mid-to-late game engine through three epic-tier items.\n\n*This is a “power-buy” round. If Round 3 made you reactive, Round 4 makes you proactive. You're not waiting for fights to stabilize—you’re forcing them into your tempo.*\n\n## Items:\n\n [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) \n\n- This is your primary healing spike item and your first must-buy epic.\n\n- Grants bonus HP, a flat +15% Weapon Power, and increases healing output by another 15% when targeting allies below 50% life.\n\n- Synergizes directly with Triage Unit—when triggered together, you’ll be healing critical teammates 45% harder (30% from Triage + 15% from Amari’s), letting you swing losing fights and stabilize dives that would otherwise be unrecoverable.\n\n- Works perfectly with Threads of Fate: the amplified healing applies to your previous beam target as long as you’re healing the current one.\n\n*If you can only afford one item this round: get Amari’s.*\n\n [Booster Jets](item_a291de85-b6d9-43cf-b5da-f3184a156f48) \n\n- The core tempo tool for all Valk-focused Mercies.\n\n- Grants a flat +20% Attack Speed, letting your beams tick faster across all healing and boost actions.\n\n- When you use Guardian Angel or Valkyrie, you get +10% Move Speed for 2 seconds—great for kiting, escape, and proactive repositioning.\n\n- Especially powerful when you’re flicking between beams and repositioning mid-fight: you’re now able to dodge, glide, and beam simultaneously.\n\n*Movement is survivability—but now it's also a DPS tool. Faster movement = better beam uptime = faster ult generation.*\n\n [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) \n\n- Still one of your most important items even in Round 4.\n\n- You’ll need the vertical escape more than ever as teamfights become ult-heavy and mobility-dependent.\n\n- Still synergizes with Valk and Booster Jets—now you can launch higher, move faster, and stay airborne with precision, making it harder for enemy hitscans or divers to land damage.\n\n- Stacked with Booster Jets, you now have both vertical and directional mobility tools—a must for surviving burst and isolating high-priority allies.\n\n## Optional/Bridge Items:\n\nIf you’re short on gold, you may retain or cycle in one of these until your full build locks:\n\n [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) - Great synergy with Amari’s healing trigger windows\n\n [Aftermarket Firing Pin](item_2485b212-b286-42d0-a2bd-20eb4396b054) - If you still need smoother healing or movement early this round\n\n [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) -  Still solid for flat WP boosts, but now outscaled by Amari’s\n\n [Chain Evoker](item_812cc89e-feb0-47d0-9e03-9d8e33a80aca) - If your team has strong poke/burst and you want to enable faster ult economy via boost chaining (also adds Armor)\n\n** Round 4 Playstyle Tips:\n\n- Amari's + Triage is your critical care combo. When a teammate drops below 50%, Guardian Angel into them and hold the beam: that’s up to 45% bonus healing for 3 seconds.\n\n- Use Valkyrie aggressively to apply healing while repositioning—your AS and MS buffs mean you can multitask better than any other support.\n\n- Lean into flick-healing behavior: dash to low HP allies to trigger Triage, then flick back to stabilize others. Your movement speed and chain healing will make it feel seamless.\n\n- You now have enough AS and WP to handle burst windows without needing to fully reset.\n\n- If your team is poke-heavy, consider swapping in Chain Evoker soon to boost ult charge via damage boost chains.\n\n## Round Goal:\n\nBecome the engine. Heal faster. Move sharper. Recover deeper.\nRound 4 turns you into a teamfight stabilizer and initiator. You’re not just a beam bot—you’re the heartbeat of your team. If someone’s alive at 1 HP, they’re alive because of you.",
        "stats": {
            "LIFE": 362,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 362,
            "Attack Speed": 20,
            "Weapon Power": 15,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "f9fe04bb-bd50-4053-9269-1757f1a1b5ab",
                "notes": "",
                "action": "optional",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "581fe9af-9642-40ca-ae64-8e8da8dd8774",
                "notes": "",
                "action": "optional",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "91e1f2ba-278a-4d34-9da4-af5eaf1e2178",
                "notes": "",
                "action": "optional",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "8b48412f-c41b-4233-8951-db824005d02c",
                "notes": "",
                "action": "buy",
                "upgrade_id": "67e0b1c5-3bcb-4ab5-b818-5082e5706124"
            },
            {
                "id": "2edbc822-4b9b-4e6a-98c7-b491ad6acc5d",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a291de85-b6d9-43cf-b5da-f3184a156f48"
            },
            {
                "id": "083582c0-ec56-413b-b0ed-a51663d81ed4",
                "notes": "",
                "action": "optional",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "09b41ef1-2ed2-4dca-b0ca-cf93e59f2266",
                "notes": "",
                "action": "buy",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "93954d7d-8d54-4833-8dcb-caea043518f2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "04a50513-5f26-4c80-9996-43faa05ff7aa",
                "notes": "",
                "action": "buy",
                "upgrade_id": "fec0554c-2685-4b93-822d-bf0020e654b4"
            }
        ]
    },
    {
        "id": "d978d658-6f78-4972-909c-3438668a053e",
        "build_id": "70f5c51d-c58f-4a98-8beb-56d5e5bd3662",
        "round_number": 5,
        "cash_earned": 0,
        "created_at": "2025-06-29T16:07:15.190391+00:00",
        "notes": "# **Round 5 – Valk Flow & Meta-Adapted Armor Spike**\n\nPower Addition:  [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) \n\nThis is the centerpiece power for Mercy’s endgame tempo engine.\n\nDuring Valkyrie, this power automatically radiates your staff’s effect to nearby allies—whatever you’re doing (healing or boosting), everyone around you receives it.\n\nThis turns Mercy into a true AoE support, enabling you to sustain your entire team with no beam-swapping required.\n\nIt also frees up your inputs, letting you focus on movement, spacing, and even weapon usage.\n\nSynergizes beautifully with:\n\n- Threads of Fate – for dual coverage outside of Valk\n\n- Triage Unit – for spot-saving low-HP allies as you reposition\n\n- Amari’s Antidote + Chain Evoker – for scaling healing and ult charge from passive beam uptime\n\n*Think of Crepuscular as a beam amplifier—you choose the effect, Valk handles the rest. And because your beams are applied passively, you’re now free to pull out your pistol during Valk. With increased Weapon Power from Amari’s and other items, this is your window to pressure squishies, punish overextensions, or peel—without sacrificing healing.*\n\n## Items:\n\n [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) \n\n- Grants WP, bonus healing to low-health allies, and HP buffer.\n\n- Still the backbone of your clutch healing output, especially in bursty mid-fight phases.\n\n [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) \n\n- Keeps you mobile and safe, especially under dive threat.\n\n- In Valk, the ability to reposition midair while channeling AoE beam effects is incredibly powerful.\n\n [Booster Jets](item_a291de85-b6d9-43cf-b5da-f3184a156f48) \n\n- Still critical to your tempo: faster beam ticks, more Valk generation, smoother control over repositions.\n\n- Adds MS burst that lets you rotate from one critical target to the next.\n\n [Chain Evoker](item_812cc89e-feb0-47d0-9e03-9d8e33a80aca) \n\n- Adds +50 Armor, increasing your ability to survive chip and ult poke—especially important in a meta where poke damage and sustain wars are longer.\n\n- Grants +5% damage boost and +15% ult charge from damage boosted teammates, letting you maintain a high Valk uptime.\n\n- This is your meta adaptation pick: it leans into survivability and economy at once.\n\n*You’re now a teamwide support and ult battery—not just a beam pocket.*\n\n## Optional / Previously-Owned Items:\n\nThese are items you may still have from earlier rounds or may cycle back in if you’re experimenting with loadouts. Just make sure you’re always maximizing your spending—if you can’t afford a full epic, it’s better to trickle down to a high-value rare or common item than leave gold unspent. Every round should push your stats or survivability forward.\n\n [The Closer](item_173c6d0f-dbe6-440e-924f-0ce08189ddce) -  High WP + crit utility; aggressive, but risky outside of damage-boost-centric teams.\n\n [Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b) - Massive burst WP, though rarely needed unless you’re leaning into Valk blaster plays.\n\n [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) - Still a solid WP filler, but mostly outscaled by Amari’s by this point.\n\n [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) -  If you’re still running it from R3, it synergizes well—but you may consider swapping up if you need raw output.\n\n [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) /  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) - Great green-tier picks for healing tempo; keep them in if you’re gold-starved this round.\n\n [First Aid Kit](item_0172eaaa-1902-44a3-b989-d12f0f7301da) - Still valuable if you’re getting poked often or need regen uptime during long duels.\n\n## Round 5 Playstyle Tips:\n\n- Valk = team reset. Don’t hold it—pop it early to stabilize. Crepuscular gives you full-team coverage instantly.\n\n- Position for maximum Crepuscular radius—don’t hover too high or out of range of squishies in need.\n\n- Let damage boost chains build ult passively while you reposition and farm assists.\n\n- Use Blessed Boosters to relocate vertically between fights or dodge snipers—now more than ever, you’re a high-value target.\n\n- Make use of your Caduceus Blaster during Valk. With beams auto-applying, you can pressure the backline, confirm kills, or interrupt angles without neglecting support duties.\n\n## Round Goal:\n\nPlay the entire team. Stop flicking. Start flowing.\nThis is the round where you stop thinking about individual beams—you’re thinking in auras. Valk is no longer just a mobility tool; it’s a fight-winner. With Chain Evoker’s armor and Crepuscular’s coverage, you are now the reason your team doesn’t wipe.",
        "stats": {
            "LIFE": 382,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 432,
            "Attack Speed": 20,
            "Weapon Power": 15,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "2f768023-0733-4375-906a-4233c7f695c4",
                "notes": "",
                "action": "buy",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "ba3ae50c-dbef-4b89-a275-581ad350fcd9",
                "notes": "",
                "action": "buy",
                "upgrade_id": "67e0b1c5-3bcb-4ab5-b818-5082e5706124"
            },
            {
                "id": "24622fe3-daf7-4b01-8ad5-31a139dc55fd",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a291de85-b6d9-43cf-b5da-f3184a156f48"
            },
            {
                "id": "3e236689-b78f-417f-a999-40b1cb8a7c42",
                "notes": "",
                "action": "buy",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "d2bcc779-c37e-41c5-924a-a4e5f143513e",
                "notes": "",
                "action": "optional",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "75b602ac-ff42-45c1-9edd-9986b335d040",
                "notes": "",
                "action": "optional",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "49a7a7fd-1219-4e28-bccb-7f89a10e0f25",
                "notes": "",
                "action": "optional",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "2de32871-05dd-4018-8997-3de9f00a5a63",
                "notes": "",
                "action": "optional",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "3d2d8660-99e8-49ab-8aff-a1b28e65717d",
                "notes": "",
                "action": "optional",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "9c39975d-64c5-48e6-8bad-475b80ff996b",
                "notes": "",
                "action": "optional",
                "upgrade_id": "173c6d0f-dbe6-440e-924f-0ce08189ddce"
            },
            {
                "id": "3be60a8f-5d96-462b-9c4e-844cf9cb0a9b",
                "notes": "",
                "action": "optional",
                "upgrade_id": "bbaf01d7-340d-4199-b738-86a98d68fe9b"
            },
            {
                "id": "2fc33ec7-54a2-443d-9b52-121fcc9baa89",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "cda30be1-ebb2-4cb7-b138-b463a0bb2240",
                "notes": "",
                "action": "buy",
                "upgrade_id": "fec0554c-2685-4b93-822d-bf0020e654b4"
            },
            {
                "id": "dc03fc0e-a58c-4424-9960-b8f4b3402369",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            }
        ]
    },
    {
        "id": "e6b64ee8-3d38-4574-8f9f-e3393f704774",
        "build_id": "70f5c51d-c58f-4a98-8beb-56d5e5bd3662",
        "round_number": 6,
        "cash_earned": 0,
        "created_at": "2025-06-29T16:07:15.190391+00:00",
        "notes": "# **Round 6 – Damage-Capable Mercy & Pressure Finish**\n\nAt this stage, your power loadout is already solid:\n\n- Threads of Fate – consistent dual support\n\n- Triage Unit – reactive low-HP spike healing\n\n- Crepuscular Circle – AoE healing/boost during Valk\n\nWith item scaling peaking, you now begin to lean into pressure tools—not just to heal, but to end fights.\n\n*This round is about owning tempo. Your team doesn’t just recover anymore—they win off your presence. You’ve got enough sustain—now you play for pick pressure, ult rotation, and cleanup.*\n\n## Items:\n\n [Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b) \n\n- Adds a massive flat Weapon Power boost, immediately spiking both your healing and your pistol’s base damage.\n\n- Grants +10% damage against enemies under 30% HP, which directly benefits Mercy’s ability to clean up squishies during Valkyrie.\n\n- This turns you into a finisher—one who doesn’t rely entirely on teammates to close low-health targets.\n\n [The Closer](item_173c6d0f-dbe6-440e-924f-0ce08189ddce) \n\n- Pairs well with Eye of the Spider to enable burst pressure with your pistol.\n\n- Revealed targets are easier to track and clean up during Valk’s mobile gunplay.\n\n- The bonus Weapon Power also contributes to healing, giving this item some hybrid utility, even if it skews aggressive.\n\n [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) \n\n- Still essential. You’re more lethal now—so you’re more hunted. Blessed Boosters allows for tight aerial repositioning to punish or evade.\n\n- Still your most consistent anti-dive tool.\n\n [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) \n\n- The glue that holds your healing together, even while you pressure with damage.\n\n- Still scales Valk’s multi-beam healing, especially on low-health allies when you break off to engage or kite.\n\n [Booster Jets](item_a291de85-b6d9-43cf-b5da-f3184a156f48) \n\n- Keeps your beams smooth and your body in motion.\n\n- As you start to split your time between healing and shooting, this ensures your beam tempo remains intact when you need it most.\n\n [Chain Evoker](item_812cc89e-feb0-47d0-9e03-9d8e33a80aca) \n\n- Grants +50 Armor, helping you absorb chip damage (small, frequent hits over time), poke pressure (ranged harassment that forces you to back up or reposition), and survive ult trades (when both teams commit their ultimates in a single teamfight).\n\n- The +5% damage boost increases your team’s offensive output, and the +15% ultimate charge from boosting ensures you cycle Valkyrie faster—even outside of direct healing.\n\n- This is a meta-stable pick—armor to survive, boost to empower, and charge to keep Valk in play.\n\n## Optional/Swap Items:\n\nIf you're adapting to the enemy comp or struggling to survive, these are excellent pivots:\n\n [Ogundimu Reduction Field](item_b12daf48-069b-44c1-88fe-221cbcff664d) - +50 Armor; grants scaling damage reduction when under pressure.\n\n [Rustung Von Wilhelm](item_aea17a63-3f55-4f91-8f49-a7793fbc56c4) - Health/Armor/Shield increase + DR when low.\n\n [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) - Still decent for AS burst chaining, but largely outscaled by this stage unless you need smoother flick-healing.\n\n [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) -  May still be relevant for raw WP if Eye/Closer aren’t in play or the pistol role isn't needed.\n\n## Round 6 Playstyle Tips:\n\n- Use your pistol in Valk. You’ve now built for it. Aim for low-health stragglers, flankers, or zone control—especially when beams are already covering your team via Crepuscular.\n\n- Watch for Triage triggers midfight, then flick back to pistol pressure before GA repositioning.\n\n- Don’t panic-GA. You now have the tools to juke, shoot, and survive—mix your beams and blaster based on the fight state.\n\n- Chain Evoker is still feeding you ult. Consider activating Valk earlier in fights to force tempo and let Eye/Closer go to work.\n\n## Round Goal:\n\nBecome a fight closer. Heal what lives. Clean up what doesn’t.\nYou’re no longer just a support—you’re a force multiplier. With AoE beams online and finishing tools in hand, Mercy in Round 6 isn’t hiding behind a tank. She’s winning fights in the air, mid-team, mid-storm.",
        "stats": {
            "LIFE": 439,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 489,
            "Attack Speed": 20,
            "Weapon Power": 60,
            "Ability Power": 0,
            "Critical Damage": 10,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "ef7f06e8-f94e-45ad-b8a0-0faa62cdfd42",
                "notes": "",
                "action": "optional",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "add419fc-61de-4d2e-96c3-f41ba350b761",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b12daf48-069b-44c1-88fe-221cbcff664d"
            },
            {
                "id": "f4bc2825-e498-42bc-8b4d-f2f4e3959ea2",
                "notes": "",
                "action": "optional",
                "upgrade_id": "aea17a63-3f55-4f91-8f49-a7793fbc56c4"
            },
            {
                "id": "03f70b8a-0e71-41fe-a6ee-9ea1e29102f6",
                "notes": "",
                "action": "buy",
                "upgrade_id": "bbaf01d7-340d-4199-b738-86a98d68fe9b"
            },
            {
                "id": "0bf7c47f-5028-452e-ae15-2fe97124f475",
                "notes": "",
                "action": "buy",
                "upgrade_id": "173c6d0f-dbe6-440e-924f-0ce08189ddce"
            },
            {
                "id": "bc138669-fb71-408a-9a05-e23518ed42a2",
                "notes": "",
                "action": "optional",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "d737b3b1-1797-498a-a623-b62a14df11d6",
                "notes": "",
                "action": "buy",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "41bdb94a-371c-4637-9fe8-21391a5d15ad",
                "notes": "",
                "action": "buy",
                "upgrade_id": "67e0b1c5-3bcb-4ab5-b818-5082e5706124"
            },
            {
                "id": "31624b7a-34eb-4de5-9acc-ffc36bcdc891",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a291de85-b6d9-43cf-b5da-f3184a156f48"
            },
            {
                "id": "fcc3e24e-c93a-4065-8bd7-4fcd8e74537e",
                "notes": "",
                "action": "buy",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "5854b73c-40bf-41d2-82e0-c80b1aa38be3",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "171d9474-12e4-4723-aaff-8087ecbbbfc0",
                "notes": "",
                "action": "buy",
                "upgrade_id": "fec0554c-2685-4b93-822d-bf0020e654b4"
            },
            {
                "id": "8a399808-d8ec-461e-8888-ac9e8a811e5a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            }
        ]
    },
    {
        "id": "a932f217-bda5-4a77-bd33-4c0af8ac8323",
        "build_id": "70f5c51d-c58f-4a98-8beb-56d5e5bd3662",
        "round_number": 7,
        "cash_earned": 0,
        "created_at": "2025-06-29T16:07:15.190391+00:00",
        "notes": "# **Round 7 – Endgame Mercy: Sustain, Overflow & Pressure**\n\nPower Addition:  [Glass Extra Full](item_659ff350-8602-42cd-b5f9-f4da7e5e912b) \n\nGlass Extra Full turns every bit of beam uptime into proactive value. Once your allies are topped off, your healing doesn’t stop—it starts overflowing into temporary HP, strengthening your team’s durability against poke, chip, and ult spikes.\n\nThis is especially powerful with:\n\n- Crepuscular Circle, which spreads this overhealth to your whole team during Valk.\n\n- Amari’s Antidote, which boosts your base healing numbers to make that overhealth tick faster.\n\n- Chain Evoker, which enables more Valk usage and makes that overflow a consistent teamwide layer of protection.\n\n## Optional Power Picks (Situational Swaps)\n\nDepending on how your match is playing out, you might consider:\n\n [Battle Medic](item_ccd0edff-4d57-4ac2-83a7-bab6ff0ffb2f) \n\n- This option leans into a pistol-heavy Valk playstyle. If you’re consistently getting value from blaster cleanup or poking between heals, this ramps your fire rate for kill confirms. Great if the enemy has squishy targets or you’re dueling often.\n\n [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) \n\n- This is a self-sustain fallback, ideal if you’re being chipped frequently or forced out of position. It helps stabilize your own health during high uptime without needing to peel off allies or break your beam to survive. Especially useful if you’re healing a lot of full-health allies and not gaining much value elsewhere.\n\n- *Choose Glass Extra Full when your team’s tempo is strong and you want to dominate fights through momentum.*\n- *Choose Serenity if you’re being worn down.*\n- *Choose Battle Medic if you’re confident in your gun and looking to close fights yourself.*\n\n## Items:\n\n [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) \n\n- Still your foundation. Escape tool, reposition tool, Valk juking tool. Never sell.\n\n [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) \n\n- Your team’s lifeline and still the most efficient heal-scaling item in the kit.\n\n [Booster Jets](item_a291de85-b6d9-43cf-b5da-f3184a156f48) \n\n- Keeps AS high and positioning sharp, letting you rotate between flicks or stabilize team fights efficiently.\n\n [Chain Evoker](item_812cc89e-feb0-47d0-9e03-9d8e33a80aca) \n\n- Grants +50 Armor, helping you absorb chip damage (small, frequent hits over time), poke pressure (ranged harassment that forces you to back up or reposition), and survive ult trades (when both teams commit their ultimates in a single teamfight).\n\n- The +5% damage boost increases your team’s offensive output, and the +15% ultimate charge from boosting ensures you cycle Valkyrie faster—even outside of direct healing.\n\n- This is a meta-stable pick—armor to survive, boost to empower, and charge to keep Valk in play.\n\n [Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b) \n\n- For clean-up and Valk gunplay. Still valuable even if you’re not running Battle Medic.\n\n [The Closer](item_173c6d0f-dbe6-440e-924f-0ce08189ddce) \n\n- Enables burst damage on exposed or retreating targets. Pairs well with Valk’s mobility and vertical angles.\n\n## Optional/Swap Items:\n\n [Ogundimu Reduction Field](item_b12daf48-069b-44c1-88fe-221cbcff664d) - +50 Armor; grants scaling damage reduction while under fire—great against pressure comps.\n\n [Rustung Von Wilhelm](item_aea17a63-3f55-4f91-8f49-a7793fbc56c4) - Health/Armor/Shield increase + damage reduction while low—adds a safety net to scrappy fights.\n\n [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) - Delays a portion of incoming damage and spreads it over time—excellent against burst damage and ult combos.\n\n## Round 7 Playstyle Tips:\n\n- Keep beam uptime high—even on full-health allies, you’re adding Overhealth that can absorb critical hits and ult splash.\n\n- In Valk, position near allies to maximize Crepuscular beam spread + Overhealth stacking.\n\n- If running Battle Medic, don’t reload unless forced—maintain that fire rate and clean up stragglers.\n\n- You are no longer passive. You are tempo. Teams win because of you.\n\n- Rotate cooldowns and manage beam flicks with flow—don’t panic GA unless needed.\n\n## Final Round Goal:\n\nOverflow. Sustain. Collapse.\nThis is Mercy’s strongest form—every second you’re alive, your team gets stronger. Your presence is pressure, your Valk is the win condition, and your beams are a tide that can’t be pushed back.",
        "stats": {
            "LIFE": 439,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 489,
            "Attack Speed": 20,
            "Weapon Power": 60,
            "Ability Power": 0,
            "Critical Damage": 10,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "923467c6-94d0-4d7d-85bb-6324d81e503e",
                "notes": "",
                "action": "buy",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "4d81915a-eab4-4d29-91d2-4f445c0ff6b3",
                "notes": "",
                "action": "buy",
                "upgrade_id": "67e0b1c5-3bcb-4ab5-b818-5082e5706124"
            },
            {
                "id": "9c44c085-9c03-4c33-b193-b8d9ad5cac92",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a291de85-b6d9-43cf-b5da-f3184a156f48"
            },
            {
                "id": "106ed627-a343-46d4-b169-daa327ff1213",
                "notes": "",
                "action": "buy",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "e97d5ace-38a2-42bd-bff5-e646ec21b085",
                "notes": "",
                "action": "buy",
                "upgrade_id": "bbaf01d7-340d-4199-b738-86a98d68fe9b"
            },
            {
                "id": "b5c6b9bf-f515-47fc-a372-4efe34602cc5",
                "notes": "",
                "action": "buy",
                "upgrade_id": "173c6d0f-dbe6-440e-924f-0ce08189ddce"
            },
            {
                "id": "6892f3c5-7039-433f-ad0e-e4944997cb49",
                "notes": "",
                "action": "optional",
                "upgrade_id": "ccd0edff-4d57-4ac2-83a7-bab6ff0ffb2f"
            },
            {
                "id": "e2d3baff-b0e3-46bb-ab92-4489298be198",
                "notes": "",
                "action": "optional",
                "upgrade_id": "c6e1c072-ff50-467e-b59f-9506baea10c1"
            },
            {
                "id": "1ba75d3f-bdab-45b0-9bf4-118c29e82a2c",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b12daf48-069b-44c1-88fe-221cbcff664d"
            },
            {
                "id": "bd7916dd-f8b6-4cef-99d2-5326b0e452f8",
                "notes": "",
                "action": "optional",
                "upgrade_id": "aea17a63-3f55-4f91-8f49-a7793fbc56c4"
            },
            {
                "id": "75666a78-32e8-4c3b-a717-f144187b3534",
                "notes": "",
                "action": "optional",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "e28e2eef-adce-4079-966b-695dc75f5c1d",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "df5c551e-1a69-4742-8daf-1a3da0bbd5f2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "fec0554c-2685-4b93-822d-bf0020e654b4"
            },
            {
                "id": "d8a01b83-6a2f-480f-84ab-fda94089b8ce",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "3d973e7a-5b2e-4f02-a10d-3545a512a6f8",
                "notes": "",
                "action": "buy",
                "upgrade_id": "659ff350-8602-42cd-b5f9-f4da7e5e912b"
            }
        ]
    }
]