[
    {
        "id": "204cff57-6402-49f1-b801-ec635250edb2",
        "build_id": "d6c61adb-3ea8-42ca-86a0-4db361a8b167",
        "round_number": 1,
        "cash_earned": 0,
        "created_at": "2025-06-26T08:46:11.784702+00:00",
        "notes": "### 💰 Starting Item Info:\n\nStarting items are pretty standard. You can swap [First Aid Kit](item_0172eaaa-1902-44a3-b989-d12f0f7301da)  for  [Armored Vest](item_358361e2-59be-4c81-b221-8a87f37809e6)  if needed.  [Armored Vest](item_358361e2-59be-4c81-b221-8a87f37809e6)  is the superior option when you think you might be bursted down before you can safely reposition.  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0)  and  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf)  together increase your HPS by about 6 which is quite a lot early. I often see Mercy’s ignore these items in the first round and build only defensive items, which I would not recommend. Damage has not ramped up at this point and unless your team is being rolled, (which you wouldn’t even know until after the fact) you should be able to live without them. \n\n---\n\n### 🗒️ Round Notes: \n\nThis round will be played fairly normally. Prioritize damage boost when you can, but do keep in mind that damage overall will be higher than normal Overwatch. You will need to be healing more often especially if your other support lacks healing or is just focusing on damage. Make it a habit to flick your beam to another ally at least every three seconds to always keep  [Threads of Fate](item_cb61612b-9d83-49a9-989d-013bf084fbcb) active.\n\n---\n\n### 🗨️ General Information: \n\nMercy’s healing is affected by both weapon power and attack speed. Weapon power directly increases the amount she heals and attack speed increases the rate at which Mercy heals. To optimize Mercy’s HPS, you will want both weapon power and attack speed. This becomes less important later as there is a massive lack of epic attack speed items that work well with Mercy’s kit. If your goal is simply to increase your healing, always prioritize rare items first, then add in epic items when you have the funds to start replacing them. I do not know how much cash you will make each round, so you will need to calculate what combination of items will increase your healing the most. \n\n---\n\n### 💡 Tips & Advice:\n\n* **Always spend your cash.** You can sell for full price so please just spend all your cash every round.\n\n* **Know your maps.** Don't waste valk on clash maps when the point doesn't even open for another 10+ seconds. Don't waste valk or go for a risky rez to attempt to save a fight when you have the lead on push maps. Timing your ults and knowing when to start taking risks is very important and depends on your knowledge of map types and ability to pay attention. \n\n* **Don't hold valk.** This is not like normal overwatch, valk should not be saved only to keep yourself alive. Learn to valk aggressively and push damage boost to win fights or defensively even to heal your whole team. You will have valk almost every fight with how fast it builds with healing items, abuse this and valk often. \n\n* **Stay Alive.** This concept should not be new to you if you've played Mercy a long time. Mercy's value comes from staying alive. If you are dead, you are simply not useful at all to your team. Since you will not die often, you will often accumulate a decent sized bounty, don't abandon winnable fights to greed your bounty, but it is something to keep in mind. On top of this, always prioritize defensive items if you think you will need them. It is rarely worth it to be greedy because it can very easily lead to you dying a lot or being unable to aggress with your team when needed, ultimately resulting in very little cash gained. \n \n* **Be self sufficient.** If you want to consistently win games, you need to learn how to rely on your teammates less. The matchmaking in Overwatch in general is not great, but it's especially bad in Stadium. You will often find yourself with teammates who are just so lost and confused and you will need to play and build in a way that makes you depend on them as little as possible. That means not relying on peeling and healing from your other support. Of course it's ideal if your team does acknowledge your existence, but if you are reading this you probably know that doesn't happen often. \n\n* **Hit Tab.** I cannot emphasize this enough. Make it a habit to be checking your teammates and the enemy teams builds every round. This is just a good habit to develop and becomes even more so important when properly itemizing.",
        "stats": {
            "LIFE": 225,
            "Armor": 0,
            "Shield": 25,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 257,
            "Attack Speed": 5,
            "Weapon Power": 5,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "b999422d-5e3d-4599-8c9d-19dc380b3222",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "87496f34-5422-4bd8-bd4d-472621f82c91",
                "notes": "",
                "action": "buy",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "7ccb6f6a-9e3e-400a-a676-e7324d6a5c7a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "5e96c33d-312e-421d-9309-dc6ec7317d8e",
                "notes": "Buy Armored Vest over First Aid Kit when you could be bursted before you have time to reposition.",
                "action": "optional",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "aac5b577-8bb7-49a8-a04d-94bfaf58fb30",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            }
        ]
    },
    {
        "id": "4a0f4294-ba80-492a-b885-515f4d0c1013",
        "build_id": "d6c61adb-3ea8-42ca-86a0-4db361a8b167",
        "round_number": 2,
        "cash_earned": 0,
        "created_at": "2025-06-26T08:46:11.784702+00:00",
        "notes": "### 💰 Item Info:\n\nThis is the ideal round 2 buy, however in the majority of games you will not earn enough cash to afford this and/or you will also need to buy defensive items. [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e)  is the most important item here and is the only item you will buy this round 100% of the time.  [Mid-Air Mobilizer](item_760c1441-8cfa-426c-885d-8d0dec32e145)  can be dropped for more survivability. I would suggest in most scenarios prioritizing  [Vital-E-Tee](item_b92e6f1d-3aac-4eec-b027-00c8e1529016)  over  [Angeleisure Wear](item_00b53ed7-0768-442b-a2c3-8d19608c9391)  if it is your only defensive item.  [Mid-Air Mobilizer](item_760c1441-8cfa-426c-885d-8d0dec32e145)  is also fairly situational as you might not be able to keep it active constantly, so it is something to keep in mind. \n\nIf you are against an enemy [Cassidy](hero_3dd63854-7558-4344-86e4-b506f807129b), [Ashe](hero_37b42a2d-a82d-4a22-9df2-4c812c873b54), [Junkrat](hero_3ac20f6c-2bce-45f3-998e-9129cc6e5c05)  or especially [Freja](hero_e80840a1-845d-4008-966c-585b7cb4a424), you will want to buy [Vital-E-Tee](item_b92e6f1d-3aac-4eec-b027-00c8e1529016) and only replace it in later rounds when we buy [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) or [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) in round 3. If the [Cassidy](hero_3dd63854-7558-4344-86e4-b506f807129b)/[Ashe](hero_37b42a2d-a82d-4a22-9df2-4c812c873b54)/[Junkrat](hero_3ac20f6c-2bce-45f3-998e-9129cc6e5c05)  has poor aim or is generally not focusing you, it can be avoided, but I cannot emphasize enough how important it is into [Freja](hero_e80840a1-845d-4008-966c-585b7cb4a424). She does so much damage early and not only is there a constant threat of being bursted down quickly to her, you will force your other support into wasting important cooldowns to help you. You will always farm more cash when you are not only just staying alive, but able to aggress with your team and not constantly having to back up for healing, fly to a health pack, or even waiting to recover your health with the support passive. \n\n---\n\n### 🗒️ Round Notes: \n\nThis is a really important round for farming Stadium Cash. If you made at least 10k cash, you will have a fairly large spike in your HPS and be able to make a ton of cash this round. Once again, damage boost when you can, but you will want to focus on healing more this round so you can get ahead on cash. \n\nPrioritize more items to increase healing in the early rounds, as you don’t have enough cash to afford the CDR you will need and prioritizing CDR lowers your HPS and hinders your ability to farm cash.",
        "stats": {
            "LIFE": 252,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 5,
            "Total LIFE": 252,
            "Attack Speed": 25,
            "Weapon Power": 15,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "d7fb79a2-03bc-447d-b56e-ed22f4890aec",
                "notes": "",
                "action": "sell",
                "upgrade_id": "0172eaaa-1902-44a3-b989-d12f0f7301da"
            },
            {
                "id": "a6e69e85-c350-4565-92b5-7f8125b0d33a",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "90504eab-b88a-4a27-8d72-23b913b5351e",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "93c10cb6-dac9-4cda-8061-bc54c8fe482a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "29fa30e8-f6ff-4755-b096-30a3a8ae0ef7",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "3243c948-0b60-4cc7-8468-a3188f6c222c",
                "notes": "Decent filler item when on maps with health packs you play near.",
                "action": "optional",
                "upgrade_id": "ab8eba6a-0bda-4b12-8854-4ba4169b515f"
            },
            {
                "id": "98d2c773-7084-4ae6-9dd6-c8a6976dbc77",
                "notes": "After the buffs, this feels really good on Mercy. I wouldn't recommend this against poke damage because it'll get wasted really early, but it's nice.",
                "action": "optional",
                "upgrade_id": "274b7523-8273-4740-aa7b-837f3f143900"
            },
            {
                "id": "8ce3fdd7-7431-4cd0-b978-f9c9298efa3b",
                "notes": "Buy Armored Vest over First Aid Kit when you could be bursted before you have time to reposition.",
                "action": "optional",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "6d1a67eb-f612-49cc-9843-f15738a448f7",
                "notes": "I honestly don't recommend even buying this as a filler item, but I feel like a speedy fairy when I buy this early so do with this information what you will.",
                "action": "optional",
                "upgrade_id": "2a4ffaf4-f14b-47d2-a267-0a0e83e87418"
            },
            {
                "id": "243b9415-c7d3-44d0-989d-c418dce23811",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "0abe5e8f-ad98-4236-aff2-58911de1d9ed",
                "notes": "",
                "action": "buy",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "e0f7b2f3-d02d-4d48-bee0-becda6122b73",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            }
        ]
    },
    {
        "id": "cf9a18bb-38ec-422d-b1d7-877501785a08",
        "build_id": "d6c61adb-3ea8-42ca-86a0-4db361a8b167",
        "round_number": 3,
        "cash_earned": 0,
        "created_at": "2025-06-26T08:46:11.784702+00:00",
        "notes": "### 💰 Item Info:\n\nThere are three main options I will describe below. I highly suggest the first one if you are unsure as it is never a bad option and building towards rez in rounds 3 and 4 can easily result in many deaths or less Stadium Cash gained. Round 3 is a big powerspike for most heroes, so even if you think you will not need the extra survivability, you might find yourself getting focused significantly more this round and in general taking more damage.\n\n1. Against consistent or a mix of consistent and burst damage, build: \n\n[Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) and [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) or [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) are safe to default to in the majority of games. [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) makes valk ridiculously strong and will help you earn more Stadium Cash. Prioritize [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) first when struggling against either dive heroes, are generally being chased a lot and/or your other support isn't helping you much. It's generally the worse option when taking a mix of consistent and burst damage as [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) sees significantly less value into burst damage. If you prefer depending on good movement and positioning to survive, you can always buy those items later, but there will be many games where you cannot rely solely on good movement to keep you alive. There are so many buffs to heroes mobility and overall damage that make it very easy for heroes to chase you or even burst you down in the first place. \n\n2. Against mostly burst damage, build: \n\n[Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) and [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) are really good when struggling against burst damage. Specifically [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) gives you a lot of time to react and reposition into high burst damage. [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) is preferred simply because it makes valk really strong and also helps you earn a lot of Stadium Cash. It isn't always necessary into [Juno](hero_035c63b7-084c-4abd-9de5-c9a00e9b6a18) this early, but against [Junkrat](hero_3ac20f6c-2bce-45f3-998e-9129cc6e5c05) and [Freja](hero_e80840a1-845d-4008-966c-585b7cb4a424), this becomes a must buy. Against those two heroes specifically, I would suggest pretty much always prioritizing [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) over [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) even when facing a mix of consistent and burst damage because of how fast they can kill you and struggle a lot less when you have teammates not helping you.\n\n3. If you believe you can survive without them and can get revives off, build:\n\n[Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448) and [Renaissance](item_a460f234-6434-4d47-99f9-d4a0b15cd591) - Maintain  [Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448)  stacks when you can, but be mindful as it requires you to spam guardian angel basically on cooldown. Don't greed the stacks if it means you could die. Replace  [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) and [Mid-Air Mobilizer](item_760c1441-8cfa-426c-885d-8d0dec32e145)  with  [Icy Coolant](item_8b1c21e9-33e8-49a6-8277-a3a06d55a65f)  and [Ironclad Exhaust Ports](item_2d085fa5-ace6-4fab-9323-b7a06268bcd0)  for more CDR. This is a really risky buy on round 3 as it means you will be earning less cash because you are sacrificing healing early for CDR and you will have less survivability. There are many games where you simply cannot outheal the damage your team is taking early and need to supplement with rez. Typically I do not recommend taking [Renaissance](item_a460f234-6434-4d47-99f9-d4a0b15cd591) if you don't already have [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb), however [Renaissance](item_a460f234-6434-4d47-99f9-d4a0b15cd591) serves the purpose of helping you stabilize your team after using rez, which is greatly important if you are forced to go this route. On top of this, you will build valk slower because you sacrificed so much healing early for CDR. For all these reasons, I highly suggest following the other options, unless you are concerned about a mercy ruling and losing on round 3, then this might be the better option.\n\n---\n\n### 🗒️ Round Notes: \n\nDefensive items will not make you able to facetank any and all damage. They will help you stay alive and give you ample time to reposition and survive while being chased, but will not make you able to rez in the enemy's face or make up for poor positioning. Once again, damage boost when you can, but your focus will be on healing.",
        "stats": {
            "LIFE": 324,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 5,
            "Total LIFE": 324,
            "Attack Speed": 25,
            "Weapon Power": 20,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "8b9b3d9c-fd03-4f40-bdcd-2d768792cd2c",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "0e1fefd9-0887-401e-a4c4-2bea6aeffabd",
                "notes": "",
                "action": "optional",
                "upgrade_id": "0390c8af-2a68-4da2-b876-93da32c3f448"
            },
            {
                "id": "7c336cec-c9c2-400c-a475-b9023265329f",
                "notes": "",
                "action": "optional",
                "upgrade_id": "8b1c21e9-33e8-49a6-8277-a3a06d55a65f"
            },
            {
                "id": "f7b4b078-e833-44d1-8614-5fac6f9fb72c",
                "notes": "",
                "action": "optional",
                "upgrade_id": "2d085fa5-ace6-4fab-9323-b7a06268bcd0"
            },
            {
                "id": "123f4ca3-7321-4d68-a57b-207d14f2a719",
                "notes": "",
                "action": "optional",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "673e272b-9f06-4430-b9e9-55bedd56ea99",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "6e421c1c-28db-49ea-8cef-b7a947bf306e",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c"
            },
            {
                "id": "bedd8dba-18d0-4e00-8212-cd871fb8f9e9",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "7c7c63af-4ff4-4834-b098-21679b9173ce",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "a92934df-3e7f-4df4-859f-3a78dd5a8bd0",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "38905639-5bbd-4751-b89c-a70fe7751a73",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "8d3f45c7-2e42-48b9-a709-916b8b1fa0a6",
                "notes": "",
                "action": "buy",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "29872f3f-1893-466f-aa08-6fc0da52e4bc",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "b241bd63-bc8f-4bc6-be78-dd8f0eee06b8",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            }
        ]
    },
    {
        "id": "1de491d8-2965-45d5-99e8-ed47f7221f80",
        "build_id": "d6c61adb-3ea8-42ca-86a0-4db361a8b167",
        "round_number": 4,
        "cash_earned": 0,
        "created_at": "2025-06-26T08:46:11.784702+00:00",
        "notes": "### 💰 Item Info:\n\nPrioritize defensive items first if you are having a hard time staying alive, then rare items to further increase your healing. \n\n* **Core Healing Items:**\n  *  [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) - great early game item to increase healing\n  *  [Mid-Air Mobilizer](item_760c1441-8cfa-426c-885d-8d0dec32e145) is pretty much the same as  [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) besides the condition for activating it\n\n\n* **Filler Items:**\n  *  [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) - always prioritize the core items first as they are cheaper and give better stats. If you have enough to sell this and buy an epic item, you should always do so \n  *  [Aftermarket Firing Pin](item_2485b212-b286-42d0-a2bd-20eb4396b054) can be bought if you cannot afford [Talon Modification Module](item_c0ca1795-a3ea-4dc9-ae17-f34122574b3a) or if you have enough space for this item and both  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) and  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) \n  *  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) - filler item, if you can't afford both  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) and  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0), prioritize whichever gets you closer to a 1:1 ratio of weapon power to attack speed\n  *  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0) - filler item, if you can't afford both  [Weapon Grease](item_961ae72f-434f-406b-a89b-ab8efec806bf) and  [Compensator](item_2a354f80-610c-4661-9bdd-8960ae1a60b0), prioritize whichever gets you closer to a 1:1 ratio of weapon power to attack speed\n\n* **Optional Items:**\n  *  [Vital-E-Tee](item_b92e6f1d-3aac-4eec-b027-00c8e1529016) is cheap and should be bought if you are struggling to stay alive\n  *  [Chain Evoker](item_812cc89e-feb0-47d0-9e03-9d8e33a80aca) will lower your HPS by quite a lot, but can be worth it early for matches where you are using damage boost a lot and the armor is a nice bonus\n  *  [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) - avoid buying this early unless you believe it'll help you stay alive more than [Vital-E-Tee](item_b92e6f1d-3aac-4eec-b027-00c8e1529016)",
        "stats": {
            "LIFE": 334,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 5,
            "Total LIFE": 334,
            "Attack Speed": 20,
            "Weapon Power": 35,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "68a6d84c-0a15-421f-952e-817e162dadf7",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "b4a06d94-f1cc-46b4-9eca-d6e4f5494981",
                "notes": "",
                "action": "optional",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "60c4a9f1-d843-46bf-9869-11a72e20c420",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "377dd1b5-6853-428c-b7ed-9806c9d1ce68",
                "notes": "",
                "action": "optional",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "7480e532-3f86-47a9-8237-f951744319df",
                "notes": "",
                "action": "optional",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "b10e57f9-fe9d-4713-82c8-ec0d430fc556",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "24fc2f97-3a0e-4b45-9522-3fbf6abffc67",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "7990e5e5-011c-4274-a0ba-e3cf74deb622",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "6f1a098f-5ebc-4d75-a7d8-8894e9b40619",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "035eabb9-7de8-4434-a27d-213771741ae7",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "94d8d673-b243-4530-9b58-973f7f050284",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "860f732d-42e8-4b5a-bb45-399d4c3eef5c",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            }
        ]
    },
    {
        "id": "3bad6bba-9eaf-41d2-83cb-e9a9d88d2e71",
        "build_id": "d6c61adb-3ea8-42ca-86a0-4db361a8b167",
        "round_number": 5,
        "cash_earned": 0,
        "created_at": "2025-06-26T08:46:11.784702+00:00",
        "notes": "### 💰 Item Info:\n\nYou will usually sell all and pivot into CDR. You should have more than enough cash to afford at least 30% CDR. This will lower your overall HPS a little bit, but greatly decrease resurrect cooldown and give you more survivability. Remember to maintain [Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448) stacks when you can, but be mindful as guardian angel needs to be used basically on cooldown and can leave you without it up during crucial moments. \n\n* **Core Items:**\n  *  [Martian Mender](item_0099632b-4e18-450e-844f-22c40e51bc98) for CDR and more survivability\n  *  [Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448) for CDR and weapon power\n  *  [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) for more survivability\n\n* **Filler Items:**\n  * [Icy Coolant](item_8b1c21e9-33e8-49a6-8277-a3a06d55a65f) for CDR and weapon power\n  *  [Ironclad Exhaust Ports](item_2d085fa5-ace6-4fab-9323-b7a06268bcd0) for CDR\n  *  [Advanced Nanobiotics](item_26fcf7c9-b81a-4d8e-a459-b515519cb73e) for healing\n  *  [Angeleisure Wear](item_00b53ed7-0768-442b-a2c3-8d19608c9391) for more survivability and this item becomes significantly more useful when you have both [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) and [Martian Mender](item_0099632b-4e18-450e-844f-22c40e51bc98) because the healing over time stacks and will basically mitigate the DOT from [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) \n  *  [Vital-E-Tee](item_b92e6f1d-3aac-4eec-b027-00c8e1529016) for more survivability\n\n* **Optional Items:**\n  *  [Chain Evoker](item_812cc89e-feb0-47d0-9e03-9d8e33a80aca) will lower your HPS by quite a lot, but can be worth it early for matches where you are using damage boost a lot and the armor is a nice bonus\n  *  [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) - avoid buying this early unless you believe it'll help you stay alive more than  [Vital-E-Tee](item_b92e6f1d-3aac-4eec-b027-00c8e1529016)\n  *  [Angelic Acrobatics](item_baad85fc-3da5-43af-ad9d-f17885f59aa5) is a good mobility item that makes maintaining  [Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448) stacks really easy\n  *  [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) is a defensive item that you should only buy if you need to abuse beam length to stay alive\n\n**Optional:** If your team built defensively or you believe you can keep your team alive with more healing, you can pivot instead into a pure healing variation of this build. For the sake of not bloating this guide with both build variations, I have separated them into two separate guides. You can find the pure healing variation [here](https://stadiumbuilds.io/build/59bbc876-3ec2-4307-9b3a-0a790e52c89a). Keep in mind since the powers taken are mostly the same for both variations, you can easily swap between both builds depending on what you think is more important. There are many many games where I swap between the resurrect variation and healing variation based on items my teammates buy and maps that are easier to heal on and/or riskier to rez on. You do not ever need to hard commit to certain items and should pay close attention to your teammates/enemy teams builds so you know what to prioritize.\n\n---\n\n### 🔹Powers: \n\nRefer to round 7 notes for details on when and why to take certain powers. Consider taking [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) this round if you did not choose it on round 3 if you think the extra healing will keep you alive. Otherwise, you can default to [Renaissance](item_a460f234-6434-4d47-99f9-d4a0b15cd591) as it synergizes with [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) and in general is a strong option in a rez build. \n\n---\n\n### 🗒️ Round Notes: \n\nPlaystyle is relatively the same. Focus on healing and keeping your team and alive and supplement with rez when needed. Don't risk your life to get a rez off unless there is no other choice.",
        "stats": {
            "LIFE": 391,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 391,
            "Attack Speed": 0,
            "Weapon Power": 30,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 30
        },
        "round_upgrades": [
            {
                "id": "a55f446a-c963-4491-9c2e-5016b23aea95",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0099632b-4e18-450e-844f-22c40e51bc98"
            },
            {
                "id": "098494c8-8396-4774-b4cc-fbcc276baed4",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "c9daf054-2541-4bfe-bc56-c2d26441a24f",
                "notes": "",
                "action": "sell",
                "upgrade_id": "2485b212-b286-42d0-a2bd-20eb4396b054"
            },
            {
                "id": "0f71c491-f949-4a03-8588-dc6c8cfd0359",
                "notes": "",
                "action": "sell",
                "upgrade_id": "c0ca1795-a3ea-4dc9-ae17-f34122574b3a"
            },
            {
                "id": "272eba18-8f91-4c44-b5c6-71f66ded4478",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0390c8af-2a68-4da2-b876-93da32c3f448"
            },
            {
                "id": "ab68e0ae-7354-49d9-9c99-38507ace09ad",
                "notes": "",
                "action": "sell",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "dace556e-3635-4318-97db-e4400f5d8e1a",
                "notes": "",
                "action": "sell",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "2ce74a9e-2ac2-4b26-9f2b-9a52f98188f3",
                "notes": "",
                "action": "buy",
                "upgrade_id": "8b1c21e9-33e8-49a6-8277-a3a06d55a65f"
            },
            {
                "id": "84bd340f-4724-4f63-9cc6-0f4653b0bdc0",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2d085fa5-ace6-4fab-9323-b7a06268bcd0"
            },
            {
                "id": "51a84420-f63b-4d9b-8f6c-e028ba052137",
                "notes": "",
                "action": "optional",
                "upgrade_id": "00b53ed7-0768-442b-a2c3-8d19608c9391"
            },
            {
                "id": "ff782f5d-799d-43e4-b13c-fe77baa9c4a3",
                "notes": "",
                "action": "optional",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "b573a415-ccbf-4db9-9a49-d3ce838b205e",
                "notes": "",
                "action": "optional",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "2d7f767e-013c-4901-a583-986ea3ce817d",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "becb8972-c004-423a-9aa5-145323e3c6a0",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "e5f08754-9ec8-4265-8f28-05c142b5c4d2",
                "notes": "",
                "action": "optional",
                "upgrade_id": "a460f234-6434-4d47-99f9-d4a0b15cd591"
            },
            {
                "id": "0ed7a626-0417-41c5-9e11-9d0e8daa1bbb",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "8d1acae5-3ded-4a17-a69e-02b788f82d0a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "2ed41746-9304-4731-b5a8-140ac94af6e5",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c6e1c072-ff50-467e-b59f-9506baea10c1"
            }
        ]
    },
    {
        "id": "09f7fe7f-0db4-4f0a-a21f-a8a9def5b3b2",
        "build_id": "d6c61adb-3ea8-42ca-86a0-4db361a8b167",
        "round_number": 6,
        "cash_earned": 0,
        "created_at": "2025-06-26T08:46:11.784702+00:00",
        "notes": "### 💰 Item Info:\n\n* Your final three epic items are situational and should be bought based on need. \n\n  * [Resurrection Rangefinder](item_99baffec-51b5-42e4-be61-e29f3de8219f) gives a good amount of CDR and also helps you get off some rezzes that would've typically been too risky. It has little value outside of rez so buy this if you cannot outheal the damage your team is taking and need to supplement with rez or if your teammates are frequently dying in spots too risky to rez normally.\n\n  * [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) if you are struggling against mostly burst damage, buy this. This becomes a must buy into [Juno](hero_035c63b7-084c-4abd-9de5-c9a00e9b6a18) and especially [Junkrat](hero_3ac20f6c-2bce-45f3-998e-9129cc6e5c05) and [Freja](hero_e80840a1-845d-4008-966c-585b7cb4a424) to prevent being bursted down before you can react. \n\n  * [Overdrive Core](item_a2a8dba1-5f2f-4da1-9445-b08f49162121) - **I need to test this item a LOT more so take this with a grain of salt.** First impressions are that this item feels really good for the most part. I've had a lot of success pairing this with [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) into high burst teams. It's cheap, it gives a decent amount of weapon power and shields. The passive effect on this item can honestly be completely useless if it gets wasted early or after a lost team fight, but [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) usually gives you ample time to reposition and helps prevent it from proccing super early for the most part. \n\n  * [Ogundimu Reduction Field](item_b12daf48-069b-44c1-88fe-221cbcff664d) can be bought if you still find yourself struggling to stay alive. Only buy this if you already have [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) as it's difficult to max out stacks withut [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8). \n\n  * [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931)  is a great mobility item and can help you make a lot of distance quickly. Be wary if you like to go for rez techs (sj rez, slingshot rez, etc) as this item can very easily put you out of range even with [Resurrection Rangefinder](item_99baffec-51b5-42e4-be61-e29f3de8219f).\n\n  * [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) is a defensive positioning item. 10k for only 10% weapon power is laughable, buy this only when you need to abuse beam length to stay alive or to keep up with your team. Pairs well with [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) for keeping a lot of distance from your teammates, but these items see less value on smaller maps so I recommend selling and buying based on maps if you think you will be able to survive off of good positioning alone.\n\n  * [Chain Evoker](item_812cc89e-feb0-47d0-9e03-9d8e33a80aca) is a great filler item that I typically buy if my other support is healing or if I am able to push damage boost more. \n\n  * [Angelic Acrobatics](item_baad85fc-3da5-43af-ad9d-f17885f59aa5) is another good mobility item. I wouldn’t recommend this if you are struggling to survive over most other options, but it does have a niche use for making it easier to maintain  [Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448) stacks and still buff mobility.\n\n  * [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) - Cheap stat stick for weapon power. This can be replaced late game for [Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b) if you have cash to spare. \n\n  * [Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b) is a stat stick item that we only buy to further increase our healing/damage. Prioritize [Booster Jets](item_a291de85-b6d9-43cf-b5da-f3184a156f48) first if you don't have another attack speed item, then  [Eye of the Spider](item_bbaf01d7-340d-4199-b738-86a98d68fe9b) or [Amari's Antidote](item_67e0b1c5-3bcb-4ab5-b818-5082e5706124) based on budget. \n\n  * [Booster Jets](item_a291de85-b6d9-43cf-b5da-f3184a156f48) - Attack speed stat stick. Movement speed is a nice bonus. \n\n  *  [Aerial Distresser](item_0fcb9020-c729-49b9-b398-3223797b6204) is another good attack speed stat stick. The 25 shields is a nice bonus and the passive effect can be useful while pistoling in valk. \n\n  * [Volskaya Ordnance](item_396c0970-daa8-47e3-8049-e65f03fe5cec) should only be bought if you have a tank with at least 400 more life than you and you need to prioritize healing them. This item gives 10% attack speed and up to 20% weapon power based on how much more health your target has than you.\n\n  * [Iridescent Iris](item_b7fb28ef-ce82-416b-8693-01c274f8df4e) is in my opinion the worst option here, however it has had niche uses in certain rounds where those few seconds of rez cooldown makes a difference. The overhealth after valk can also help you get off a risky rez, but the ability power is completely useless in this build. Avoid this if you can, but it's worth buying in rare situations where your team cannot stay alive and you desperately need more CDR. Pairs well with [First Responder](item_30a5c70f-e0b5-489a-96ae-900f34c3823d). [Icy Coolant](item_8b1c21e9-33e8-49a6-8277-a3a06d55a65f)  and  [Ironclad Exhaust Ports](item_2d085fa5-ace6-4fab-9323-b7a06268bcd0) should always be prioritized over this if you have enough item slots.\n\n**Additional Info:** There are many items that serve very similar purposes in this section that need additional information of when and why to prioritize specific ones. For starters, defensive items that simply make you tankier. [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) paired with [Ogundimu Reduction Field](item_b12daf48-069b-44c1-88fe-221cbcff664d) and optionally [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) make you ridiculously tanky and are the most general purpose in this build. If you don't want to think too much about it, these are great to default to as they are good into all damage types. If you are consistently taking a lot of damage to beam type heroes or heroes like [Soldier: 76](hero_e1ac7ef5-4648-4998-b8b0-9e3da3e60546) (specifically weapon power builds) who do consistent amounts of damage or are receiving a mix of consistent AND burst damage, prioritize the above. However, there are better options if your struggling with mostly burst damage.\n\nAgainst mostly burst damage, [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) will be your best friend. There are *many* items that pair very well with [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) and can be bought if further defensive items are needed. [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) is great to pair here to actually mitigate some of the damage you're taking. Keep in mind that since [Nebula Conduit](item_476b7040-54c9-4f0c-8283-b4407f6809f8) actually mitigates 15% of the damage you are taking, that it might prevent the burst damage you take from actually being over 100 damage at once. This is basically a non issue in the later rounds because damage has ramped up so much, but it should be kept in mind in the mid game. Next [Overdrive Core](item_a2a8dba1-5f2f-4da1-9445-b08f49162121) is another good item to pair if you don't actually need much more to help you survive. It provides significantly less survivability than the other options, but still provides a decent amount of weapon power and [Divine Intervention](item_b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c) helps prevent the passive from getting wasted too early. Other good items to pair are movement based items like [Angelic Acrobatics](item_baad85fc-3da5-43af-ad9d-f17885f59aa5) or [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) for games/rounds where more tankiness is unnecessary. \n\nOther items that aid positioning and/or mobility can also be bought instead in certain matchups or specific maps. There are many games where there is either no dive/flanking heroes, you might often be the last alive on your team, or you simply need items to help you keep up with your team as opposed to helping you stay alive. [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) is a great option on larger maps where you can position yourself further away to keep yourself safe and/or playing with heroes you need help keeping up with like [Reinhardt](hero_a3b6ca2c-6cbd-43dc-bb78-a728e42fba49), [D.Va](hero_e8e1dc68-45c4-47c2-b421-95e33594e6b6), and [Genji](hero_31fd201d-2f46-41e4-b125-9fa9e55fed46). I cannot emphasize this enough, sell this on smaller maps unless for whatever reason you think you still get value from it. [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) pairs really well with [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) by allowing you to play ridiculously far away from your team and reposition with ease. Paired together, these items becomes very useful when struggling against dive heroes as well. I usually would try to avoid [Blessed Boosters](item_957fd380-b7b4-40d4-8333-bb8c535ca931) without [Caduceus Ex](item_9e7965ea-2abc-44a7-b042-950c6ad2fce7) because it can very easily lead to you flying out of beam range and having poor beam uptime. [Angelic Acrobatics](item_baad85fc-3da5-43af-ad9d-f17885f59aa5) is fine? In this build, it's only purpose is to aid movement on top of making it easier to maintain [Hardlight Accelerator](item_0390c8af-2a68-4da2-b876-93da32c3f448) stacks, which you shouldn't be struggling with if you have 30% CDR anyways. If you like the item, go for it. If not, it can be ignored as there are better options.",
        "stats": {
            "LIFE": 403,
            "Armor": 0,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 403,
            "Attack Speed": 0,
            "Weapon Power": 25,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 40
        },
        "round_upgrades": [
            {
                "id": "e823f58b-5dfb-4a3b-8588-edd798def82a",
                "notes": "",
                "action": "optional",
                "upgrade_id": "a460f234-6434-4d47-99f9-d4a0b15cd591"
            },
            {
                "id": "24677472-1da5-4da0-82ac-0336a9e1b93a",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b12daf48-069b-44c1-88fe-221cbcff664d"
            },
            {
                "id": "20a7fd74-3c92-4e48-aa9e-56304a649d2f",
                "notes": "",
                "action": "optional",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "866f88f6-9d18-4719-acb6-dbe4240e2ade",
                "notes": "",
                "action": "optional",
                "upgrade_id": "baad85fc-3da5-43af-ad9d-f17885f59aa5"
            },
            {
                "id": "6bc9a5cd-6a63-4853-a822-ae669d1caf0c",
                "notes": "",
                "action": "optional",
                "upgrade_id": "bbaf01d7-340d-4199-b738-86a98d68fe9b"
            },
            {
                "id": "056c927c-9ed8-4a96-96a7-4879c65f43db",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b7fb28ef-ce82-416b-8693-01c274f8df4e"
            },
            {
                "id": "dc1a3d32-a08f-4374-98b7-467e0e21b6bf",
                "notes": "",
                "action": "buy",
                "upgrade_id": "99baffec-51b5-42e4-be61-e29f3de8219f"
            },
            {
                "id": "0293603c-85e2-49aa-b704-1605c44a1ec9",
                "notes": "",
                "action": "optional",
                "upgrade_id": "173c6d0f-dbe6-440e-924f-0ce08189ddce"
            },
            {
                "id": "6923987d-464d-49cf-90a7-25635b3879e8",
                "notes": "",
                "action": "optional",
                "upgrade_id": "67e0b1c5-3bcb-4ab5-b818-5082e5706124"
            },
            {
                "id": "d6506094-40ad-4187-8a05-07e3dd95b814",
                "notes": "",
                "action": "optional",
                "upgrade_id": "396c0970-daa8-47e3-8049-e65f03fe5cec"
            },
            {
                "id": "40366992-2299-44e0-88e3-315b79a17630",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "d6dc13d6-4949-4b3d-8816-ba883460c453",
                "notes": "",
                "action": "optional",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "972a566d-dc85-43e8-bcee-8f438766a2f0",
                "notes": "",
                "action": "optional",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "d5ec6350-7f09-4af5-978a-50ef0b5c203c",
                "notes": "",
                "action": "optional",
                "upgrade_id": "00b53ed7-0768-442b-a2c3-8d19608c9391"
            },
            {
                "id": "fc3495a8-836a-4c8d-998a-fa06889a4f73",
                "notes": "",
                "action": "optional",
                "upgrade_id": "a291de85-b6d9-43cf-b5da-f3184a156f48"
            },
            {
                "id": "b11ae1a8-bff2-490e-b6fa-a1aea59a0dc6",
                "notes": "",
                "action": "optional",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "80e65dd2-1445-4643-9c52-b77076b22b92",
                "notes": "",
                "action": "optional",
                "upgrade_id": "0fcb9020-c729-49b9-b398-3223797b6204"
            },
            {
                "id": "7e749e19-3c24-481c-b5b9-09c3c08cb1fc",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c"
            },
            {
                "id": "57f7d838-3600-45b5-b401-be4683336df0",
                "notes": "",
                "action": "optional",
                "upgrade_id": "a2a8dba1-5f2f-4da1-9445-b08f49162121"
            },
            {
                "id": "d85db0c9-71a3-40be-8ca1-78d495d449dc",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0099632b-4e18-450e-844f-22c40e51bc98"
            },
            {
                "id": "5162fdcb-5a22-4088-9af0-47d37279a268",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0390c8af-2a68-4da2-b876-93da32c3f448"
            },
            {
                "id": "9a54b664-89cc-4277-ac94-fc96803471f6",
                "notes": "",
                "action": "buy",
                "upgrade_id": "8b1c21e9-33e8-49a6-8277-a3a06d55a65f"
            },
            {
                "id": "f3d1d363-bfda-474d-89eb-e78e02c5f3b9",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2d085fa5-ace6-4fab-9323-b7a06268bcd0"
            },
            {
                "id": "1f9db717-37a7-47ce-9c64-6aae22f417ad",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "67c16c03-5213-4df3-a04e-253bcd25fffc",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "5739c4a4-a442-46fe-8aa9-fc39129ddd25",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "e2e8c42f-2aa6-4fe0-aefb-375c6191e4b6",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c6e1c072-ff50-467e-b59f-9506baea10c1"
            }
        ]
    },
    {
        "id": "6e477c27-caf5-4f7f-9ea8-b640e11cb0d9",
        "build_id": "d6c61adb-3ea8-42ca-86a0-4db361a8b167",
        "round_number": 7,
        "cash_earned": 0,
        "created_at": "2025-06-26T08:46:11.784702+00:00",
        "notes": "### 💰 Item Info:\n\nRefer to round 6 notes for information of when and why to buy specific items. Always prioritize more survivability first if you think you will need it, then more healing if you believe more healing will keep your team alive.\n\n---\n\n### 🔹Power Information: \n\n* Outside of the core powers  [Serenity](item_c6e1c072-ff50-467e-b59f-9506baea10c1) and  [Threads of Fate](item_cb61612b-9d83-49a9-989d-013bf084fbcb), your other two should be picked based on what you or your team needs. Any powers not mentioned are either not worth it in my opinion or complete throw picks like  [Equivalent Exchange](item_82826007-bdfd-4bba-a04a-2f67e6eb7169).\n\n  * [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) is pretty much always safe to take here, it's rarely bad and it's all around just a really good power. If you struggle to stay alive during valk and need to abuse double beam length, avoid this. \n\n  *  [Renaissance](item_a460f234-6434-4d47-99f9-d4a0b15cd591) is really good at helping your team stabilize after losing and bringing a teammate back. It can even punish the enemy team for pushing forward if you successfully get the rez off. Synergizes really well with  [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) and I would honestly suggest not taking this power without it. [Crepuscular Circle](item_c0b93ed2-b692-44d5-a38a-ce5a63e83cdb) can be taken alone, but in my experience [Renaissance](item_a460f234-6434-4d47-99f9-d4a0b15cd591) doesn't feel as good as some of the other options when by itself. \n\n  * [Distortion](item_5557e2f2-02df-4eac-8128-0c23b71183b1)  is better in matches where you find yourself actually able to use dmg boost more often. Typically if your other support is building to heal their team and/or you have good DPS. Contrary to popular belief, this power affects both weapon and ability based damage. \n\n  * [Triage Unit](item_fec0554c-2685-4b93-822d-bf0020e654b4) can be picked if you need more healing and/or most of your teammates that drop below 50% life can actually be healed through it. Oftentimes when your teammates drop this low, they usually die very soon after and there is no amount of healing that will keep them up. If you take this, try to be mindful with your Guardian Angel usage as you could have it on cooldown when you need to proc this urgently. \n\n  * [First Responder](item_30a5c70f-e0b5-489a-96ae-900f34c3823d) is pretty much only taken here when your team is hopeless. They likely built zero defensive items, cannot stay alive and you are holding your team together through rez and require  [First Responder](item_30a5c70f-e0b5-489a-96ae-900f34c3823d)  to survive most rezzes.  Pairs pretty well with  [Iridescent Iris](item_b7fb28ef-ce82-416b-8693-01c274f8df4e) but if i find myself having to build this combo, it's usually hopeless. \n\n  * [Protective Beam](item_3f1ef995-8ecc-45fb-8b57-26fdccc21feb) from my experience, there are two main reasons to take this power. If you are pocketing someone good or if your team built fairly defensively. I tested this item out a lot with squishy teams hoping it would help them survive initial bursts of damage, which it kind of does, but they almost always end up dying to follow up damage immediately after rendering this power useless. For that reason, I would stay away from this power with very squishy teams.",
        "stats": {
            "LIFE": 428,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 478,
            "Attack Speed": 20,
            "Weapon Power": 15,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 30
        },
        "round_upgrades": [
            {
                "id": "a99d04dd-570f-4b80-a203-124751ace427",
                "notes": "",
                "action": "optional",
                "upgrade_id": "fec0554c-2685-4b93-822d-bf0020e654b4"
            },
            {
                "id": "0cb3ff48-51df-4cfc-bcf6-664c95a2fe66",
                "notes": "",
                "action": "optional",
                "upgrade_id": "5557e2f2-02df-4eac-8128-0c23b71183b1"
            },
            {
                "id": "87cc8527-5a1c-45c9-90a9-24bb6b251fe0",
                "notes": "",
                "action": "optional",
                "upgrade_id": "30a5c70f-e0b5-489a-96ae-900f34c3823d"
            },
            {
                "id": "c1f1451d-abe1-4014-bbab-1dc1d56ba8c3",
                "notes": "",
                "action": "optional",
                "upgrade_id": "3f1ef995-8ecc-45fb-8b57-26fdccc21feb"
            },
            {
                "id": "3d7515e4-5ccd-4604-bcba-98ba6cb7825f",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b7fb28ef-ce82-416b-8693-01c274f8df4e"
            },
            {
                "id": "4b935513-574c-4cd8-a43e-bd021c75b58c",
                "notes": "",
                "action": "optional",
                "upgrade_id": "baad85fc-3da5-43af-ad9d-f17885f59aa5"
            },
            {
                "id": "84207bee-f107-457d-988a-e6b0664aa799",
                "notes": "",
                "action": "optional",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "e6f3ff78-3c33-4628-b71f-4b128c886dff",
                "notes": "",
                "action": "optional",
                "upgrade_id": "173c6d0f-dbe6-440e-924f-0ce08189ddce"
            },
            {
                "id": "a9b53acf-2269-4cb8-8670-c7be660cedd7",
                "notes": "",
                "action": "optional",
                "upgrade_id": "bbaf01d7-340d-4199-b738-86a98d68fe9b"
            },
            {
                "id": "2aa2b4a6-a2bd-43b3-9bb7-cfe1224cdbd9",
                "notes": "",
                "action": "optional",
                "upgrade_id": "396c0970-daa8-47e3-8049-e65f03fe5cec"
            },
            {
                "id": "13df97a8-263b-4b15-a0eb-baa831272096",
                "notes": "",
                "action": "optional",
                "upgrade_id": "8b1c21e9-33e8-49a6-8277-a3a06d55a65f"
            },
            {
                "id": "0129a2f1-ddf5-4a89-b7ae-40536402a3d4",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "d1e09aa6-dc53-45ec-9c27-655ead7903e0",
                "notes": "",
                "action": "optional",
                "upgrade_id": "957fd380-b7b4-40d4-8333-bb8c535ca931"
            },
            {
                "id": "384e624f-9f4c-4d9a-9a09-b74424dcfea4",
                "notes": "",
                "action": "optional",
                "upgrade_id": "00b53ed7-0768-442b-a2c3-8d19608c9391"
            },
            {
                "id": "76bb92b6-2bbf-4a00-894a-edeebfe5e2cb",
                "notes": "",
                "action": "optional",
                "upgrade_id": "2d085fa5-ace6-4fab-9323-b7a06268bcd0"
            },
            {
                "id": "a11f9775-556d-43bd-87a9-9169eecbf80f",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a291de85-b6d9-43cf-b5da-f3184a156f48"
            },
            {
                "id": "a8d9cd18-d901-4015-a208-6d76def6a338",
                "notes": "",
                "action": "optional",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            },
            {
                "id": "fea1eeb2-3e92-4654-849f-2a2fe1fad64f",
                "notes": "",
                "action": "optional",
                "upgrade_id": "67e0b1c5-3bcb-4ab5-b818-5082e5706124"
            },
            {
                "id": "d8074ed6-b82f-4c43-b4a5-0b6ca717fd85",
                "notes": "",
                "action": "buy",
                "upgrade_id": "b12daf48-069b-44c1-88fe-221cbcff664d"
            },
            {
                "id": "7eda4ce6-e1e6-4db1-9134-71ea75e16778",
                "notes": "",
                "action": "buy",
                "upgrade_id": "99baffec-51b5-42e4-be61-e29f3de8219f"
            },
            {
                "id": "af795934-f7fb-48c2-88e9-2451bcadca7a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0099632b-4e18-450e-844f-22c40e51bc98"
            },
            {
                "id": "2367c153-30bb-4857-8a04-f4bf6573da63",
                "notes": "",
                "action": "buy",
                "upgrade_id": "0390c8af-2a68-4da2-b876-93da32c3f448"
            },
            {
                "id": "a8a207c6-790a-48cb-817d-bb7b5cb9cd50",
                "notes": "",
                "action": "buy",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "7b2bacaa-61a0-45bd-a982-a4bcf64a0283",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "a9969528-66b9-44fd-8ac1-04c873f92e3b",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "0b271402-3008-4abe-a9df-bff8e3112be1",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c6e1c072-ff50-467e-b59f-9506baea10c1"
            },
            {
                "id": "8df22c55-7249-4e39-ab4c-9c36f26d5a68",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a460f234-6434-4d47-99f9-d4a0b15cd591"
            }
        ]
    }
]