[
    {
        "id": "c9c14697-1a75-4c10-87a4-d202377ce937",
        "build_id": "f36e9dfe-1e0b-4775-b4c9-4a6e04d248ce",
        "round_number": 1,
        "cash_earned": 0,
        "created_at": "2025-05-07T01:57:23.39077+00:00",
        "notes": "General notes about this build before we get into future rounds\n\n1. This build is intended to maximize the value you can get from damage boost. We will primarily build into abilities that make it so you can exclusively damage boost the entire game (hence 100% damage boost).\n\n2. Understanding pocket priority is very important. The same fundamental mercy rules apply to this build but since you are not relying on outright sustain, you are incredibly fragile.\n\n3. On that fragility, expect your team to die, especially your tank. This build is incredibly bad at supporting a tank, you are still able to give them damage boost if they're actively brawling but you will never out heal the dmg they are taking. Building this way makes rez incredibly valuable in stabilizing a fight as that's your only form of \"burst heal\"\n\n4. We will be building into weapon power and attack speed, this isn't so you can heal large amounts of damage but so you can sustain enough poke to continue pushing dmg boost. Your ability to quickly triage is how you keep your squishes stable, the less time you spend healing the more often they're able to deal amplified damage.\n\nNow for the round 1 build.\n\nRound 1 Power: This playstyle hinges on your ability to use your round 1 power. Since you are looking to never heal, you absolutely need to keep both dpses pocketed at all times. You will be doing this for every single round up until round 7, the only time this ability is irrelevant is during valk. Occasionally your dps will not have a good angle OR your support/tank is using important abilities (firestrike, torpedos, coalescence etc.), you need to watch for these cooldowns and damage boost them when appropriate. Otherwise default to your dpses\n\nRound 1 abilities: These are simple, weapon power and armour. I don't really do anything differently on the first round ever.",
        "stats": {
            "LIFE": 225,
            "Armor": 25,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 250,
            "Attack Speed": 5,
            "Melee Damage": 0,
            "Reload Speed": 0,
            "Weapon Power": 5,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "755e5beb-60ae-41e1-9713-b8cd3c0bb022",
                "notes": "",
                "action": "buy",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "d9a6d095-8168-49a5-b2e7-ba7545e0ebdc",
                "notes": "",
                "action": "buy",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "fd6b3d64-57ef-4c17-9faa-ea6784268fa4",
                "notes": "",
                "action": "buy",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "11cf4859-14e8-4da0-a471-2ac6862ce4b1",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            }
        ]
    },
    {
        "id": "008b8217-92f0-425d-b64e-0148cebddc0f",
        "build_id": "f36e9dfe-1e0b-4775-b4c9-4a6e04d248ce",
        "round_number": 2,
        "cash_earned": 0,
        "created_at": "2025-05-07T01:57:23.39077+00:00",
        "notes": "Your primary goal for this round is to have 10k cash available for chain evoker. If you played well in R1 then you should have just enough. If not continue building into weapon power + armor.\n\nChain evoker: I believe this is the most fundamental item mercy needs to have to make her dmg boost heavy playstyle work. Base mercy generates minimal ult charge from damage boosting, however the increase in total dmg boosted AND ult charge generation with this ability puts it on par with healing.\n\nNow why is this important? Mercy compared to the rest of the cast lacks consistency in her aoe abilities. Every other support has some form of strong burst healing that's on a shorter cooldown. The only way mercy is able to stabilize a fight is through rez and valk. Getting valk fast is crucial because rezzes are too inconsistent to play around exclusively, especially early game. (Note that rezzes ARE inconsistent early on, but generally you see the value of them drop off as we reach late game. It's a good idea to still attempt them early on.)",
        "stats": {
            "LIFE": 245,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 295,
            "Attack Speed": 0,
            "Melee Damage": 0,
            "Reload Speed": 0,
            "Weapon Power": 0,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "4595ac2d-533c-4c5e-a094-c9ad2236b6ea",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "61e73426-15d0-44bb-96ea-1691428d326b",
                "notes": "",
                "action": "sell",
                "upgrade_id": "2a354f80-610c-4661-9bdd-8960ae1a60b0"
            },
            {
                "id": "7dfff10e-edbe-4417-8d47-58c75aec606a",
                "notes": "",
                "action": "sell",
                "upgrade_id": "961ae72f-434f-406b-a89b-ab8efec806bf"
            },
            {
                "id": "58100fcd-837b-4032-a850-621f4c2dd575",
                "notes": "",
                "action": "sell",
                "upgrade_id": "358361e2-59be-4c81-b221-8a87f37809e6"
            },
            {
                "id": "f187e896-5503-49b2-9337-03138921058f",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "c44acb17-4953-49e4-832d-1184d3ee3922",
                "notes": "",
                "action": "optional",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "0b922388-bf96-4bcf-a2eb-798ebdab24b9",
                "notes": "",
                "action": "buy",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            }
        ]
    },
    {
        "id": "09165e00-1f7e-4cf2-9a93-7122de4d1b03",
        "build_id": "f36e9dfe-1e0b-4775-b4c9-4a6e04d248ce",
        "round_number": 3,
        "cash_earned": 0,
        "created_at": "2025-05-07T01:57:23.39077+00:00",
        "notes": "Now let's talk about two things, rez and team comps.\n\nFirst things first, let's go over how the dps work with this mercy playstyle.\n\nShort range, brawl: Mei, Reaper, Genji, Cassidy (Less so)\n\nThese characters excel in up close burst damage and outright sustain compared to the long range dps. As mercy, you are more vunerable to enemy aggression when pocketing these characters, however I have noticed (especially with reaper), their potential to shred through enemies is unparalleled, specifically with a pocket. It's very likely you'll need to build slightly more into armour + survival due to this. However it works in your favor as these characters often have a way to sustain themselves unlike the long range dps so you will not need to build so heavily into weapon power + speed.\n\nLong range, poke: Ashe, Soldier, Cassidy (More so)\n\nThese characters excel in long range damage but tend to be more vunerable when closed in on. You're less likely to be absorbing enemy aggression with these characters but your pockets tend to need more hand holding due to lack of self sustain. These characters have the ability to also deal high burst dmg but need more care so you'll be building into weapon power + speed moreso than survival here.\n\nCassidy\n\nCassidy is weird, he fits both architypes somewhat but his sustain in brawl comes from a higher health pool as opposed to healing. He still would rather play near his max distance, so nowhere near as close as the other brawl type dps, but not as far as soldier/ashe.\n\nNow you can always get a combination of both dps archetypes, I want to say 90% of the time, if the brawly characters are in positions to deal damage, I prioritize them over the long range pocket. I will still continue to fly back to the long range pocket to reattach my beam but my main concern is to push aggression as much as physically possible. Stadium tends to be brawlier than standard overwatch, angles still matter but distance is less desirable for mercy as she's able to be more consistently mobile in this mode.\n\nNow for rez.\n\nRez is important to build into for the same reason it's important to have valk often. Mercy needs to be able to stabilize her team somewhat. Often times if you want to rez I recommend pushing dmg boost as hard as possible to pepper down the enemy to make the rez safe as they recover.\n\nThe round 3 power is self explanatory, it just makes rez more valuable. Not only does one teammate come back you have 5 seconds of AOE healing or dmg boost to keep the fight up.\n\nItems\n\nWith the items listed on this round, the rez range buff is nice, but generally unneeded if you're not finding yourself getting pressured while rezzing. The more willing the enemy is to chase you the better the rez range increase is.\n\nAdvanced nanobiotics synergizes with mercy incredibly well. The moment you need to triage you get additional healing to make the process faster. Id recommend having this until the end",
        "stats": {
            "LIFE": 253,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 303,
            "Attack Speed": 0,
            "Melee Damage": 0,
            "Reload Speed": 0,
            "Weapon Power": 5,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "63131cbe-1df2-49c1-a50d-cb91824f3dc7",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "1075a097-d602-49a8-acaf-9946b5af4857",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a460f234-6434-4d47-99f9-d4a0b15cd591"
            },
            {
                "id": "64e3d076-02f2-44ce-89ed-fb74c7f3406e",
                "notes": "",
                "action": "optional",
                "upgrade_id": "99baffec-51b5-42e4-be61-e29f3de8219f"
            },
            {
                "id": "23890300-7c23-4e92-a318-a6ea252b1cb8",
                "notes": "",
                "action": "optional",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "6d346c03-c6b9-4240-9980-af0a5bba317c",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "cb24cca0-754e-40f1-a205-85028aca8541",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b64cee07-ca32-405d-987e-868b415bbc09"
            },
            {
                "id": "1058dd16-0524-4dc3-986f-3d17172050cb",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "b2640ba6-4cbf-49c1-860f-7a24d5b1dc7f",
                "notes": "",
                "action": "buy",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            }
        ]
    },
    {
        "id": "40c897a5-1374-4eb3-b374-6f8f5ccd5e5a",
        "build_id": "f36e9dfe-1e0b-4775-b4c9-4a6e04d248ce",
        "round_number": 4,
        "cash_earned": 0,
        "created_at": "2025-05-07T01:57:23.39077+00:00",
        "notes": "Caduceus Ex is your next big ability. The additional distance makes it easier to maintain constant beam connection between your two teammates, especially if they function at drastically different ranges (Reaper + Ashe for example.)\n\nNot much more to say for this round. It plays similarly to the last round. Continue to build into what's needed for you to function in your environment. Most of the time you'll have extra cash but not enough for a rare or uncommon, don't be afraid to fill up on common buffs if there's room.",
        "stats": {
            "LIFE": 273,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 323,
            "Attack Speed": 0,
            "Melee Damage": 0,
            "Reload Speed": 0,
            "Weapon Power": 15,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "0e29b6bf-f493-4fef-b01c-3418e1906501",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "df4344ea-6cd7-4620-93bd-87ac698fcf75",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a460f234-6434-4d47-99f9-d4a0b15cd591"
            },
            {
                "id": "9069d467-0866-4596-a97f-42ed0680e6ae",
                "notes": "",
                "action": "optional",
                "upgrade_id": "99baffec-51b5-42e4-be61-e29f3de8219f"
            },
            {
                "id": "f15e07c1-1183-4f9f-8b1c-10a9a9863def",
                "notes": "",
                "action": "buy",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "20c99921-b934-48f0-9767-e3d9772db3cf",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "612bd471-cb43-4b27-9550-89318f337200",
                "notes": "",
                "action": "buy",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            }
        ]
    },
    {
        "id": "62c04efe-4b1e-4e36-ba7d-97e161a14cb6",
        "build_id": "f36e9dfe-1e0b-4775-b4c9-4a6e04d248ce",
        "round_number": 5,
        "cash_earned": 0,
        "created_at": "2025-05-07T01:57:23.39077+00:00",
        "notes": "Now here's where you make an important build decision. There's two different way it goes from round 5 on. The final two powers will vary depending on what direction you'd like to go. I'll be going over both builds.\n\nFirst, I'll go over Crepuscular Circle.\n\nThis Power is in both builds and is one of mercy's strongest powers. It's incredibly important to note that having your staff out during valk is useless while you have this power. As we've been building into attack power + speed, you're already a stronger than normal battle mercy so make sure you pull out your glock after every rez, and during valk.\n\nBuild 1\nTraditional damage boost build\nCrepuscular Circle + Distortion\n\nThe order you get these two powers matter less than build 2. I often time start off with Distortion if my dps are doing incredibly well and putting out large damage numbers.\n\nThis build tends to work best with a poke heavy dps lineup. Them dealing damage will provide some form of self sustain that they generally lack which means you are able to push damage boost as hard as possible even on injured teammates.\n\nBuild 2\nBattle mercy rez build\nCrepuscular Circle + Battle Medic\n\nNote: It is vital that you do NOT get battle medic before Crepuscular Circle. I say this as you're unable to properly benefit from Battle Medic without having Crepuscular Circle as valk is too valuable to be wasting time with your Glock out and no beam attached.\n\nThis build tends to work best if you're finding that you're getting lower dmg boost numbers than normal. Sometimes our teammates just don't hit as many shots so the lifesteal from distortion is less valuable. Aswell, you're already closer to the fight and since Crepuscular Circle already gives you an opening to pull out the glock, building into your own lethality can turn fights even if you're just pumping their frontline full of spam.\n\nNow for items.\n\nMost crucial items we got early on. The order you get the remainder of the items does not matter, it just depends on what you feel like is needed in that situation. We still want to apply the same rules that I mentioned early on about pushing dmg boost as much as possible. The items you get should facilitate that.",
        "stats": {
            "LIFE": 299,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 349,
            "Attack Speed": 10,
            "Melee Damage": 0,
            "Reload Speed": 0,
            "Weapon Power": 35,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 0
        },
        "round_upgrades": [
            {
                "id": "62ad5e23-903e-4f44-a6a3-d0262dbfef71",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "2988201f-6e07-4b44-b1d5-4782891ffdf2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a460f234-6434-4d47-99f9-d4a0b15cd591"
            },
            {
                "id": "9ecf17ef-1c7b-4ebe-8535-b49bacec89ac",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "91ccfe70-5184-4631-9e40-95b19fa0ad9f",
                "notes": "",
                "action": "optional",
                "upgrade_id": "f16d03a7-f20e-4a1d-a1f6-55863e163c03"
            },
            {
                "id": "a40c0b7a-e183-486a-ad42-d92dd1d7a5c9",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b64cee07-ca32-405d-987e-868b415bbc09"
            },
            {
                "id": "3ae97651-9a36-49dd-bfa0-9628d9d257b0",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b92e6f1d-3aac-4eec-b027-00c8e1529016"
            },
            {
                "id": "9bc92519-8542-48dc-828b-c37c335a26e2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "5111310b-86e3-400b-a766-507e1287fc48",
                "notes": "",
                "action": "buy",
                "upgrade_id": "caa96c7e-655f-4d03-9bd9-0f41937fec27"
            },
            {
                "id": "78df9076-1d50-4162-a17f-9a2816031e36",
                "notes": "",
                "action": "optional",
                "upgrade_id": "99baffec-51b5-42e4-be61-e29f3de8219f"
            },
            {
                "id": "66e13075-7398-4d05-a494-83931211c72f",
                "notes": "",
                "action": "optional",
                "upgrade_id": "b5148b7f-8529-4b1b-a90c-5d7cf13f8f0c"
            },
            {
                "id": "8f94a857-51e1-4e98-b9b8-863583118ad9",
                "notes": "",
                "action": "optional",
                "upgrade_id": "0099632b-4e18-450e-844f-22c40e51bc98"
            },
            {
                "id": "b2813e7c-a976-4a7a-956a-0a2a2177dddf",
                "notes": "",
                "action": "optional",
                "upgrade_id": "476b7040-54c9-4f0c-8283-b4407f6809f8"
            },
            {
                "id": "f6fbd3f4-4f6b-491e-ac41-cfd011ee7981",
                "notes": "",
                "action": "buy",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "213c3b36-1665-4bbb-bf85-ee873d0fd372",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "f943e371-5ed5-4713-b4f9-70120302552d",
                "notes": "",
                "action": "buy",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            }
        ]
    },
    {
        "id": "64b41045-77a1-4533-a375-6bd82925b0e3",
        "build_id": "f36e9dfe-1e0b-4775-b4c9-4a6e04d248ce",
        "round_number": 6,
        "cash_earned": 0,
        "created_at": "2025-05-07T01:57:23.39077+00:00",
        "notes": "I won't be adjusting items from this point on. As always build into weapon power or speed as a default. If you're getting focused there's additional survival abilities to mitigate that aggression.\n\nMuch like round 4, there's not much new here. Continue adjusting as needed.",
        "stats": {
            "LIFE": 319,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 369,
            "Attack Speed": 10,
            "Melee Damage": 0,
            "Reload Speed": 0,
            "Weapon Power": 35,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 10
        },
        "round_upgrades": [
            {
                "id": "f9e6fd97-0fbb-4097-9e98-069b6f924b8a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "e0cc6748-c10b-4711-8bd0-c2c1e442fa1a",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a460f234-6434-4d47-99f9-d4a0b15cd591"
            },
            {
                "id": "128e79db-8fbb-4b0f-9b96-dd59581335e7",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "9a6d6b56-f06b-4aa3-9961-44e9b12f76e7",
                "notes": "",
                "action": "buy",
                "upgrade_id": "99baffec-51b5-42e4-be61-e29f3de8219f"
            },
            {
                "id": "a067cbbf-7ae0-4924-911b-00b4f34abef0",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "ca9f05e8-c20c-42c9-a06b-ba2e4d30397f",
                "notes": "",
                "action": "buy",
                "upgrade_id": "caa96c7e-655f-4d03-9bd9-0f41937fec27"
            },
            {
                "id": "c544951b-a173-4575-b186-8a8a18d18e0c",
                "notes": "",
                "action": "buy",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "dfe44d1d-7746-4fde-b6c0-c0aa654c99b1",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "f089d83a-82b4-4c70-b385-3e7269104b05",
                "notes": "",
                "action": "buy",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            }
        ]
    },
    {
        "id": "bba1dfb2-2b94-45a4-b96a-1b3f2ffab5ad",
        "build_id": "f36e9dfe-1e0b-4775-b4c9-4a6e04d248ce",
        "round_number": 7,
        "cash_earned": 0,
        "created_at": "2025-05-07T01:57:23.39077+00:00",
        "notes": "Alright, the final round.\n\nI set Distortion as the default, but as mentioned in R5, feel free to choose Battle Medic if you see fit.\n\nThe final round tends to be more sustain heavy. Expect to get more greedy rezzes as there's so much happening during these fights. In turn you should be able to build valk incredibly quickly if you're keeping up with your dps and pocketing any sort of aggression. Note that the lifesteal during valk applies to your entire team if you went that route, ensure all 4 of your teammates are within your valk range.\n\nIf you went with battle medic, it would likely be worth getting the Rare item Vital-E-Tee. 110 armor let's you get away with risky rezzes and gives you some self sustain during valk so you can go for aggressive Glock plays. Of course it isn't the highest rarity but it's incredibly underrated in my opinion.\n\nNot much else to say but I'll reiterate one last time, this build is not intended to let you heal. Proceed at your own risk but I've had incredible success as characters like Juno or Moira are more build to \"Healbot\". Your primary strength as mercy is access to 24/7 dmg boost. Do not be afraid to neglect your tank or other support as it's their job to minimize the damage they take, not yours.",
        "stats": {
            "LIFE": 319,
            "Armor": 50,
            "Shield": 0,
            "Max Ammo": 0,
            "Move Speed": 0,
            "Total LIFE": 369,
            "Attack Speed": 10,
            "Melee Damage": 0,
            "Reload Speed": 0,
            "Weapon Power": 35,
            "Ability Power": 0,
            "Critical Damage": 0,
            "Weapon Lifesteal": 0,
            "Ability Lifesteal": 0,
            "Cooldown Reduction": 10
        },
        "round_upgrades": [
            {
                "id": "85716a22-2cfc-4477-8a7f-6f0381d569aa",
                "notes": "",
                "action": "buy",
                "upgrade_id": "cb61612b-9d83-49a9-989d-013bf084fbcb"
            },
            {
                "id": "07b6ba19-a1e4-457b-a937-429a212008cb",
                "notes": "",
                "action": "buy",
                "upgrade_id": "a460f234-6434-4d47-99f9-d4a0b15cd591"
            },
            {
                "id": "a65a93fe-c06a-4319-a9b7-6ad4956608e3",
                "notes": "",
                "action": "buy",
                "upgrade_id": "c0b93ed2-b692-44d5-a38a-ce5a63e83cdb"
            },
            {
                "id": "d217dcb7-71ba-4ef6-a162-6f6c099b2fc9",
                "notes": "",
                "action": "buy",
                "upgrade_id": "5557e2f2-02df-4eac-8128-0c23b71183b1"
            },
            {
                "id": "1988033e-17fc-4cdc-91a5-b1d47453226e",
                "notes": "",
                "action": "buy",
                "upgrade_id": "99baffec-51b5-42e4-be61-e29f3de8219f"
            },
            {
                "id": "e6c239b8-a952-41a7-87f4-028b867c7b3b",
                "notes": "",
                "action": "buy",
                "upgrade_id": "760c1441-8cfa-426c-885d-8d0dec32e145"
            },
            {
                "id": "a0aefd4c-b331-4db7-beb1-80d62404b131",
                "notes": "",
                "action": "buy",
                "upgrade_id": "caa96c7e-655f-4d03-9bd9-0f41937fec27"
            },
            {
                "id": "26cf238f-af8b-4904-b7c7-692618878738",
                "notes": "",
                "action": "buy",
                "upgrade_id": "9e7965ea-2abc-44a7-b042-950c6ad2fce7"
            },
            {
                "id": "a7b05be0-b215-4982-899f-c6e8c3ef02e2",
                "notes": "",
                "action": "buy",
                "upgrade_id": "26fcf7c9-b81a-4d8e-a459-b515519cb73e"
            },
            {
                "id": "c9ebcf1d-6748-405d-b4c1-6070ad56d6e1",
                "notes": "",
                "action": "buy",
                "upgrade_id": "812cc89e-feb0-47d0-9e03-9d8e33a80aca"
            }
        ]
    }
]